export default {
  炽焰头盔: '自身900范围内的友军单位，增加10%攻击速度与20%移动速度',
  修罗血面:
    '修罗血界：增加100%攻击速度与移动速度，增加4X主属性，攻击时吸血，回复最大生命值30%的血量，持续8秒，冷却时间90秒',
  魔龙战盔: '魔法免疫持续5秒\r\n\r\n',
  '真 魔龙战盔': '魔法免疫持续5秒\r\n',
  亡魂头盔:
    '亡魂怨曲：增加30%魔法抗性，增加350主属性，当血量低于40%时使用时，眩晕425范围内单位3秒BOSS为0.9秒，回复最大生命值40%的血量，额外增加100主属性，持续8秒，冷却90秒',
  奥布里皮帽:
    '奥布里叹息：当生命值低于25%时触发，回复最大生命值40%血量，仅在触发时作用一次，提升600智力，对400范围内敌人造成（50X智力）魔法伤害，眩晕1.5秒，BOSS为0.45秒，提升智力效果持续15秒，内置CD20秒，冷却时间内不能丢弃',
  圣痕战盔: '自身675范围友军单位，增加30%移动速度，提升175生命恢复速度。\r\n魔法免疫持续5秒',
  巫妖王之盔: '当受到物理攻击时， 10%几率冰冻攻击者1.5秒BOSS为0.45秒',
  巫妖王头巾: '当受到物理攻击时， 10%几率冰冻攻击者1.5秒BOSS为0.45秒',
  神圣头盔: '魔法免疫持续5秒',
  杀戮头盔:
    '杀戮叹息：增加25%攻击速度与移动速度，增加350主属性 致命一击倍率+0.2 ，当血量低于40%时使用时，对450范围内单位造成（75X最高属性值）魔法伤害，眩晕450范围内单位5秒BOSS为1.5秒，回复最大生命值70%的血量，额外增加150主属性，持续8秒，冷却90秒',
  圣佑头盔:
    '被攻击时1/8触发，回复2.5%X最大生命值血量 内置CD5秒。\r\n点击使用15秒内提升20000点最大生命值，7500魔法值，冷却时间180秒',
  恶魔领主的号角:
    '灵魂锁链：每秒回复自身最大生命值13.3%的血量，每秒对被链接单位造成（(8X最高属性值+最大生命值13.3%）魔法伤害 ，持续5秒，在链接时间内杀死单位，增加350主属性，增益效果持续300秒，重复触发不可叠加，刷新持续时间，冷却时间150秒。',
  深渊之眼: '召唤技能冷却中，智力减少为333，冷却时间为100秒',
  '真 奥布里皮帽':
    '隐形技能效果：持续20秒，冷却60秒\r\n奥布里叹息：当生命值低于25%时触发，回复最大生命值40%血量，仅在触发时作用一次，提升750智力，对400范围内敌人造成（75X智力）魔法伤害，眩晕1.5秒BOSS为0.45秒，提升智力效果持续15秒，内置CD20秒，冷却时间内不能丢弃',
  灾难头巾:
    '神秘技能：死亡后，对自身600范围内的敌方单位，造成（275X主属性）魔法伤害，内置冷却时间30秒。',
  窥视之眼:
    '死亡回春：对750范围内的所有敌人造成250X智力魔法伤害，并使其伤害抗性降低8％,持续4秒，冷却时间：120秒。',
  霜寒花冠:
    '霜寒赋予：技能伤害+10%，全属性+375，持续时间内使用技能，20%几率冰冻自身1000码内敌人1秒，持续12s，冷却CD100s',
  '魔渊 法力之源': '效果:提升750智力,增加5000最大魔法值,持续8秒,冷却60秒',
  '真 魔渊 法力之源': '效果:提升1000智力，增加5%技能伤害，持续8秒，冷却时间60秒。',
  圣天使之环: '魔法免疫持续5秒',
  异端审判:
    '审判：0.2秒充能一次，最多5层充能，每次普攻附带（0.75X主属性）纯粹伤害。\r\n魔法免疫持续5秒。',
  噩梦战盔:
    '死亡凝视：攻击25%几率1秒后提升后，暴击倍率提升0.2倍，敏捷增加 750，攻击伤害增加15%，持续时间6秒，内置CD15秒。',
  '信仰 圣佑之盔':
    '生命恢复\r\n1/4概率触发，回复5%X最大生命值血量,回复10%X最大魔法值，内置CD3秒。\r\n使用1000范围提友方单位增加40%魔法抗性。\r\n持续15秒，冷却时间150秒',
  '生命咏叹 守护头盔':
    '攻击时15%几率召唤闪电攻击敌方造成（15X全属性）魔法伤害 85%几率造成（3X全属性）魔法伤害，降低目标25%攻击速度与移动速度，持续1.5秒，内置CD2.5秒，',
  纯净花冠:
    '宁静：当使用角色本体技能（包括物品技能) 对某单位（包括自己治疗自己）形成治疗效果（满血也可以触发） 15%几率，赋予单位宁静，提升5%技能伤害，每1s回复（目标最大生命值x2%+自身智力x0.125）的生命值和1%的魔法值 ，持续5s ，无内置CD。',
  魔魇破灭盔:
    '破坏死光：发出一道直径325码的毁灭性光波，射程900码，对路径上的地方单位造成（100X主属性）魔法伤害 眩晕1秒BOSS为0.3秒，减少200护甲（A型），持续12秒，冷却120秒。',
  '无尽虚空 破界之眼':
    '百分之25几率召唤狂暴恶魔。基础攻击力9379 ，基础攻击间隔0.8，狂暴恶魔攻击时附带0.75倍攻击力的纯粹伤害，+0.75X智力的伤害；百分之37.5几率召唤虚无行者，基础攻击4103，基础攻击间隔0.7，自带25%致命一击几率，攻击附带0.5倍智力的伤害；百分之37.5几率召唤凶暴野兽，基础攻击4891，基础攻击间隔0.6，自带25%致命一击几率，攻击附带0.5倍智力的伤害。以上智力加成部分都是魔法伤害，所招召唤物0.25S判定一次，百分之40几率提高150攻击力和12点护甲恢复智力*1血量无视减治疗。每0.5S判定一次，若此时没触发攻击力提升，则对附近能256码范围敌人造成5倍智力的魔法伤害，冷却时间100秒。',
  无轩之湮魄头巾:
    '力量爆炸：恢复40%生命值，对自身800码范围内敌军造成1秒眩晕，友军英雄恢复（1X智力+15%最大生命值）的生命值，隐身并增加25%移动速度，持续3秒，冷却时间30秒',
  炙炎梵天之冠:
    '圣焱：消耗40%当前生命值，增加1.25%X消耗生命的全属性，主属性增加效果加倍，火焰伤害增加 5％，持续15秒，冷却时间30秒。',
  戾啸魔龙面具:
    '戾啸魔龙：15秒内，增加600主属性，0.2倍率，2000点每秒回血，持续时间内每次施法增加10%主动基础，上限100%，冷却时间：50秒。',
  '魔海诱惑 恶魔之角':
    '恶魔火焰：每移动300码充能10%， 当充能满时 下次攻击会造成20 X主属性纯粹伤害。冷却时间：10秒。',
  '荒古遗尘 众神之角':
    '闪电之触：每移动300码充能10% 当充能满时，下次攻击会造成40X主属性纯粹伤害。冷却时间：5秒。',
  送葬者之弩:
    '死亡嗜血：触发该效果时1/3的几率对317范围内的敌方单位造成（22.5X主属性）的魔法伤害;1/3的几率对375范围的敌方单位造成（12.5X主属性）的魔法伤害，降低66%的移动速度和攻击速度，持续3秒，并眩晕非BOSS单位0.75秒;1/3的几率，回复自身（3000）生命值和最大魔法值15%的魔法值',
  送葬者之刃:
    '死亡嗜血：触发该效果时1/3的几率对317范围内的敌方单位造成（22.5X主属性）的魔法伤害;1/3的几率对375范围的敌方单位造成（12.5X主属性）的魔法伤害，降低66%的移动速度和攻击速度，持续3秒，并眩晕非BOSS单位0.75秒;1/3的几率，回复自身（3000）生命值和最大魔法值15%的魔法值',
  腐蚀触角法杖: '击杀单位时恢复500生命值与魔力值',
  上古魔龙之杖: '对前方1000X250矩形范围内的敌人造成智力X40的魔法伤害,冷却时间60秒',
  南瓜权杖:
    '对目标造成（7500+30X智力）的魔法伤害，眩晕2秒（BOSS为0.6秒），回复（10000）的生命值，冷却时间75秒',
  上古魔龙之弓: '魔龙打击：7500+主属性X7.5 额外伤害',
  腐蚀寄虫壳剑:
    '普攻30%几率，对300码范围内敌方单位造成溅射伤害；普攻15%几率，对目标造成（600）点纯粹伤害，并回复600点生命值',
  '莱恩哈特 魔龙之剑': '魔龙打击：7500 +主属性 X 7.5额外伤害',
  柏丽娜龙炮: '巨龙吐息：7500+主属性X7.5的额外伤害',
  '真 柏丽娜龙炮': '巨龙吐息：15000+主属性X10额外伤害',
  '真 上古魔龙之杖': '对前方1000X350矩形范围内的敌人造成智力X100的魔法伤害，冷却时间60秒',
  大地权杖:
    '大地之怒：造成智力X45的伤害 降低自身800范围内的敌方单位125%的移动速度以及攻击速度 持续15秒 冷却时间90秒',
  '真 上古魔龙之弓': '魔龙打击：15000 + 主属性 X 10 额外伤害',
  '风暴之力 凛风长弓':
    '风神祝福：自身550范围内的友军单位，回复（最大生命值20%）的血量，回复（最大魔法值25%）的魔法值，增加50%的攻击速度与100%的移动速度，持续20秒，冷却时间50秒',
  '真 莱恩哈特 魔龙之剑': '爆破打击：15000 +主属性 X 10额外伤害',
  炽焱长剑: '魔焰爆破：普攻时10%的几率，造成（12000+3.5X力量）的魔法伤害，没有内置CD',
  雷霆之怒: '雷霆打击：普攻时10%的几率，造成（12000+3.5X敏捷）的魔法伤害，没有内置CD',
  莱图斯钢炮: '强化：下次攻击附带50*敏捷的魔法伤害，附带眩晕1s，内置CD8s',
  驭龙枪: '龙之舞：对前方375*1350范围内造成125X敏捷+目标生命值X4%的伤害，冷却60s',
  血腥祈祷: '血腥祈祷：对375范围内敌军造成25*敏捷伤害，友军回复2.5*智力生命，冷却12s',
  圣者遗物: '每次施法后4秒内375码范围内的友军单位增加6%的技能伤害，提升150生命回复速度',
  复仇者:
    '复仇：在6秒内吸收第一次超过最大生命值10%的伤害，并将该伤害按魔法伤害反馈给攻击者并在吸收后的15秒内，增加（10%+15%x(所受伤害/自身生命上限））的敏捷与25%的攻击速度，如果所受伤害超过自身生命上限，则按自身生命上限计算，最大增加1000点敏捷，冷却时间120秒',
  金顶佛光杵:
    '混沌光晕：生成一个能抵挡（最大生命值x50%）的防护盾，持续6秒，持续时间内生命恢复+2500，冷却时间30秒',
  '战神 神圣加农炮': '神圣炮弹;普攻时10%几率，对目标造成（7.5X敏捷）魔法伤害',
  '真 战神 神圣加农炮': '爆破打击：普攻时10%几率，对目标造成（7.5X敏捷）魔法伤害',
  无名之剑:
    '恩赐解脱：攻击时8%几率触发，对250范围内地方单位造成（17X主属性+5X攻击力）的魔法伤害， 眩晕0.25秒 ，每次触发失败会增加下一次触发几率0.2% ，每累计10次触发几率会出现攻击数+连击的字样,此攻击力为计算护甲之后的伤害',
  潜行者:
    '深渊爆破:普攻8%的几率对目标单位造成（15X敏捷）的魔法伤害,对目标250范围内的地方单位造成（10X敏捷）的魔法伤害,没有内置CD',
  '赤红 南瓜权杖':
    '对目标350范围内敌方单位造成（12500+50X智力）的魔法伤害，眩晕4秒（BOSS为1.2秒） 回复（15000）的生命值，冷却时间75秒',
  憎恨:
    '智力提升上限为600，持续8秒，叠加可以刷新持续时间，储存智力值≥300时可以释放，设R=0.5+（储存的智力值-300）/600，即0.5≤R≤1，对于（450Xr）范围内的单位造成（rx90x智力）的魔法伤害，眩晕（Rx4秒）（BOSS为Rx1.2秒） 释放完成后重置智力值，冷却75秒',
  '克雷提亚 圣光权杖':
    '圣光爆破：对自身750范围内敌方单位造成（75X智力）的魔法伤害，眩晕2.5秒（BOSS为0.75秒），冷却时间75秒',
  '真 克雷提亚 圣光权杖':
    '圣光爆破：对自身750范围内敌方单位造成（75X智力）的魔法伤害，眩晕2.5秒（BOSS为0.75秒），冷却时间75秒',
  雪纹:
    '碎冰飞溅：释放一个直径275的冰球，对于前方直线路径上的敌方单位造成（52.5X智力）的魔法伤害，飞行900码之后炸裂，冰冻炸裂点425范围内的地方单位5秒（BOSS为1.2秒），冷却时间75秒',
  宿主权杖:
    '寄生：1.对敌方单位释放，减少该单位10%的被治疗量，每0.5秒造成（5X智力）的魔法伤害 2.对友方单位释放，增加该单位40%的魔法抗性，每0.5秒恢复0.25X智力的生命值，对325范围内的敌方单位造成（50X智力）的魔法伤害，BOSS为0.15秒，持续5秒，冷却25秒',
  '霜寒 冰霜圣弓':
    '冰霜打击：普攻时13%的几率，对目标造成（12X敏捷）的魔法伤害降低20%的移动速度，持续3秒',
  冰雹圣器:
    '冰雹打击：普攻附带（随机0.75~1.25X敏捷）的魔法伤害 普攻是1/12的几率 对目标造成5次（随机4~6X敏捷）的魔法伤害，内置CD6秒',
  '阿拉卡特 不洁之弓': '黑暗打击:普攻时10%的几率，对目标造成（12X敏捷）的魔法伤害',
  '真 阿拉卡特 不洁之弓': '黑暗打击:普攻时10%的几率，对目标造成（12X敏捷）的魔法伤害',
  '死亡呼吸 剧毒之影':
    '死亡嗜血：释放技能后下次攻击附带每秒（0.5X敏捷）的魔法伤害，持续8秒，伤害可以叠加，最高10层，并且刷新持续时间。死亡嗜血叠加4层毒素以上（不包括4层）可以使用，造成（8.5X叠毒层数X敏捷的）魔法伤害，冷却时间100秒',
  浴血之刃:
    '吸血效果：触发该效果时，回复自身（2500+0.6X主属性）的血量 50%几率对317范围内的地方单位造成（27.5X主属性）的魔法伤害； 50%的几率对375范围的敌方单位造成（15X主属性）的魔法伤害，降低66%的移动速度和攻击速度，持续3秒，并眩晕非BOSS单位0.75秒。',
  死雾魔斧: '力量提升：提升12000攻击，1000力量 ，持续8秒，冷却25秒。',
  断魂血刃:
    '嗜血打击：对450范围内的地方单位造成伤害和眩晕，伤害：0.075X目标最大生命值+25X力量+50X智力，眩晕：1.5秒（BOSS为0.45秒），提升15000攻击，800力量，800智力， 4000魔法值；持续15秒，冷却75秒。',
  爆破之刃: '爆破：普攻10%几率触发，造成（16000+12X力量的）魔法伤害 没有内置CD',
  赤焰龙魂血刃:
    '高能打击：普攻时10%几率触发，造成（攻击力+6X力量）魔法伤害增加1250攻击力 可以叠加，最高8层，并且刷新持续时间，持续8秒，无内置CD',
  风暴殇神混天舞:
    '闪电打击：普攻时1/9几率造成（20000+10X敏捷）魔法伤害\r\n觉醒：释放技能1/9几率触发觉醒，增加50%攻击速度移动速度，增加25%模型大小，觉醒持续时间内，普攻1/3触发强力闪电打击\r\n造成（30000+15X敏捷）魔法伤害，持续6秒，无内置CD',
  死亡之刃:
    '吸血效果：触发该效果时回复自身（2500+0.6X主属性）的血量， 50%几率对317范围内的地方单位造成（27.5X主属性）的魔法伤害； 50%的几率对375范围的敌方单位造成（15X主属性）的魔法伤害，降低66%的移动速度和攻击速度，持续3秒，并眩晕非BOSS单位0.75秒；',
  '冬之泪 冰怨战矛':
    '冰霜打击：普攻时13%的几率造成（12X力量）魔法伤害并对目标施加20%的移动速度降低；持续3秒；无内置CD。',
  永恒守护之剑:
    '大地裂伤：对直线上的敌人造成自身最大MP×200%的通用伤害，并眩晕1秒直线上的友军恢复最大HP25%冷却时间：15秒',
  腐蚀者:
    '毒性伤害：普攻15%几率，对前方相差30°角放射5道毒气，每道间隔0.125秒，每一道毒气造成(15X力量）魔法伤害，同一个单位最多收到2次伤害，减少175护甲，持续6秒，内置CD4.25秒',
  '生命咏叹 自然之力':
    '自然伤害：（7.5X全属性）的魔法伤害， 减少目标单位20%的移动速度，减速持续3秒',
  '卡拉菲米亚 神圣之剑': '爆破打击:普攻时10%几率，对目标造成（12X力量）魔法伤害',
  '真 卡拉菲米亚 神圣之剑': '爆破打击：普攻时10%几率，对目标造成（12X力量）魔法伤害',
  '埃克斯米亚 不洁之刃': '爆破打击：普攻时10%几率，对目标造成（12X敏捷）魔法伤害',
  '真 埃克斯米亚 不洁之刃': '邪恶打击：普攻时10%几率，对目标造成（12X敏捷）魔法伤害',
  炮灰的信条: '强化：下次攻击附带50*敏捷+绿字攻击力*1的魔法伤害，附带眩晕1s，内置CD8s',
  '爆裂花雨 碧水青龙炮':
    '爆水轰：向目标方向喷射出长达1000码的水柱，水柱中心275码范围内每秒造成25*智力魔法伤害（水柱会被单位抵挡，持续7s，冷却CD30s',
  '冥虹镜芒 破碎之命运': '破碎轰炸：对前方400x1350范围内造成175x敏捷+目标生命值x6%的伤害， 冷却75s',
  '真龙炙舞 毁天叹息':
    '毁灭叹息：最大施法距离1000，对400码范围内单位每0.25s造成0.25x75*最高属性+0.25x0.025x单位最大生命值，共8次，总计150x最高属性+0.05x最大生命 并附带5s眩晕，冷却CD45s',
  '火舞之怒 焰纹封魔炮':
    '炽热愤怒：20%几率触发，2.5秒内激活5次火焰攻击，每次最附近半径325内的敌人造成敏捷X20的伤害，每次造成伤害恢复5%生命值，冷却时间：10秒',
  追逐者:
    '追逐：每次攻击身边会出现一把锁定目标的追逐之剑，最多6把，6次攻击或4秒后结束，结束后，每把对锁定目标造成17.5x敏捷的魔法伤害，冷却CD 20s',
  魑魅神杖: '每次施法后6秒内375码范围内的友军单位提高7.5%的技能伤害，提升200生命回复速度',
  '深渊之手 最后的耳语':
    '审判伤害：攻击时1%几率触发 对半径450范围内地方单位，造成（42X（力量+敏捷）+7X攻击力）的魔法伤害，眩晕0.25秒，BOSS为0.075秒，每次触发失败会增加下一次触发几率0.125%，即8次攻击几率提高1%后触发几率重置每累计10次触发几率会出现攻击数+连击的字样',
  '地狱熔岩 幻舞者': '幻舞射击：攻击时15%对目标造成15*（力量+敏捷）的魔法伤害',
  '灾变 诸界毁灭者':
    '血腥祈祷：对范围内照成25*敏捷伤害，友军回复2.5*智力生命，你的治疗能给友军添加buff，buff提升治疗量和技能伤害5% 持续4s 冷却12s',
  '毁灭 末日回响':
    '毁灭末日强化：下次攻击附带50*敏捷+4*绿字攻击力的魔法伤害，每5s伤害增加50%最多100%，附带眩晕1s',
  '灾变 蛮荒之预言':
    '殷红洗礼：对前方400*1000范围发出数道血迹，每道对敌方造成20*敏捷伤害，对友军回复1.5*智力血量，每个单位最多受到3道，你的治疗能给友军添加buff，buff提升治疗量和技能伤害7.5% 持续6s，CD12s',
  精灵大地之刃:
    '自然打击：80%几率造成（7.5X全属性）魔法伤害， 20%几率造成（15X全属性）魔法伤害，减少目标单位20%的移动速度，减速持续3秒',
  幽魂潜行者: '噬魂打击：普攻时10%几率，造成（50X主属性）魔法伤害，无内置CD',
  '幽魂破尽 金顶佛光圣物':
    '混沌光晕：生成一个能抵挡（最大生命值x50%）的防护盾，持续6秒，持续时间内生命恢复+5000，冷却时间30秒',
  绝望的深渊:
    '制造瘟疫:每0.5秒对375范围敌方单位造成（智力X125）魔法伤害，降低20%攻击速度40%移动速度，减速持续1秒，重复触发刷新持续时间，冷却时间75秒',
  特比略遗落之辉闪:
    '电属性强化：普攻时10%几率造成（（10+4X辉闪数量）X主属性）魔法伤害\r\n辉闪：每次使用技能，会增加一个辉闪计数，为自身添加辉闪之力。下一次普攻30%的几率造成（2.5X（15000+2.5X主属性））的纯粹伤害，70%几率造成（15000+2.5X主属性）的纯粹伤害，并回复（0.03X该次伤害）的血量，辉闪之力存在10秒，重复触发刷新持续时间 计数最多6次\r\n辉闪结界：将每个遗落之辉闪割裂成两半，分别具象为辉闪球 每个辉闪球对目标造成（12.5X主属性）魔法伤害 眩晕0.125秒 冷却时间80秒 作用目标死亡后，主动消失',
  炼狱赤焰爆破之刃:
    '火焰打击：使用技能提升25%攻击速度与100%移动速度，增加500力量，持续7.5秒，持续时间内普攻20%增加2500攻击力，最高叠加5层，并对目标造成（（1+0.2X层数）X攻击力+10X力量）魔法伤害 ，持续时间结束移除增益效果， 内置CD12.5秒。',
  冬日霜心:
    '霜寒爆破：对目标225范围内地方单位造次（〜142％X（3.5X力量+2.75X敏捷））的通用伤害\r\n冰霜之力：范围直线900码施加魔法值X 450％的纯粹伤害，如果有魔法盾，则摧毁它，否则，给予1秒冰冻。给予等于30％X生命值P的友方冰霜护盾，冷却时间：30秒\r\n冰霜护盾：每次施法后，增加1%减伤，最多8层，叠加刷新持续时间，持续5秒',
  '熔岩血海 妖龙叹息':
    '破碎打击：普攻时12.5%几率触发，目标每秒受到（5X敏捷）魔法伤害，削弱20点护甲，第5秒停止叠加减甲，最终削减100点护甲，伤害以及减甲效果持续10秒，续时间内无法重复触发，无内置CD',
  高洁七星龙渊剑:
    '恩赐解脱：攻击时8%几率触发，对250范围内地方单位，造成（36X主属性+8X攻击力）的魔法伤害，眩晕0.25秒，每次触发失败会增加下一次触发几率0.2%，每累计10次触发几率会出现攻击数+连击的字样，此攻击力为计算护甲之后的伤害\r\n龙渊山崩：1.25内地裂持续扩散，完毕后炸裂技能释放点475范围内地方单位，在2.5秒内持续造成12次总和为（130X主属性）魔法伤害，每次伤害眩晕0.25秒，冷却时间75',
  '真 无名之剑':
    '恩赐解脱：攻击时8%几率触发，对250范围内地方单位，造成（23X主属性+6.5X攻击力）的魔法伤害， 眩晕0.25秒， 每次触发失败会增加下一次触发几率0.2%， 每累计10次触发几率会出现攻击数+连击的字样，此攻击力为计算护甲之后的伤害',
  '荣耀 鲜血残戟':
    '荣耀战歌：增加125力量与2.5%技能伤害，可以叠加，刷新持续时间最高4层，持续5秒，持续时间内，普攻60%几率造成（叠加层数X力量）魔法伤害，持续时间结束后移除所有增益并进入5秒CD',
  '噩耗 魑魅神杖': '每次施法后8秒内375码范围内的友军单位 提高10%的技能伤害，提升250生命回复速度 ',
  '追忆 呼啸长风': '风之打击：攻击附带攻击伤害X0.15纯粹伤害的1根箭矢，箭矢可以暴击，继承攻击特效',
  '冬之泪 冰霜怨弓': '效果:普攻15%几率造成（随机7.5~10X敏捷）魔法伤害',
  王道无极寒冰弓:
    '冰霜风暴:普攻附带（随机1.5~2X敏捷）魔法伤害,普攻8%几率释放冰霜风暴，对直线前方900码内地方单位造成（随机40~60X敏捷）魔法伤害,内置CD9秒',
  '不朽 潜行者':
    '深渊之力:对目标造成（97.5X敏捷）的魔法伤害 对目标300范围敌方单位造成（81.25X敏捷）魔法伤害,回复最大生命值15%生命。',
  '生命咏叹 守望之锤':
    '力量提升：增加425力量，每次普攻附加（1.5X力量）魔法伤害，持续6秒，内置cd10秒',
  血色憎恨:
    '仇恨之眼：每0.125秒召唤火球对目标造成（10X智力）魔法伤害，眩晕1秒BOSS为0.3秒，持续2秒，总计160倍智力伤害，眩晕3秒，BOSS为2.3秒 冷却时间75秒',
  统治权杖:
    '自身范围每多一个自己的召唤物，提升100智力，最多提升1200。\r\n统治释放：召唤一个火焰弓箭手，15重射，攻击间隔0.5，生命回复速度4000，每次攻击附带(3X智力）魔法伤害，持续时间60秒 ，冷却时间60秒',
  '信仰 亚特兰蒂斯的毁灭圣杖':
    '混沌爆破：对自身750范围内敌方单位造成（125X智力）的魔法伤害，眩晕2.5秒（BOSS为0.75秒），冷却时间75秒',
  '亡灵挽歌 虚灵权杖':
    '暗黑领域：每0.625秒对400范围的敌方单位造成（12.5X智力）魔法伤害，共计8次，每次削弱敌军魔抗1.5%，最多4%，冷却75秒',
  地狱挽歌:
    '死亡之源：使用技能后，增加10000攻击力，增加375智力，提升500%移动速度，持续4秒，内置CD12秒\r\n绝望亡曲：对前方大范围扇形区域敌方单位造成（75X智力+15X攻击力）魔法伤害,魔法抗性减少6%，眩晕2.5秒，冷却80秒',
  '冬之泪 沧澜雪印':
    '释放技能后，下一次普通附带（7.5X智力）魔法伤害\r\n若单位被霜冻减速，则造成(15X智力）魔法伤害\r\n无冬之夜：\r\n冻结700范围内的敌人3s,造成每0.2s主属性*2.5的魔法伤害,冷却时间70秒',
  '神降 亚特兰蒂斯的破灭圣弓': '混沌打击:普攻时15%的几率，对目标造成（15X（敏捷+力量））的魔法伤害',
  拉克鲁斯之剑:
    '潮汐强化：释放技能后下次攻击附带每秒（1.3X敏捷）魔法伤害，持续9秒，伤害可以叠加，刷新持续时间，叠加第10次时，直接造成（130X敏捷）魔法伤害，并眩晕1秒BOSS为0.3秒\r\n幻想打击：在6秒内吸收第一次超过最大生命值10%的伤害，（如果所受伤害伤害超过最大生命值，则按最大生命值计算）并将该伤害按魔法伤害反馈给攻击者，并在吸收后的15秒内，增加（15%+15%x(所受伤害/自身生命上限））的敏捷，最大增加1250点敏捷 提升致命一击概率10%，冷却时间120秒',
  赤血魔刃:
    '血怒：每14次普攻触发对450范围敌方单位造成（40X主属性）魔法伤害，回复自身（3000+0.6X主属性）生命值\r\n觉醒：使用技能时20%几率触发 增加自身30%攻击速度移动速度，增加750敏捷，觉醒持续7.5秒，加强血怒效果，对450范围内的地方单位造成（60X主属性）的魔法伤害； 并眩晕1秒；BOSS为0.3秒 内置CD30秒，回复450范围内友方单位（2250+0.45X主属性）的血量，回复自身（4500+0.9X主属性）血量，冷却时间15秒',
  '深渊之手 绝望的煙灭':
    '审判：攻击时1%几率触发，对半径450范围内地方单位造成（42X（力量+敏捷）+7X攻击力）的魔法伤害，眩晕0.25秒BOSS为0.075秒\r\n每次触发失败会增加下一次触发几率0.125%，即8次攻击几率提高1%后，触发几率重置，每累计10次触发几率会出现攻击数+连击的字样',
  '冬之泪 冰极天雪剑': '冰魂打击：造成（1.8X力量+1.5X敏捷）纯粹伤害',
  百里流光圣影之刃:
    '电属性强化：普攻时8%几率造成（（10+4X圣影印记数量）X主属性）魔法伤害\r\n圣影印记：每次使用技能，会增加一个圣影印记计数，为自身添加圣影之力，下一次普攻30%的几率造成（2.5X（15000+2.5X主属性））的纯粹伤害，70%几率造成（15000+2.5X主属性）的纯粹伤害并回复（0.03X该次伤害）的血量，圣影之力存在10秒，重复触发刷新持续时间，计数最多6次。\r\n光之轨迹：将每个圣影印记闪割裂成两半，分别具象为圣影之刃，每把圣影之刃对目标造成（12.5X主属性）魔法伤害，眩晕0.125秒，冷却时间80秒，当作用对象死亡，这个效果消失\r\n',
  愤怒:
    '怒火打击：普攻15%几率对前方相差30°角放射5道火焰，每道间隔0.125秒，每一道毒气造成(20X力量）魔法伤害，同一个单位最多收到2次伤害，减少200护甲，持续6秒，内置CD4.25秒\r\n愤怒燃烧：1.开启时，致命一击几率增加15% 2.开启前10秒每秒提升75力量，1%技能伤害，在第十秒后停止增加 3.开启时损失生命值，为生命移除，无视任何抗性减伤，最低保留1点生命值，不致死，生命移除：第一秒为1200，之后每秒增加400,5秒后固定为4800，冷却时间60秒',
  '斩神 亚特兰蒂斯的毁灭圣剑': '混沌打击：普攻时15%几率，对目标造成（15X（力量+敏捷））魔法伤害',
  '亡灵挽歌 王者之剑':
    '仇恨打击：普攻时12%几率，对目标造成（35X（主属性）魔法伤害，无内置CD\r\n灵魂切割：造成（150X主属性）魔法伤害，降低50%目标移动速度，提高自身7.5%技能伤害，持续10秒，冷却150秒',
  '秩序之源 永恒碧蓝怒火之剑': '混沌打击：普攻时10%几率，对目标造成（37.5X（力量+敏捷））魔法伤害',
  '秩序之源 无间地狱魔杖':
    '无间爆破：对自身900范围内敌方单位造成（300X智力）的魔法伤害，眩晕3.25秒（BOSS为1/3时间），冷却时间60秒',
  '秩序之源 梦魇毁灭魔弓': '混沌魔影:普攻时10%的几率，对目标造成（37.5X（敏捷+力量））的魔法伤害',
  '绝魂 世界击碎者': '幻舞射击：攻击时10%对目标造成37.5*（力量+敏捷）的魔法伤害',
  '亵渎之影 末日裁决':
    '末日裁决：攻击时((hit count X 12.5%) + 1)几率触发，对半径450范围内地方单位 造成（65X（力量+敏捷）+10X攻击力）的魔法伤害',
  '末日 火舞之怒 焰纹封魔炮':
    '毁灭末日强化：下次攻击附带50*敏捷+4*攻击力的魔法伤害，每5s增加1充能，每层充能增加伤害50%，最多100%，附带眩晕1s',
  附魔追逐者:
    '附魔追逐：对目标方向释放一道直径为400，射程为1350的阴影追逐，对路径上单位造成200x敏捷+7.5%x最大生命的魔法伤害',
  龙蟠凤翥诉哀殇剑:
    '强化效果：普攻时12%几率，对目标造成（37.5X主属性）魔法伤害，无内置CD，450范围每多两位友军英雄，增加自身（1750X每对友军数量）攻击力，增加自身（1X每对友军数量）技能伤害',
  火炎之心:
    '火焰打击：使用技能提升100%攻击速度与100%移动速度，增加500力量 ，持续9秒， 持续时间内普攻20%增加1500攻击力.100主属性，最高叠加5层，对目标造成（（1.5+0.3*层数）X攻击力+15X力量）魔法伤害，持续时间结束移除增益效，内置CD15秒',
  恩德拉的苏醒: '强化效果：每隔12秒你的攻击使一条线上的敌人造成125X主属性的魔法伤害',
  '巨龙之怒 缚灵之手':
    '巨龙之力：施法1.5秒后，召唤火龙，召唤物无敌，免疫debuff和秒杀,人免疫秒杀，90%减伤\r\n火龙技能1：向前喷射火炎持续三秒，每秒造成主属性x75范围伤害。Cd4秒 。\r\n火龙技能2：周围半径450友军添加抵挡为30000的防护盾,生命恢复+7500，持续2s。Cd6秒。\r\n持续时间15秒，冷却时间90秒',
  '梦魇缚灵 尘封之眼':
    '熔岩凝视：普攻时15%几率触发，目标每秒受到（10X敏捷）魔法伤害，在前5秒内削弱目标2%魔抗，触发的效果可持续10秒，持续时间内无法重复触发，无内置CD',
  '地狱之光 毁灭灾星':
    '毁灭打击：每次施法增加1250攻击力，75力量和智力，1%技伤，持续5秒，最多叠加10次，重复叠加刷新持续时间。\r\n毁灭灾星：造成7.5%最大生命值+80x智力+40x力量魔法伤害，1.5秒眩晕。维持被动最大层数15秒，施法距离：750，半径：450，冷却时间：60s。',
  '雪絮 寒影圣辉':
    '攻击强化：附加智力x20魔法伤害并减速目标万境踪灭：持续影响400范围内的敌人4秒，并造成1秒的冻结，使敌军更脆弱可受到更多伤害，持续时间造成智力X100魔法伤害。持续时间内受影响的单位被攻击时，造成施法者的智力X3的纯粹伤害，内置CD0.1秒。冷却90秒',
  '吟龙霜寒 冰雪叹息':
    '治愈之水：造成目标在3秒内获得生命恢复0.15x智力的提高冰雪叹息：释放长1000码、宽275码的水柱，持续6秒。范围内地方单位受到每秒智力X15的魔法伤害。范围内友方单位受到每秒智力X1的生命恢复。冷却时间20秒。',
  '唤潮 贪婪之手':
    '潮汐范围打击：攻击时有20％的几率攻击目标周围的敌人，并恢复2500生命值\r\n贪婪汲取：使用时将300到800码附近的敌人牵引到你身边造成（4000%x攻击伤害）的伤害并昏迷2秒，冷却时间60秒\r\n',
  '远古迷梦 祝福长弓':
    '风之打击：攻击50%概率附带攻击伤害X0.15攻击强度纯粹伤害的1根箭矢，同时50%概率触发第2根。箭矢可以暴击，继承攻击特效',
  '阿特里西亚 梦幻之剑':
    '攻击强化：\r\n主属性X9的纯粹伤害\r\n最大生命值x4%的生命恢复\r\n添加BUFF（最多6个）\r\n虚幻梦境\r\n消耗所有BUFF堆积对附近敌人造成（50X主属性XBUFF数量）的魔法伤害并恐惧敌人2秒\r\n提供（0.5XBUFF数量）秒的免疫状态\r\n冷却时间：90秒',
  '邪目 绯红憎恨':
    '绯红凝视：2秒内攻击目标，每秒对目标及附近敌人造成智力X 125的魔法伤害。\r\n根据目标失去的生命值最高额外造成100%的伤害提升。',
  '辉煌 瀚宇之星':
    '友军强化：\r\n6秒内技能伤害和生命恢复提高9％。\r\n神圣洗礼：\r\n对目标区域半径400内的敌人造成智力X 40伤害，\r\n共3次\r\n冷却时间：10秒',
  瘟疫法杖:
    '瘟疫领域：目标及其附近单位感染瘟疫持续8秒\r\n如果目标是敌军，生命恢复降低10％，每秒受到智力X5点伤害\r\n如果目标是友军，则魔法防御提高40％，每秒恢复智力X1生命\r\n持续结束时目标爆炸，眩晕附近敌人并造成智力X40伤害\r\n冷却时间：20秒',
  波纹鞋:
    '击杀单位8%几率经验获取率增加12%、魔法回复速度增加15，持续30秒，重复触发刷新持续时间，无内置CD',
  象皮披风: '提升40生命恢复速度，增加20魔法恢复速度',
  深海之翼:
    '击杀单位8%几率 经验获取率增加12%、魔法回复速度增加15，持续30秒，重复触发刷新持续时间，无内置CD。',
  火焰披风: '灼伤效果：每秒对自身200码范围内单位造成2400魔法伤害',
  蝙蝠之翼:
    '吸血打击：每移动400码下一次攻击附加0.5倍攻击力的纯粹伤害，且回复8%最大生命值 ，储存上限2次，内置充能冷却时间0.125秒。',
  伯爵的披风: '暗属性效果：下一次普攻造成2.5X主属性纯粹伤害，回复最大生命值2.5%生命值。',
  腐败水晶之翼: '提升生命恢复速度150，魔法恢复速度60。\r\n',
  '嗜血 蝙蝠之翼':
    '饥渴嗜血：下一次攻击附加0.7倍攻击力的纯粹伤害，且回复8%最大生命值，储存上限2次，攻击触发被动回血堆叠层数，每层获得200生命恢复，最多累计5层，持续2.5秒，内置充能冷却时间0.125秒。',
  飞星流彩碎翼:
    '苍穹之力：使用技能后获得苍穹之力加成，提升250全属性普攻附带1X主属性的纯粹伤害，苍穹之力持续4秒 ，内置CD16秒。\r\n群星流彩：引动群星坠向目标区域施法距离1200，对350码范围内敌方单位造成15X主属性魔法伤害，眩晕2秒，群星坠地1.5秒之后对1000码范围地方单位造成115X主属性魔法伤害，削减250护甲持续10秒，冷却时间150秒。',
  暗黑不朽魂翼:
    '吸收灵魂：每5秒恢复生命值和魔法值值13.5％。\r\n释放灵魂：550范围内的友方单位回复（40%X最大生命值）血量 ，根据智力属性对敌军造成魔法伤害， 冷却时间30秒。',
  '星辰闪耀 圣堂之翼':
    '提升生命回复速度225，魔法恢复速度100。\r\n1/20几率刷新技能(除了终极技能)触发后2秒刷新，内置CD150秒。',
  怒焱魂翼:
    '魂怒：增加60敏捷，可叠加上限600，持续7秒。释放技能后下一次普攻87.5%几率造成（敏捷+2.5X最高属性值）纯粹伤害 ，回复最大生命值7.5%血量；12.5%几率造成（敏捷X2+5X最高属性值）纯粹伤害，回复3%生命值。无内置CD。',
  堕落的火焰魂翼:
    '魔焰缠身：削弱自身生命恢复速度175，对目标造成指向性技能伤害时每0.5秒将触发该次伤害，2.5%以纯粹伤害的形式灼伤目标，持续3秒共6次，可以叠加，多次触发。',
  '狂暴 堕落统治魂翼':
    '统治魂翼：削弱自身生命恢复速度250，对目标造成指向性技能伤害时，减少该单位4%魔法抗性，每0.5秒将触发该次伤害3.3%以纯粹伤害的形式灼伤目标，持续3秒共6次，可以叠加多次触发。',
  冰极天雪魂翼: '减少600范围地方单位15%攻击速度和移动速度',
  幻想霜寒魂翼:
    '减少750范围内敌方单位20%移动速度攻击速度。\r\n幻想哀嚎：眩晕600范围地方单位1秒，回复自身33%最大生命值血量，敌方的攻击力降低20%，持续8秒，冷却时间40秒。',
  耀目星芒魂翼:
    '生命恢复速度提高275.\r\n主动使用:自己、自己的召唤单位与友军召唤单位，增加6000最大生命值，5%技能伤害，友军英雄增加3000最大生命值，持续45秒，冷却60秒。',
  亡者灵魂:
    '复活死者:死亡后对于600范围敌方单位造成（275X主属性）魔法伤害。2秒后复活,30秒内无法重复触发，内置CD182秒',
  魔音护魂之翼:
    '疯狂杀戮：释放技能后下一次普攻，82.5%几率造成（1.5X 敏捷+2.5X 最高属性值）纯粹伤害，回复最大生命值3%的血量；17.5%几率造成（3X 敏捷+5X 最高属性值）纯粹伤害，回复最大生命值7.5%的血量并增加90敏捷，可叠加上限900(10层，)持续8秒，被动达到10层时增加9%技能伤害，无内置CD。',
  信仰斗篷:
    '永恒信仰：普攻时12.5%几率触发，回复自身最大生命值40%血量，增加50%攻击速度和移动速度，每秒增加100点主属性，第11秒后移除，最多增加1000点主属性，内置CD30秒。',
  地狱熔岩火凰羽翼:
    '熔火：飞向目标区域对周围敌军给予重创，造成攻击力x5+主属性x75的魔法伤害并眩晕0.5秒，最大移动距离900，移动速度3000，攻击半径300，施法延迟0.5秒，冷却时间45秒。',
  '祈明 神谕血翼':
    '血腥之咬：附加攻击力x75%纯粹伤害，最大生命值x8%的生命恢复。\r\n2.5秒内攻击力提升1500，移动速度提升15，生命恢复速度提高250（最多可叠加5层）',
  '遂宇玄芒 灵仙魂翼': '复活:\r\n生命值/魔法值复活后恢复到100％状态.\r\n冷却时间：300秒.',
  '净空 至上祝福羽翼':
    '大天使的祝福：\r\n2秒内重置终极技能以外的所有技能的冷却时间；\r\n技能伤害提高10%，所受伤害减免50%，持续10秒；\r\n触发几率：5%；\r\n冷却时间：120秒。',
  无坚不摧战翅: '重复触发将刷新持续时间',
  龙虾鳞甲:
    '反弹效果：\r\n若攻击力（英雄）大于300则造成1200纯粹伤害，若小于300则造成攻击力*4纯粹伤害',
  腐蚀龙虾鳞甲: '伤害反弹：90%反弹0.5*力量纯粹伤害，10%反弹5*力量纯粹伤害',
  守护岩甲:
    '石盾：增加5%的主属性，获得一个3X主属性的护盾，持续2秒，提高4000的生命值恢复， 4000的魔法恢复速度，冷却时间40秒。',
  血精石甲:
    '血石之盾：增加 7.5%的主属性，获得一个8000+15%最大生命值的护盾，持续2.5s。提高4000+7.5%最大生命值的生命值恢复，提高4000+7.5%最大魔法值的魔法恢复速度，CD40S，',
  法皇之衣: '魔法免疫持续时间5秒',
  佑腐鳞甲:
    '伤害反弹：每次收到物理攻击时 1/6几率反弹（5X力量）纯粹伤害，5/6几率反弹（0.6X力量）纯粹伤害 并添加状态，设攻击单位攻击力为x，当x大于2倍最大生命+20%充能，并显示+20%，若小于，则 +10*（x/最大生命值）% 并每到10%显示+10%，到达100%充能时对自身525范围内单位造成17.5*最大生命的魔法伤害 ，内置CD5S。',
  寒冰雪衣:
    '每次受到物理攻击时10%几率，获得霜寒护甲，增加400护甲，持续15秒，不可叠加，重复触发刷新持续时间，无内置CD。',
  远古自然圣甲: '生命值低于30%每秒生命恢复速度增加2500，持续10秒，内置CD55秒，CD中不可丢弃。',
  '生命咏叹 守护圣甲':
    '生命值低于30%每秒生命恢复速度增加3500，持续10秒，内置CD35秒， CD中不可丢弃。',
  '真 血精石甲':
    '血石之盾：增加7.5%的主属性，获得一个8000+15%最大生命值的护盾，持续2.5s，提高4000+7.5%最大生命值的生命值恢复，提高4000+7.5%最大魔法值的魔法恢复速度，CD40S。',
  童话长袍: '精灵龙攻击boss获得智力X1的额外伤害',
  '生命咏叹 梦境童话': '精灵龙攻击boss 获得智力X1.5的额外伤害',
  神圣盔甲:
    '绝对守护：每当受到物理攻击时10%概率，增加自身1000护甲值，持续4秒，持续时间结束进入CD，内置CD12秒',
  '德里克斯 堕落魔甲': '被攻击时10%几率削弱攻击者125护甲，持续5秒，无内置CD',
  魔渊焱甲:
    '魔焰飞溅：当生命值低于35%触发，增加5%力量，持续10秒，不可叠加，回复自身最大生命值14%血量，对周围400范围内地方单位造成（25X力量）魔法伤害，降低75%攻击速度移动速度，持续1.5秒，内置CD8秒。',
  圣佑龙魂战甲: '龙之魂：受到攻击10%概率触发，吸收这次伤害，内置CD4秒。',
  嗜血之铠:
    '嗜血斗气：每过6秒对自身275范围内地方单位造成（7.5 X攻击伤害）魔法伤害， 增加20000攻击伤害，持续1.5秒。',
  冰魂雪衣: '远古冰魂：吸收（0.75X最大魔法值+6X智力）伤害 ，持续8秒，冷却时间75秒。',
  寒冬之拥:
    '冰霜幽灵:吸收（0.75x最大魔法值+5x智力）伤害,并释放极寒冰爆;\r\n每0.25秒向半径0~750码周边随机释放冰片，对爆炸点350码范围内地方单位造成（10x智力）魔法伤害,并冰冻非BOSS单位1秒,减速boss.持续8秒,冷却时间45秒.\r\n',
  死灵法袍:
    '魔力屏障：自身获得魔法免疫，自身225范围内友方单位增加40%魔法抗性 持续6秒，冷却时间120秒。',
  创世圣铠:
    '创世印记：每秒回复自身（3500+15%最大生命值）血量，持续4秒，持续期身边600码内自身与友方单位魔法抗性提高到100%，冷却时间90秒。',
  戴安娜的神圣法衣:
    '戴安娜护佑：范围750，释放时自身无法移动，为自身添加一个（15000+5X智力）的护盾，每0.6秒释放神圣极光，回复1000范围内友方单位（1.5X智力）生命值， 对1000范围内地方单位造成（25X智力）魔法伤害，第七次引爆护佑之力，对1000范围内敌方单位造成50X智力魔法伤害，冷却90秒。',
  圣焱战神之甲: '提升自身700范围内除自身之外友军单位5%的全属性',
  安魂甲胄:
    '提升700范围内友军单位5%全属性。\r\n每8秒随机获得 1.技能伤害10%提升 2.伤害减免16%提升 3.每秒回复（0.2X主属性）血量。',
  '克罗洛斯 血羽之甲':
    '对600范围内敌方单位造成（30X所存生命上限）魔法伤害，眩晕2.5秒BOSS为0.75秒，增加12%敏捷，持续12秒，冷却150秒。',
  亡者魂衣:
    '当生命值低于15%触发，回复最大生命值25%的血量，增加90%减伤，提升100%移动速度， 持续3秒， 内置CD60秒。',
  本尼迪特嗜血之铠:
    '当造成伤害的时候，将1%伤害量转换为自身生命上限，最多增加2x敏捷的生命上限，不再造成伤害之后8秒移除，效果结束后额外增加的生命上限的50%给予生命值恢复。\r\n强制敌人禁锢：对750范围内敌方单位造成（25X所存生命上限）纯粹伤害，眩晕5秒BOSS为1.5秒，在持续12秒时间内伤害获得所存生命上限x30以及技能伤害5%的提高，冷却120秒。\r\n',
  霜寒碎片守护圣甲:
    '霜寒守护：当生命值低于40%触发 ，增加12.5%力量，伤害减免增加12%，持续12秒，不可叠加。 回复自身最大生命值17.5%血量，对周围400范围内地方单位造成（60X力量）魔法伤害，降低75%攻击速度移动速度，持续2秒，内置CD8秒。',
  '亡灵挽歌 灾祸法袍':
    '死亡契约：消耗自身最大生命值40%，不足40%生命值减为1，提升850智力，持续11秒，冷却时间120秒。',
  女巫美狄亚法衣:
    '控制女巫：使用技能有100%的几率得到1个女巫，50%的几率到2个女巫，内置冷却时间0.5秒，每个女巫的存在，提升智力100和技能伤害1%，最多4个女巫。\r\n增加智力500和6%技能伤害。释放技能时持续生成女巫。释放技能使每个女巫向1000码范围内攻击。每个女巫对300码范围内敌人造成25*智力魔法伤害，内置CD1s 持续6s 冷却时间90秒。',
  湮灭幽魂甲胄:
    '幽魂守护：受到的攻击会使生命值低于15%时触发，减免受到攻击伤害的90%，提升100移动速度，回复最大生命值35%的血量，之后每秒回复6%的血量，持续3s，内置CD60秒。',
  地渊沉星荆棘之甲:
    '荆棘之刺：被动1，被攻击时对周围造成本身100%最大生命值的纯粹伤害，内置CD3秒。主动1，每次受到自身最大生命值62.5%的伤害就充能50%，累计100%（最大生命值125%）时可以主动释放，造成范围40x最大生命值（4000%最大生命值）魔法伤害，眩晕2.5秒。内置CD5秒，主动2 消耗最大生命值的20%，对周围造成最大生命值100%的纯粹伤害，冷却时间3秒。',
  '冥谕 铸血甲胄':
    '铸血：5秒内吸收（10,000 +最大生命值×20％）伤害。 护盾结束时，对周围敌人造成125倍主属性魔法伤害，持续时间内护盾被消耗能重复补充，冷却时间20秒。',
  '辟晦 淬光之铠':
    '淬光电击：每秒对附近敌人造成（力量+敏捷）x20的持续魔法伤害，每秒恢复最大生命值的2.5%，持续3秒，冷却时间6秒。\r\n',
  '虚空 破风之铠': '风怒：每次攻击时额外攻击一次（最多2次）。\r\n显着的提高移动速度。\r\n',
  '先驱 风暴战铠': '风怒：每次攻击时额外攻击一次（最多3次）。显着的提高移动速度。',
  德鲁伊长袍:
    '自然精灵：每个自然精灵每秒恢复最大生命值0.75%，最多可召唤4个。\r\n主送释放：若目标是敌军，造成智力x40魔法伤害；若目标是友军，造成智力x2.生命值恢复，无法对自身使用；可触发指向技能效果。',
  '怨灵祈祷 绝望甲胄':
    '怨灵祷告：每6秒对附近的敌人造成20X全属性的魔法伤害。 在6秒内将其伤害抗性降低4％，并使你的下一次攻击获得6％最大生命值的自我治疗。',
  深海宝石:
    '潮汐冲击：对英雄面向角度释放潮汐冲击，友军生命恢复3000，并增加移动速度50%，持续10s，敌军则造成4000+25*主属性的魔法伤害。',
  肉袋: '体能恢复：恢复2000生命值，提升攻击&移动速度15%，持续10s，冷却CD20s。',
  伯爵的鲜血之戒:
    '点击使用回复自身450范围的友方单位 (4000+施法者最大生命值25%）的血量 ，冷却时间60秒。',
  炽焰之癸:
    '愤怒燃烧：释放技能时1/8几率触发，对350范围内单位造成（40X主属性）魔法伤害，眩晕1秒，BOSS0.3秒，无内置CD。',
  死亡之戒:
    '使用者周围的敌军的生命恢复速度减少40% ，降低自身生命回复速度和被治疗量的40% ，周期性吸收生命值。',
  腐败的水晶碎片: '生命回复速度提升100，魔法回复速度提升40',
  魔法之心: '魔法恢复速度提升50',
  守护圣戒: '生命恢复速度提升80',
  '魔法之心 卓越': '魔法恢复速度提升75',
  共振指环: '共振：主动使用重置最后使用的技能的冷却时间，不能刷新终极技能，冷却时间120秒。',
  腐蚀暗黑号角:
    '触手：自身800范围造成7000魔法伤害，降低30%移动速度，持续1.5秒，1.5秒之后对自身400范围内地方单位造成（37.5X主属性）魔法伤害，每伤害一个单位回复自身（最大生命值12.5%）的血量，冷却时间150秒。',
  '魔法之心 霜寒': '魔法恢复速度提升100',
  冬日的玫瑰: '普攻时10%几率提升250智力，持续6秒，无内置CD。\r\n',
  极冰之牙:
    '每次普攻附带（0.1X该次普攻伤害+400）纯粹伤害。\r\n普攻时8%几率减少目标175护甲，持续5秒，无内置CD。',
  '真 守护圣戒': '生命恢复速度提升140',
  贤者之戒:
    '贤者之力：重置最后是使用的技能的冷却时间 不能刷新终极技能，魔法恢复速度提升1000，持续8秒，冷却时间120秒。',
  圣光之戒: '800范围内友军单位提升护甲200',
  生命石: '内置CD181秒',
  骷髅印章:
    '最多提升最大生命值15％和7500之间的较低值的生命值上限，持续6秒，重复触发刷新持续时间，无内置CD。',
  未完成的狂暴药剂:
    '改变角色外形:模型缩小50%,增加60%魔法抗性,增加250全属性,每秒回复1%生命值,持续12秒,冷却时间120秒,结束后模型恢复原貌。',
  灵魂酒箱:
    '生命值恢复速度提升+200。主动吸收：使用时将对敌人魔法伤害量的2.5%转化为自身治疗效果，持续6秒，冷却时间15秒。',
  弱水精华: '回复最大魔法值20%的魔量 ，冷却时间45秒。',
  风暴之戒:
    '风暴领域：每0.25秒对自身325范围内的地方单位造成（12.5X主属性）的魔法伤害，眩晕1秒，BOSS为0.3秒，持续2秒，冷却时间120秒。',
  噩梦指环:
    '噩梦打击：普攻时5%概率触发，增加15000攻击力，增加900全属性，增加1000点生命恢复速度，持续6秒，内置CD9秒。',
  沉眠龙徽暗影之指:
    '潜能：血量不为100%可开启，开启后每秒提升生命恢复速度300，5%魔法抗性，最高叠加到第5层 ，总计提升1500点生命恢复速度，25%魔法抗性 血量回复到100%移除效果，重复开启不可叠加，冷却时间120秒。',
  '荣光 圣芒之戒':
    '神圣之光：675范围内友军单位提升护甲200，675范围内友军单位提升最大生命值3000，每次使用技能储存1层神圣能量最多5层，持续时间8秒，使用释放神圣之光，周围半径600友军恢复（力量+敏捷+智力）x0.2x充能数的生命值，冷却10秒。',
  '禁忌 魔幻之戒':
    '禁忌法术：消耗最大魔法值50%，主属性提升（消耗的魔法值/90）（最多600），攻击速度提升30%，持续8秒。冷却时间30秒。',
  死神之戒:
    '为包括自身在内400范围友方单位增加回光返照效果 将所受伤害全部转化为治疗量，持续3秒，冷却150秒。',
  深渊玫瑰:
    '区域庇护：消耗自身最大生命值20%血量，不足20%时归于1，为自身范围400内的友军创造一个强度为（施法者最大生命值20%+5X智力）的护盾，持续8秒，冷却时间60秒。',
  圣之魂器: '普攻时13%几率，减少目标225护甲，持续5秒，无内置CD。',
  掠夺之戒:
    '掠夺之力：可重置最后使用的技能的冷却时间，不能刷新终极技能，魔法恢复速度提升1200 ，持续10秒，冷却时间100秒。',
  '德瑞诺斯 深渊领主的戒指': '800范围内友军护甲提升300',
  '诸神黄昏 混沌之心': '绝对守护：受到攻击时10%几率吸收该次伤害， 内置CD6秒。',
  上古魔龙之心:
    '召唤上古魔龙：对600范围内单位造成（30X智力）魔法伤害，眩晕一秒，BOSS0.3秒，上古魔龙每次攻击附带智力X 5的魔法伤害，冷却150秒。',
  '诸神黄昏 深渊领主的龙笛':
    '750范围内友军单位，移动速度提升20%，攻击速度提升20% ，每秒回复200生命值，提升4000攻击力。',
  '誓约之戒 勇气':
    '屏障：消耗自身最大生命值10%血量，不足10%时归于1，为自身范围400内的友军创造一个强度为（施法者最大生命值6%+1.5X主属性）的屏障，持续6秒，冷却时间60秒。',
  '亡灵挽歌 月穷天坠':
    '三种BUFF：1.技能伤害10%提升2.伤害减免16%提升。3.每秒回复（0.2X主属性）血量。主动激活冷却时间90秒.',
  圣魔指环:
    '暗之审判：遁入无尽黑暗，吸收所有伤害并累计，持续3秒后爆破，将（累计伤害总和的1.666倍）以魔法伤害反馈给自身600范围内敌方单位，冷却时间75秒。',
  爆破之戒:
    '爆破打击：普攻时7.5%触发，增加20000攻击力，增加1000主属性，增加1000点生命恢复速度，并附带4次（攻击力*1）的纯粹伤害，持续7.5秒，内置CD15秒。',
  '深沉悲伤 撕裂光芒':
    '每次攻击将造成伤害的0.5%存储提高生命值与魔法值上限， 提升生命上限为力量*1.5，提升魔法上限为智力*1.5，持续5秒。\r\n黑骑契约：对500码范围内造成持续5秒的伤害，每秒造成12X存储生命+20X存储魔法的魔法伤害，结束时造成60X存储生命+100X存储魔法的魔法伤害，并沉默1.5秒/1秒眩晕。 使用时清空存储生命魔法，冷却时间120秒。',
  '巨龙之怒 流年沙漏': '刷新D/Q/W/E/R/T技能，CD30秒',
  '湮灭之光 时间指环':
    '生命处于1以下时回复40%最大生命值，冷却300秒(若未触发而直接死亡，不会进入冷却)。\r\n时空扭曲：刷新最后一个使用的技能，10秒内免疫击退/眩晕/沉默，魔法恢复速度提升1500，冷却：90秒。\r\n',
  '浮生 弑光之钟':
    '神圣之光：800范围内友军单位提升护甲300， 800范围内友军单位提升最大生命值5000，每次使用技能储存1层神圣能量最多5层，持续时间8秒，使用释放神圣之光，周围半径600友军恢复（力量+敏捷+智力）x0.3x充能数的生命值，冷却10秒。',
  '苍穹俱宁 卸尘枷锁':
    '苍穹俱宁：800码范围内敌人锁定5秒，使其造成伤害减少50%，目标被拖到你的300范围内，并且每移动100距离就会受到25X主属性的魔法魔法伤害。如果目标距离超过1500范围或免疫击退，效果则会解除。冷却时间30秒。',
  '血祭 碧空之歌':
    '攻击强化：使目标敌人的护甲值减少225点（A型），持续3秒。下1次攻击造成3次额外攻击，造成200％的伤害。仅限近战。',
  '黑暗契约 死灵法书':
    '禁忌法术：消耗最大魔法值 50%。主属性提升（消耗的魔法值/75）（最多1200），攻击速度提升50%，持续10秒，冷却时间30秒。',
  '卓尔 圣焱之戒':
    '附魔：目标伤害提高5％，主要属性提高300\r\n圣焱：主动使用获得恢复最大生命值的40％\r\n冷却时间：30秒',
  '神气流转 寒岚之戒':
    '寒岚打击：魔法抗性降低6%\r\n禁锢麻痹：对敌人造成目标最大生命值2.5%的纯粹伤害，并且冰冻2秒。冷却时间30秒。',
  '消散 阳炎澄心':
    '阳炎爆炸:\r\n在一秒钟之后爆炸并死亡，对附近的敌人造成主属性X250的魔法伤害，晕眩3秒\r\n每5秒提高伤害50％（最多5次）\r\n冷却时间：180秒',
  殇灵光羽号角:
    '友军强化：750范围内友军单位，移动速度提升25%，攻击速度提升25%，生命恢复提升400，提升智力*0.6攻击伤害（最大6000）\r\n光羽打击：每秒使目标恢复10%生命值并移除目标DEBUFF，持续时间内目标生命值不会低于1， 持续时间3秒 ，冷却时间20秒。',
  统治者指环: '绝对守护：受到攻击时10%几率吸收该次伤害，内置CD6秒。',
  '眷恋 返照圣戒':
    '苏醒：\r\n立即恢复最大生命值/魔法值的50％；\r\n主属性+1000，持续10秒；\r\n增加的属性每秒减少100点；\r\n冷却时间：45秒。\r\n复活：\r\n冷却时间：240秒。',
  '星界微光 浩瀚玫瑰':
    '星界守护：\r\n向目标区域内的友军添加护盾持续5秒，护盾值为（智力X5 +最大生命值X20％）\r\n如果护盾阻挡一次技能，它会在结束后强化目标30秒，伤害提高6％/伤害减免提高12％\r\n冷却时间：45秒',
  混沌劈天刃:
    '毁灭边际：\r\n25％几率造成力量x100的魔法伤害\r\n降低目标250护甲，并使受到魔法伤害提高2.5％，持续6秒，冷却时间：5秒（混沌激活时冷却时间：2秒）\r\n混沌：\r\n攻击速度提高100％，根据已损失生命值提升累积速度，每1~0.5秒增加200点力量，每1~0.5秒增加1.5％的技能伤害（最多累积10层）\r\n每秒生命值消耗（3000 +开启时间时间x750）\r\n可以通过ESC解除\r\n冷却时间：60秒',
  皓月醉影之剑: '混沌爆破：\r\n10％几率造成（力量+敏捷）x45魔法伤害',
  '凋零 绝望背包':
    '投掷炸弹：\r\n将炸弹安置到目标位置\r\n当敌人接近或降落时触发轰炸，造成力量x40魔法伤害，会触发400范围的连锁爆炸。连锁爆炸时增加0.5秒的眩晕效果，每多一轮轰炸增加100％的伤害（最多400%）。无任何触发时30后炸弹会自动爆炸。最多可同时安放10个炸弹\r\n冷却时间：2秒',
  凯彼阿的万千世界:
    '荣耀战歌：每层效果提升力量250，技能伤害2.5%，持续5秒\r\n最大层数4层（重复触发刷新持续时间，但是达到最大层数后不再刷新）\r\n凯彼阿光波：10秒内被动效果保持最大层数，技能伤害提升7.5%\r\n冷却时间：90秒',
  '芳华 命运指环':
    '时空扭曲：\r\n最后施放技能冷却初始化\r\nMP恢复速率提高2500，持续10秒，并且对沉默，眩晕和击退效果免疫，冷却时间：75秒\r\n回到过去：恢复最大生命值的100％冷却时间：300秒',
  '决意 魔尊法袍':
    '魔尊领域：\r\n8秒内自身魔法伤害免疫并免疫眩晕/击退/沉默，并且在500范围内友军受到魔法伤害降低40％。每秒恢复自身和友军的5％HP/MP\r\n冷却时间：100秒',
  遗忘:
    '怒火打击：攻击时25%几率触发毁灭造成 力量x80 魔法伤害（每道特效）225护甲/受到魔法伤害增加2.5％，持续6秒。冷却时间：5秒\r\n遗忘：\r\n每秒提高150点力量，并提高1.5％技能伤害（最多10层）根据减少的生命值，叠加速度最多提升100％每秒减少的HP为（1500+开启时间x500）HP低于1时自动关闭可以通过ESC键主动关闭。冷却时间：60秒',
  '渡厄 沐雨却念':
    '治愈之水：\r\n使受治疗目标的生命值恢复提高智力x0.4，持续3秒。\r\n暴风雨：\r\n每2秒恢复1200范围内友军智力x1生命值，持续6秒。冷却时间：15秒',
  '焚释 永恒之焰':
    '火焰印记：\r\n15%几率触发触发时造成敏捷x30魔法伤害持续时间内每秒造成敏捷X15魔法伤害，并使其受到魔法伤害提高2.5％，持续10秒\r\n进入战斗状态时，逐渐累积战意之火每6秒技能伤害和火属性提高1％（最多15层）',
  '觉醒 惩戒者':
    '尺牍惩戒：\r\n对375范围内敌人造成主属性x50魔法伤害\r\n觉醒:\r\n敏捷提高1250，每秒恢复生命值10%，持续7.5秒非拳师职业触发时，持续时间内触发尺牍惩戒所需攻击次数减少至4。冷却时间：15秒',
  '碎魔 绝望之戒':
    '寒岚打击：\r\n使目标受到魔法伤害提高7.5％（B型），持续12秒\r\n诅咒：\r\n主动对带有被动效果的敌人使用对目标造成最大生命值x1.25％通用伤害，并使受到伤害提高5%，持续2秒。冷却时间：30秒',
  '末路 圣裁者':
    '圣裁子弹：\r\n下次攻击附加（攻击力x600%+敏捷x50）魔法伤害并造成0.25秒眩晕。最多充能3次',
  '破穹 勇敢之心':
    '勇气：\r\n恢复自身40%最大生命值，周围600范围内友军恢复20%最大生命值，眩晕600范围内敌方单位1.5秒。冷却时间：40秒',
  '修正 除魔者':
    '魔王追逐：\r\n破坏护盾效果并造成（敏捷x250+最大生命值x7.5%）魔法伤害。冷却时间：75秒',
  '绝息 爆破背包':
    '投掷炸弹：\r\n将炸弹安置到目标位置当敌人接近或降落时触发轰炸，造成力量x30魔法伤害，会触发400范围的连锁爆炸连锁爆炸时增加0.5秒的眩晕效果，每多一轮轰炸增加100％的伤害（最多400%）。最多可同时安放10个炸弹。冷却时间：2秒',
  '归寂 荆棘铠甲':
    '荆棘之刺：\r\n对附近325范围内的敌人造成相当于最大生命值x2000％的魔法伤害。攻击力提高5000，持续2.5秒。冷却时间：7.5秒\r\n累积伤害后可强化下次使用的地狱之刺\r\n累积受到伤害达到最大生命值x100％的伤害时触发强化，每次收到伤害最多充能50%。主动强化对附近650范围内的敌人造成最大生命值x5000％的魔法伤害，并眩晕2秒使用强化后5秒方可进行下一次伤害累积',
  '破邪 苍穹统治者':
    '苍穹之力：\r\n全属性提高500，每次攻击造成主属性x1.25 通用伤害，持续5秒。冷却时间：15秒。\r\n毁灭之星：\r\n对目标半径600范围内的敌人造成（力量+敏捷）x250魔法伤害，并眩晕2.5秒，同时护甲降低300，持续10秒。冷却时间：120秒',
  '亚塔纳西亚 收割盔甲':
    '收割者：\r\n6秒钟内生命值不低于1。结束时，对1000范围内目标根据剩余生命值造成 主属性x100~200 的通用伤害（生命值越低伤害越高），并回复自身100%最大生命值。冷却时间：60秒',
  '宁歇 疯狂指环':
    '狂暴：\r\n7.5％概率触发，增加25000攻击力及1500的主属性/生命值恢复速度，并附带5次（攻击力*1）的纯粹伤害。持续7.5秒。冷却时间：15秒。',
  '尘寰 希望之戒':
    '火焰打击：\r\n使目标全伤害提高7.5％，主属性提高400，持续12秒\r\n希望：\r\n为带有被动效果buff的友军清除debuff，并恢复最大生命值x50%。冷却时间：30秒。',
  玉宇背包: '点击投掷圣水：圣水可恢复100%HP及清除DEBUFF，投掷后60秒后消失。CD15秒。',
  '轮回 毁灭头巾':
    '毁灭时刻：\r\n对自身800范围内的敌人造成智力x250魔法伤害，眩晕1.5秒，并恢复附近友军生命值30％。同时召唤法阵，沉默敌方单位，并每秒恢复友方生命值10％，持续3秒。冷却时间：45秒',
  '平静 卸尘之冠':
    '霜寒赋予：\r\n技能伤害提高12.5％，全属性提高500，持续12秒。在持续时间内免疫控制效果。冷却时间：100秒',
  '焚神 浴火魂翼':
    '坠落火焰：\r\n跃起并降落到目标点，对目标点附近敌人造成攻击力x15+主属性x125的魔法伤害，并眩晕1.5秒。最大移动距离：1500。冷却时间：30秒',
  '荆棘 霜寒羽翼':
    '冰霜之棘：进入战斗状态时，冰刺会自动检索附近boss单位，造成智力x25的魔法伤害。最多同时存在5个冰刺',
  '圣辉 苍穹之曜':
    '每0.15秒充能一次审判打击，造成主属性x1.5通用伤害。主动开启魔法防御，冷却时间60秒',
  '贪婪 无尽诅咒':
    '贪婪：\r\n战斗中每秒叠加一层，每层提高1%伤害与2%所受伤害，上限25层，持续5秒，重复触发刷新持续时间。',
  '狂赫 深渊之魂':
    '深渊之力：\r\n给予使用者12%的技能伤害（B型）和300点生命回复，半径375，持续8秒\r\n深渊的呼唤：\r\n给予目标友方8%的伤害输出和15%的生命回复，持续10秒，CD90秒。',
  "Uncle Van's Fruit": 'Active:\r\nIncreases EXP gain by 15% for 10 minutes',
  "Uncle Van's Melon": 'Active:\r\nIncrease SKILL DMG by 12% for 60 seconds',
  "Uncle Van's Pumpkin": 'Active:\r\nRestores HP by 30%\r\nRestores MP by 5000',
  "Uncle Van's Carrot":
    "Active:\r\nATK DMG and MOV SPD increased by 40% for 5 minutes\r\nDoes not work if you're above level 400",
  'Book of Death': 'Active:\r\nOn use, immediately fills up fatigue',
  'Magical Horn': 'Active:\r\nSummons a field boss',
  'Frozen Crystal': 'Active:\r\nSummons a field boss',
  'Greatsword of Nature': "Passive:\r\nOn attack, decreases target's armor by 25 for 5 seconds\r\n",
  'Gloves of Nature': 'Passive:\r\nOn attack, increases AGI by 25 for 4 seconds\r\n',
  'Bow of Nature': 'Passive:\r\nOn attack, leaves a poison that deals 2000 damage per second\r\n',
  'Armor of Nature': 'Passive:\r\nAbsorbs DMG TAKEN by 75\r\n',
  'Wings of Nature': 'Active:\r\nOn use, creates a portal that connects to Alfon Village',
  'Nightmare Rod':
    'Active:\r\nSummons a field boss\r\nMay be used without powder\r\nHowever if used together with 8 Red Powder, it summons a powerful boss',
  'Flame Cloak': 'Passive:\r\nPeriodically deals 5000 magic damage to nearby enemies\r\n',
  'Orb of the Deep Sea':
    'Active:\r\nSummons a field boss\r\nGreen Powder x4 needed\r\nBlue Powder x4 needed',
  'Sword of Deep Sea':
    'Passive:\r\n20% Chance to deal (0.01 X ATK DMG X 2) splash damage on attack\r\n',
  'Gloves of Deep Sea':
    'Passive:\r\n20% Chance to deal (0.01 X ATK DMG X 2) splash damage on attack\r\n',
  'Greatsword of Deep Sea':
    'Passive:\r\n20% Chance to deal (0.01 X ATK DMG X 2) splash damage on attack\r\n',
  'Bow of Deep Sea':
    'Passive:\r\n20% Chance to deal (0.01 X ATK DMG X 2) splash damage on attack\r\n',
  'Rifle of Deep Sea':
    'Passive:\r\n20% Chance to deal (0.01 X ATK DMG X 2) splash damage on attack\r\n',
  'Sword of Corruption': 'Passive:\r\n10% Chance to deal 5000 bonus damage on attack\r\n',
  'Gloves of Corruption': 'Passive:\r\n10% Chance to deal 5000 bonus damage on attack\r\n',
  'Greatsword of Corruption': 'Passive:\r\n10% Chance to deal 5000 bonus damage on attack\r\n',
  'Staff of Corruption': 'Passive:\r\n10% Chance to deal 5000 bonus damage on attack\r\n',
  'Bow of Corruption': 'Passive:\r\n10% Chance to deal 5000 bonus damage on attack\r\n',
  'Rifle of Corruption': 'Passive:\r\n10% Chance to deal 5000 bonus damage on attack\r\n',
  'Seal Breaking Gemstone': 'Passive:\r\nBring to the sleeping Ancient Ent to break its seal.\r\n',
  'Plates of Regeneration':
    'Passive:\r\nTemporarily boosts HP regen to 2500 HP per second when HP drops below 30% of max HP for 10 seconds\r\nCooldown: 55 seconds, cannot be dropped during cooldown\r\n',
  'Vest of Protection':
    'Passive:\r\nCreates a barrier that absorbs 3000 damage every 8 seconds\r\n',
  'Fairy Robe':
    "Active:\r\nSummons fairy on use. Has two spells:\r\nHeals 40000 HP over 12 seconds\r\nDecrease the target's armor by 200 with fairy's fire for 10 seconds\r\nLasts 30 seconds on non-boss units\r\nCooldown: 90 seconds",
  Lifestone:
    "Passive:\r\nIncreases allies' ATK SPD by 10%\r\nActivates revival on death\r\nCooldown: 180 seconds, cannot be dropped during cooldown\r\n",
  'Spiritus, the Sword of Elements':
    "Passive:\r\nEnables the use of Breath of Ancients every 5 seconds\r\nDeals ((STR + AGI + INT) X 7.5) magic damage on attack\r\nReduces target's MOV SPD by 20% for 3 seoncds\r\n",
  'Storm Headdress':
    'Passive:\r\nOn crit, strike down a lightning\r\nDeals ((STR + AGI + INT) X 3) magic damage\r\nHas a 15% chance to deal ((STR + AGI + INT) X 15) magic damage instead\r\nCooldown: 2.5 seconds\r\n',
  'Visvire, the Hammer of Storm':
    'Passive:\r\nActivates Source of Power on skill cast\r\nDeals (STR X 1.5) magic damage on next attack\r\nIncreases MOV SPD by 100% and STR by 425 for 6 seconds\r\nCooldown: 10 seconds, cannot be dropped during cooldown\r\n',
  'Sword of Deadly Poison':
    'Passive:\r\nInflicts poison that periodically deals 800 damage on attack\r\n',
  'Greatsword of Deadly Poison':
    'Passive:\r\nInflicts poison that periodically deals 800 damage on attack\r\n',
  'Gloves of Deadly Poison':
    'Passive:\r\nInflicts poison that periodically deals 800 damage on attack\r\n',
  'Staff of Deadly Poison':
    'Passive:\r\nInflicts poison that periodically deals 800 damage on attack\r\n',
  'Bow of Deadly Poison':
    'Passive:\r\nInflicts poison that periodically deals 800 damage on attack\r\n',
  'Rifle of Deadly Poison':
    'Passive:\r\nInflicts poison that periodically deals 800 damage on attack\r\n',
  'Bloodsword Tepethia': 'Passive:\r\nOn attack, drains 10% of DMG DEALT as life (up to 800)\r\n',
  'Blood Cannon Tepes': 'Passive:\r\nOn attack, drains 10% of DMG DEALT as life (up to 800)\r\n',
  'Sanguiel, the Bloodspear':
    'Passive:\r\nOn attack, drains 8% of DMG DEALT as life (up to 600)\r\n',
  'Pumpkin Rod':
    'Active:\r\nOn use, activates Throw Pumpkin\r\nDeals (7500 + INT X 40) magic damage\r\nStuns target for 1 second and heals caster for 10000 HP\r\nUsable on magic immune targets (still damage type magic)\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  'Candy Bag':
    'Active:\r\nOn use, throws out 5 random candies\r\nCinnamon Candy: +50 STR\r\nIcicle Candy: +50 AGI\r\nMana Candy: +50 INT\r\nSoul Candy: +10% EXP Received\r\nDuration: 30 minutes for all candies',
  'Dragonsword Lainhart':
    "Passive:\r\n10% Chance to activate Dragon's Claw on attack\r\nDeals (4500 + MAIN STAT X 2.5) magic damage\r\n",
  'Dragonbow Aience':
    "Passive:\r\n10% Chance to activate Dragon's Claws on attack\r\nDeals (4500 + MAIN STAT X 2.5) magic damage\r\n",
  'Dragonstaff Irave':
    'Active:\r\nOn use, activates Mana Cannon\r\nDeals (INT X 75) magic damage in a linear path\r\nCooldown: 60 seconds',
  'Dragon Cannon Belenus':
    "Passive:\r\n10% Chance to activate Dragon's Claws on attack\r\nDeals (4500 + MAIN STAT X 2.5) magic damage\r\n",
  'Dragon Armor Magron': 'Passive:\r\nAbsorbs DMG TAKEN by 300\r\n',
  "Dragon's Helm Agron": 'Active:\r\nOn use, block magic every 8 minutes',
  'Leoreus, the Greatsword of Flame':
    'Passive:\r\n10% Chance to create Flame Explosion on attack\r\nDeals (flame affinity X (12000 + STR X 9)) magic damage\r\n',
  'Irbeth, the Sword of Lightning':
    'Passive:\r\n10% Chance to strike down lightning on attack\r\nDeals (wind affinity X (12000 + AGI X 5)) magic damage\r\n',
  'Pheles, the Bow of Wind':
    "Active:\r\nOn use, activates Sylph's Blessing\r\nHeals all allies in a 550 AoE radius for 20% max HP and 25% max MP\r\nCooldown: 50 seconds, cannot be dropped during cooldown",
  'Benziena, the Rod of Earth':
    'Active:\r\nOn use, activates Earthen Rage\r\nDeals (INT X 45) magic damage to enemies in a targetted area',
  'Retus, the Iron Bullet':
    'Passive:\r\nEmpowers next attack with Iron Bullet every 8 seconds\r\nEmpowered attacks deal (50 X AGI) magic damage and stuns for 0.375 seconds\r\n',
  'Robe of the Mage': 'Active:\r\nOn use, block magic every 5 minutes',
  'Hood of the Mage':
    'Active:\r\nOn use, grants invisibility for 20 seconds\r\nCooldown: 60 seconds, cannot be dropped during cooldown',
  'Ring of Resonance':
    'Active:\r\nOn use, activates Resonance\r\nRefreshes the cooldown of the last skill used\r\nDoes not apply to ultimate skill or items\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  'Karonphniamm, the Holy Sword':
    'Passive:\r\n10% chance to activate Holy Strike on attack\r\nIf MAIN STAT is STR: deals (STR X 12) magic damage\r\nIf MAIN STAT is AGI or INT: deals (AGI X 12) magic damage\r\n',
  'Klenetia, the Holy Staff':
    'Active:\r\nOn use, activates Holy Explosion\r\nDeals (INT X 75) magic damage to enemies in a targetted area and stuns for 1 second',
  'Eana, the Holy Cannon':
    'Passive:\r\n10% chance to activate Holy Bullet on attack\r\nIf MAIN STAT is STR: deals (STR X 12) magic damage\r\nIf MAIN STAT is AGI or INT: deals (AGI X 12) magic damage\r\n',
  'Sacred Armor':
    'Passive:\r\n10% Chance to create a barrier on being hit\r\nIncreases armor by 10000 for 4 seconds\r\nCooldown: 12 seconds\r\n',
  'Sacred Helm':
    'Active:\r\nOn use, block magic every 4 minutes\r\nShares cooldown with Helm of Battle',
  'Eximelia, the Unholy Sword':
    'Passive:\r\n10% Chance to activate Dark Strike on attack\r\nDeals (AGI X 12) magic damage\r\n',
  'Dekaros, the Unholy Armor':
    "Passive:\r\n12% Chance to reduce attacker's armor on being hit\r\nReduces armor by 125 for 5 seconds\r\n",
  'Alkate, the Unholy Bow':
    'Passive:\r\n12% Chance to activate Dark Spike on attack\r\nDeals (AGI X 12) magic damage\r\n',
  'Robe of Everfrost':
    'Passive:\r\n10% Chance to activate Frost Armor on being hit\r\nIncreases armor by 400 for 15 seconds\r\n',
  'Helm of Everfrost':
    'Passive:\r\n10% Chance to freeze attacker on being attacked for 1.5 seconds\r\n',
  'Hood of Everfrost':
    'Passive:\r\n10% Chance to freeze attacker on being attacked for 1.5 seconds\r\n',
  'Winter Rose':
    'Passive:\r\n10% Chance to temporarily boost INT by 250 on attack for 6 seconds\r\nDoes not stack\r\n',
  'Okelanq, the Spear of Frost':
    "Passive:\r\n13% Chance to activate Frost effect on attack\r\nDeals (MAIN STAT X 12) magic damage and reduces enemy's MOV SPD by 20% for 3 seconds\r\n",
  'Okelanq, the Bow of Frost':
    "Passive:\r\n13% Chance to activate Frost effect on attack\r\nDeals (MAIN STAT X 12) magic damage and reduces enemy's MOV SPD by 20% for 3 seconds\r\n",
  'Frost Web Brooch':
    "Passive:\r\nDMG DEALT by attack +10%\r\n8% chance to reduce target's armor by 175 on attack for 5 seconds\r\n",
  "Winter's Tear":
    'Passive:\r\nSlows enemies on attack\r\nEvery 8th attack unleashes Chilling Strike that ignores all resistance\r\nDeals (water affinity X (STR X 1.8 + AGI X 1.5)) pure damage\r\n',
  Frostbane:
    'Passive:\r\n15% chance to slow target on attack\r\nDeals (AGI X 7.5 ~ 10) magic damage and slows for 3 seconds\r\n',
  Niflheim:
    'Active:\r\nOn use, increases ATK DMG by 15000 and STR by 1000 for 8 seconds\r\nCooldown: 25 seconds',
  'Ripple Snow':
    'Passive:\r\nOn use, activates Frozen Shard\r\nDeals (water affinity X (INT X 60)) magic damage and freezes enemies for 2 seconds\r\nDamage is affected by ice/water affinity\r\n',
  'Claws of Destruction':
    'Passive:\r\n(1 + HIT COUNT X 0.125)% Chance to activate Doomsday on attack\r\nDeals (42 X (STR + AGI)) + (8 X ATK DMG) magic splash damage and stuns for 0.1 seconds\r\n',
  'Bullet of Destruction':
    'Passive:\r\n(1 + HIT COUNT X 0.125)% Chance to activate Doomsday on attack\r\nDeals (42 X (STR + AGI)) + (8 X ATK DMG) magic splash damage and stuns for 0.1 seconds\r\n',
  'Horn of Demon Lord':
    "Active:\r\nSteals target's soul on use for 5 seconds, healing hero for (max HP / 7.5) and deals (MAIN STAT X 8 + max HP / 7.5) magic damage to target\r\nIf target dies while draining, grants 350 AGI for 5 minutes\r\nCooldown: 150 seconds, cannot be dropped during cooldown",
  'Eye of the Abyss':
    "Passive:\r\nNearby allies' SKILL DMG +4%\r\nActive:\r\nOn use, summons 4 monsters\r\nINT increase is lowered by half while on cooldown\r\nCooldown: 100 seconds, cannot be dropped during cooldown",
  'Shell Sword':
    "Passive:\r\n25% Chance to deal pure splash damage on attack\r\nDamage depends on hero's ATK DMG\r\n",
  'Crab Armor':
    "Passive:\r\nReflects damage if attacked\r\nReflected damage depends on user's base ATK DMG:\r\nIf base ATK DMG is more than 300, damage reflected is 1200 pure damage\r\nIf base ATK DMG is 300 and less, damage reflected is (base ATK DMG X 4) pure damage\r\n",
  'Sea Jewel':
    'Active:\r\nCalls a refreshing wave upon use\r\nIf unit hit with wave is ally, heals for 3000 HP\r\nIf unit hit with wave is enemy, deals (MAIN STAT X 25) + 4000 magic damage\r\nCooldown: 120 seconds',
  'Waterfall Shoes':
    'Passive:\r\nOn kill, 8% chance to temporarily boost EXP gain by 12% and MP regen by 15% for 30 seconds\r\n',
  'Ivory Cane': 'Passive:\r\nDeal 1500 bonus magic damage on attack\r\n',
  'Icicle Bow':
    'Passive:\r\nApplies bonus magic damage and a slow effect on attack\r\nEach attack deals a bonus of (Water/Ice affinity X 800 ~ 1500) magic damage\r\nSlow effect lasts for 0.75 seconds\r\n',
  'Snowman Pendant':
    "Active:\r\nSummons Snowman on use that deals (INT X 15) + 5000 magic damage upon landing on an enemy\r\nEach snowman's attack applies a slow effect to target and has a 15% chance to deal (INT X 2.5) + 2500 magic damage\r\nCooldown: 120 seconds, cannot be dropped during cooldown",
  'Glacier Guard':
    'Passive:\r\n10% Chance to freeze nearby enemies on being hit and deal 30000 magic damage\r\nFreeze lasts for 1.5 seconds\r\n',
  'Wind-Protection Clothing':
    'Passive:\r\nAllows you to dodge a fatal damage if DMG DEALT makes HP drop below 40.5% every 90 seconds\r\nCannot be dropped during cooldown\r\n',
  "King Kong's Claws":
    'Passive:\r\n+10% DMG DEALT by attack\r\nDeals 2500 when attacking same target\r\nSecond attack applied is pure damage\r\n',
  'Meat Bag':
    'Passive:\r\nOn use, activates Restore Stamina, restoring HP and MP for 2000 and increasing ATK SPD by 15%\r\n',
  'Helm of Passion': "Passive:\r\nIncreases nearby allies' MOV SPD by 20% and ATK SPD by 10%\r\n",
  'Crimson Stone':
    'Passive:\r\nOn skill cast, increases HP regen by 300 and SKILL DMG by 6% for 3 seconds\r\n',
  Blaster:
    'Passive:\r\n14% Chance to activate Explosion on attack dealing (AGI X 10) magic splash damage\r\n',
  'A Small Piece of Wrath':
    'Passive:\r\n12.5% Chance to activate Wrath on skill cast dealing (MAIN STAT X 40) magic splash damage and stuns for 1 second\r\n',
  Flamereaver:
    'Passive:\r\nGrants 2% chance to inflict STR X 50 magic damage on attack\r\nDamage is affected by flame affinity\r\n',
  'Blade of Requiem':
    'Passive:\r\nActivates Unleash every 14th attack\r\nRed Wrath: deals (MAIN STAT X 22.5) magic splash damage\r\nGreen Wrath: reduces target MOV and ATK SPD by 66% for 3 seconds, deals (MAIN STAT X 12.5) magic splash damage, and stuns non-boss units for 0.25 seconds\r\nBlue Wrath: heals user for (MAIN STAT + 3000) HP and (current MP + (max MP X 15%)) MP\r\n',
  'Crossbow of Requiem':
    'Passive:\r\nActivates Unleash every 14th attack\r\nRed Wrath: deals (MAIN STAT X 22.5) magic splash damage\r\nGreen Wrath: reduces target MOV and ATK SPD by 66% for 3 seconds, deals (MAIN STAT X 12.5) magic splash damage, and stuns non-boss units for 0.25 seconds\r\nBlue Wrath: heals user for (MAIN STAT + 3000) HP and (current MP + (max MP X 15%)) MP\r\n',
  'Blood Orb':
    'Passive:\r\nSteals HP on attack\r\nActive:\r\nOn use, grants 10% SKILL DMG and 6% life steal for skills for 9 seconds',
  'Cape of the Dead':
    'Passive:\r\nIf HP drops below 15%, gain 90% damage reduction for 3 seconds\r\nCooldown: 90 seconds\r\n',
  'Ring of the Dead':
    'Passive:\r\nPeriodically drains HP from nearby enemies (50 HP from creeps and 300 HP bosses)\r\n',
  'Mask of Blood':
    'Active:\r\nOn use, activates Bloodlust granting 30% life steal, 400 MAIN STAT, and 100% bonus ATK and MOV SPD for 8 seconds\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  'Cursed Mask': 'Active:\r\nSummons a field boss',
  'Stone Plates':
    'Active:\r\nOn use, activates Stone Form\r\nGrants the user with an 8000 shield for 2 seconds and 4000 bonus HP and MP regen\r\nCooldown: 40 seconds, cannot be dropped during cooldown',
  'Bat Wings':
    'Passive:\r\nUpon moving 400 distance, activates Drain on next attack dealing bonus (33% ATK DMG) pure damage and heal for 6% HP\r\ncooldown: 0.125 seconds\r\n',
  Trident: 'Passive:\r\nOn skill cast, enhances the next 3 attacks for 6 seconds\r\n',
  'Tidal Robe': 'Passive:\r\nRecovers 4000 HP over 5 seconds when hit\r\n',
  'Droplet Orb':
    "Active:\r\nOn use, creates a Bubble Barrier for 6 seconds\r\nIncreases the user's MAGIC DEF by 90%\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  'Wings of Purification': 'Passive:\r\nEvery 5 seconds recovers 3000 HP of nearby allies\r\n',
  Corruptor:
    'Passive:\r\n25% Chance to corrupt enemies in frontal cone on attack dealing (STR X 40) magic damage and reducing their armor by 175 for 6 seconds\r\n',
  Stalker:
    'Passive:\r\n9% Chance to activate Corrupt Explosion on attack\r\nDeals (1.5 X AGI X 10) magic damage and deals (AGI X 10) magic damage to enemies around target\r\n',
  Avenger:
    'Active:\r\nOn use, activates Vengeance blocking the next spell-inflicted damage instance for 6 seconds and increases AGI by 1000 for 15 seconds\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  Chaser:
    'Active:\r\nOn use, activates Chaser spawning 6 projectiles around user for 6-8 seconds\r\nOn the next 6 attacks, one projectile per attack gets released and deals (AGI X 17.5) magic splash damage to target.\r\nCooldown: 20 seconds, cannot be dropped during cooldown',
  'Skull Seal':
    'Passive:\r\nOn being healed, converts 10% of excess amount into max HP\r\nMax bonus HP is 7500\r\n',
  'Potion of Corruption':
    'Active:\r\nOn use, transforms user for 12 seconds\r\nGrants the user with 250 all stats, increase MAGIC DEF by 60%, and heals 1% of max HP per second over duration\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  'Staff of Contagion':
    'Active:\r\nOn use, creates a poisonous field at the target location for 8 seconds\r\nDeals (INT X 125) total magic damage in a 375 AoE over duration\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  Hatred:
    'Passive:\r\nConverts 0.035% of DMG DEALT into INT for a max of 600 INT (can be released)\r\nActive:\r\nOn use, can release stored INT that deals ((0.5 + ( stored INT - 300 ) / 600) X INT X 90) magic damage to enemies in a 450 radius around user\r\nStuns for 1.5 seconds\r\nAt least 300 stored INT required to use\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  'Flameshard Armor':
    'Passive:\r\nActivates Flameshard when HP drops below 35%\r\nIncreases STR by 5% for 10 seconds and restores 14% max HP\r\nDeals (STR X 25) magic damage to enemies in a 325 radius around user and reduce their ATK and MOV SPD by 75% for 1.5 seconds\r\nDamage is affected by flame affinity\r\nCooldown: 8 seconds, cannot be dropped during cooldown\r\n',
  'Ring of Nightmare':
    'Passive:\r\n5% Chance to activate Nightmare on attack\r\nGain 15000 ATK DMG, 900 MAIN STAT, and 1000 HP regen for 6 seconds\r\n',
  Inferno:
    'Passive:\r\n20% Chance to activate Burning Wrath on attack that causes 5 explosions on target over 2.5 seconds\r\nEach explosion deals (AGI X 20) magic damage to enemies in a 325 radius around target\r\nRestores 1% HP per explosion for a total of 5% max HP\r\nCooldown: 10 seconds, cannot be dropped during cooldown\r\n',
  'Crown of Fervor': 'Passive:\r\nConverts 2% of max HP into INT (max 500)\r\n',
  'Water Cannon':
    'Active:\r\nOn use, releases Water Beam dealing (INT X 25) magic damage per 0.125 seconds and pushes all enemies hit\r\nDamage is affected by Ice/Water Affinity\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  'Tunic of Subtlety': 'Passive:\r\nDodges upto 3 attacks every 20 seconds\r\n',
  'Purified Water':
    'Active:\r\nOn use, restores 20% MP\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  'Scale Protector':
    'Passive:\r\n12.5% Chance to restore 2.5% HP on being hit\r\nActive:\r\nOn use, increases max HP by 20000 and MP by 7500 for 15 seconds\r\nCooldown: 180 seconds, cannot be dropped during cooldown',
  'Oath of Courage':
    'Passive:\r\nIncreases nearby allies MAGIC DEF by 8%\r\nActive:\r\nOn use, consumes HP to activate Blessing\r\nCreates a shield for all allies within 400 radius\r\nCooldown: 60 seconds',
  'Death Scythe':
    "Passive:\r\n12% Chance to activate Strike of Malice on attack dealing (MAIN STAT X 35) magic damage\r\nActive:\r\nOn use, activates Soul Reaper dealing (MAIN STAT X 150) magic damage and slowing target's MOV SPD by 50%\r\nAlso gives +5% SKILL DMG to user\r\nCooldown: 150 seconds, cannot be dropped during cooldown",
  'Staff of Souls':
    'Active:\r\nOn use, activates Dark Howl\r\nDeals (INT X 19.75) magic damage\r\nStacks magic DMG TAKEN of target by 1% per wave for 4 waves\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  'Robe of the Reaper':
    'Active:\r\nOn use, activates Death Pact granting the user 850 INT for 11 seconds at the cost of 40% HP\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  'Bone Necklace':
    'Passive:\r\nEvery 8 seconds, activates one of the following:\r\nAnger: +10% SKILL DMG\r\nOblivion: +16% damage reduction\r\nObsession: (MAIN STAT X 20%) HP regen\r\nActive:\r\nOn use, temporarily activates all effects\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  'Parasitic Staff':
    'Active:\r\nOn use, activate Parasite for 5 seconds\r\nIf target is an enemy: deals (INT X 5) magic damage per second and lose 10% heal received\r\nIf target is an ally: grants target with 40% MAGIC DEF and heals for INT X 1 per second\r\nIf target is self: grants target with 40% MAGIC DEF and heals for INT X 0.5 per second\r\nUpon expiration, will explode dealing (INT X 40) magic splash damage\r\nCooldown: 25 seconds, cannot be dropped during cooldown',
  'Hood of the Fallen':
    "Passive:\r\nActivates Hands of Fallen on death\r\nExplodes dealing (MAIN STAT X 275) magic damage to enemies nearby\r\nScales with user's stats\r\n",
  'Shroud of Perseverance':
    'Passive:\r\n8% Chance to activate Perseverance on attack\r\nGrants user with +50% MOV and ATK SPD, +100 MAIN STAT per tick for 10 seconds, and a 40% heal\r\nCooldown: 30 seconds, cannot be dropped during cooldown\r\n',
  'Embrace of Nature':
    "Active:\r\nOn use, temporarily increases nearby allies' max HP\r\nIf self or summon: grants +6000 HP and +5% SKILL DMG for 45 seconds\r\nIf ally is a hero: grants +3000 HP for 45 seconds\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  'Griseus, the Sword of Protection':
    'Active:\r\nOn use, activates Ethereal Strike that (max MP X 2) pure damage and stuns for 1 second if target is enemy\r\nIf an ally is hit: heals the target for (max HP X 25%)\r\nCooldown: 15 seconds, cannot be dropped during cooldown',
  'Ring of the Storm':
    'Passive:\r\nOn skill cast, increases SKILL DMG by 3% for 6 seconds (stacks up to 4 times)\r\nActive:\r\nOn use, summons a storm in a 325 radius above the user that deals (MAIN STAT X 12.5) magic damage per second for 4 seconds\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  'Levante, the Sword of Love and Hate':
    'Passive:\r\nResonates with nearby allies to become stronger\r\nFor each ally nearby, the user gains +1750 ATK DMG and +1% SKILL DMG\r\n12% chance to deal (MAIN STAT X 37.5) magic damage\r\n',
  'Draconic Skin Rusalka':
    'Passive:\r\n10% Chance to activate Dragonic Skin on being damaged which blocks any amount of damage and heals you for that amount\r\nCooldown: 4 seconds, cannot be dropped during cooldown\r\nActive:\r\nOn use, blocks harmful magic every 3 minutes\r\nLasts 5 seconds\r\nCooldown: 180 seconds',
  'Nephthys, the Engraved Ring':
    'Active:\r\nOn use, activates Gifted Power which grants +300 HP regen and +5% MAGIC DEF every 1.5 seconds up to 5 times or fully healed\r\nCooldown: 120 seconds',
  'Guardian of the Skies':
    'Passive:\r\nActivates Power of Skies on casting skill\r\nEvery 4th attack deals (MAIN STAT X 2) pure damage and increases MAIN STAT by 250 for 4 seconds\r\nCooldown: 16 seconds, cannot be dropped during cooldown\r\nActive:\r\nOn use, activates Star of Creation\r\nDeals (MAIN STAT X 15) magic damage to all enemies in targetted area and stuns for 2 seconds\r\nUpon expiration, will explode dealing (MAIN STAT X 115) magic damage and reduce enemy armor by 250\r\nCooldown: 150 seconds, cannot be dropped during cooldown',
  'The Ender':
    'Passive:\r\nWhen attacking an enemy under 50% HP, increases damage output by 15% for 5 seconds\r\nEmpowers next attack for (MAIN STAT X 125) magic damage every 12 seconds\r\nCannot be dropped during cooldown\r\n',
  'Armor of Grudge':
    'Passive:\r\nReleases Grudge every 6 seconds\r\nSpikes protrude outwards from user in a 275 AoE dealing (ATK DMG X 7.5) magic damage\r\nAlso increases ATK DMG by 20000 for 1.5 seconds\r\n',
  'Eyes of the Watcher':
    'Active:\r\nOn use, activates Death Gaze\r\nDeals (MAIN STAT X 250) magic damage\r\nIncreases magic DMG TAKEN by enemies (Type-A) by 8% for 4 seconds\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  'Ring of Destruction': 'Passive:\r\n15% chance to do 40% bonus damage upon dealing damage\r\n',
  'Shackles of Heaven':
    'Active:\r\nOn use, activates Shackles of Heaven:\r\nLatches onto all enemies in targetted area dragging them for 5 seconds\r\nDeals (MAIN STAT X 25) for every 200 distance traveled\r\nReduces damage output of shackled enemies by 50%\r\nNote: Shackles can be released if target is knockback immune or distance between user and target reaches 1500 or more range\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  'Heart of Volcano':
    'Passive:\r\nGain one stack after 5 seconds of attacking, for a max of 5 stacks and 25 seconds of attacking\r\nStacks last for 15 seconds while in combat\r\nActive:\r\nOn use, activates Grand Explosion causing the user to explode and die after 1 second of delay.\r\nDeals (1 + stacks X 50%) X (MAIN STAT X 250) magic damage and stuns for 3 seconds\r\nCooldown: 180 seconds, cannot be dropped during cooldown',
  'Grail of Eternity':
    'Passive:\r\nCreates Water Barrier that absorbs up to 10000 damage and provides 1% HP and MP regen every 8 seconds\r\n',
  'Dragonic Orb':
    'Active:\r\nOn use, unleashes Draconic Power to summon a Dragon, grants the user 90% magic reduction and render the user invulnerable to instant deaths for 15 seconds.\r\nDragon skills:\n↳ Flame Breath [Q]: (MAIN STAT X 75) magic damage per second to enemies in target area\n↳ Dragon Scale [W]: Absorbs up to 30000 damage, +7500 HP regen, and lasts 2 seconds\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  'Ancient Hourglass':
    'Passive:\r\nEvery 3 seconds, your next attack strikes for 2 additional times\r\nActive:\r\nOn use, refreshes a random skill\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  'Curse of Greed':
    'Passive:\r\nOn dealing damage, inflicts Greed\r\nWhen in combat for 5 seconds, increases ATK SPD and DMG OUTPUT by 1%\r\nAlso increases DMG TAKEN by 2%\r\nCan be stacked up to 25 times\r\nCooldown: 1 second\r\n',
  'Tiny Essence of Storm':
    "Active:\r\nDeals (max HP X 20%) pure damage to the target and stuns for 1 second\r\nWorks only if user level is greater than or equal to target's level\r\nCooldown: 180 seconds",
  'Tiny Essence of Earth':
    "Active:\r\nPulls in nearby enemies from 900 range for 60 seconds\r\nWorks only if user level is greater than or equal to target's level\r\nCooldown: 180 seconds",
  'Tiny Essence of Sea':
    "Active:\r\nFreezes target for 5 seconds\r\nWorks only if user level is greater than or equal to target's level\r\nCooldown: 180 seconds",
  'Tiny Essence of Flame':
    'Active:\r\nOn use, deals hero level X 2000 magic damage to nearby enemies within 1800 radius\r\nCooldown: 180 seconds',
  'Tiny Essence of Light':
    'Active:\r\n성스러움을 느낀다. (Does nothing special, just a graphic. Probably just something to be of use in later content?)\r\nCooldown: 180 seconds',
  'Tiny Essence of Chaos':
    'Active:\r\nCorrupts target monster. (Does nothing special. Probably just something to be of use in later content?)\r\nCooldown: 180 seconds',
  'Acorn Bomb':
    'Active:\r\nOn use, launches an Acorn Bomb dealing (500 + MAIN STAT X 25) magic damage and stuns for 2 seconds\r\nCooldown: 30 seconds\r\nDoes not stun bosses',
  Glasses: 'Passive:\r\nEnhances your field of sight at night to be the same as day-time.\r\n',
  'Bag of Demise':
    "Active:\r\nOn use, throws Eitr\r\nIncreases target's damage output by 7.5% for 15 seconds\r\nEitr duration: 30 seconds\r\nCooldown: 15 seconds, cannot be dropped during cooldown",
  'Bag of Explosion':
    'Active:\r\nOn use, obtains Throw Bomb\r\nReplaces Throwing Healing Potion with Throw Bomb. Use again to revert back\r\nCooldown: 2 second',
  'Bag of Despair':
    'Active:\r\nOn use, obtains Throw Bomb\r\nReplaces Throwing Healing Potion with Throw Bomb. Use again to revert back\r\nCooldown: 2 second',
  'Bag of Universe':
    'Active:\r\nOn use, throws Elixir\r\nElixir restores 100% of max HP and clears debuffs on consumption\r\nLasts 60 seconds on ground\r\nCooldown: 15 seconds, cannot be dropped during cooldown',
  'Sword of Darkness':
    'Passive:\r\n10% Chance to amplify ATK DMG by 2x for 5 seconds on attack\r\n',
  'Staff of Darkness': 'Passive:\r\nIncreased MP regen\r\n',
  'Bow of Darkness': 'Passive:\r\n10% Chance to amplify ATK DMG by 2x for 5 seconds on attack\r\n',
  'Sword of Pure Flame':
    'Passive:\r\n10% Chance to amplify ATK DMG by 2x for 5 seconds on attack\r\n',
  'Staff of Pure Flame': 'Passive:\r\nIncreased MP regen\r\n',
  'Bow of Pure Flame':
    'Passive:\r\n10% Chance to amplify ATK DMG by 2x for 5 seconds on attack\r\n',
  'Rifle of True Flame':
    'Passive:\r\n10% Chance to amplify ATK DMG by 2x for 5 seconds on attack\r\n',
  'Sword of Lethal Poison':
    'Passive:\r\nInflicts poison that periodically deals 1500 damage on attack\r\n',
  'Greatsword of Lethal Poison':
    'Passive:\r\nInflicts poison that periodically deals 1500 damage on attack\r\n',
  'Gloves of Lethal Poison':
    'Passive:\r\nInflicts poison that periodically deals 1500 damage on attack\r\n',
  'Staff of Lethal Poison':
    'Passive:\r\nInflicts poison that periodically deals 1500 damage on attack\r\n',
  'Bow of Lethal Poison':
    'Passive:\r\nInflicts poison that periodically deals 1500 damage on attack\r\n',
  'Rifle of True Poison':
    'Passive:\r\nInflicts poison that periodically deals 1500 damage on attack\r\n',
  'True Dragonsword Lainhart':
    "Passive:\r\n10% Chance to activate Dragon's Strike on attack dealing (15000 + MAIN STAT X 10) magic damage\r\n",
  'True Dragonstaff Irave':
    'Active:\r\nOn use, activates True Mana Cannon\r\nShoots out a blast mana in a straight line dealing (INT X 100) magic damage\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  'True Dragonbow Aience':
    "Passive:\r\n10% Chance to activate Dragon's Strike on each attack dealing (15000 + MAIN STAT X 10) magic damage\r\n",
  'True Dragon Cannon Belenus':
    "Passive:\r\n10% Chance to activate Dragon's Breath on attack dealing (15000 + MAIN STAT X 10) magic damage\r\n",
  'Parasitic Sword':
    'Passive:\r\n30% Chance to use Splash effect on attack and 15% chance to steal 600 HP\r\n',
  'Staff of Tentacles': 'Passive:\r\nRestores 500 HP and MP on kill\r\n',
  'Laksha, the Reigning Sword of Poison':
    'Passive:\r\nDeals 3000 bonus poison damage on attack\r\n',
  'Staff of Void':
    'Passive:\r\nOn skill cast, empower nearby allies with 6% SKILL DMG and 150 HP regen for 4 seconds\r\n',
  'Maw of Monster':
    'Passive:\r\n20% chance to activate Devour on attack\r\nCauses your attack to splash in a 375 radius and restore 1000 hp\r\n',
  'Tepethia, the Bloodsword of Domination':
    'Passive:\r\nOn attack, heals for 18% of DMG DEALT (max 1500)\r\n',
  'Sanguiel, the Bloodspear of Domination':
    'Passive:\r\nOn attack, heals 14% of DMG DEALT (max 1250)\r\n',
  'Staff of Madness':
    'Passive:\r\nOn skill cast, empower nearby allies with 7.5% SKILL DMG and 200 HP regen for 6 seconds\r\n',
  'True Blood Cannon Tepes': 'Passive:\r\nOn attack, heals 18% of DMG DEALT (max 1500)\r\n',
  'Leoreus, the Greatsword of Explosion':
    'Passive:\r\n10% Chance to activate Conflagration on attack. Deals ((16000 + STR X 12) X flame affinity) magic damage\r\n',
  'Crimson Pumpkin Rod':
    'Passive:\r\nOn skill cast, increase INT by 50, flame affinity by 1.5% for 4 seconds (stacks up to 5 times)\r\nActive:\r\nOn use, activates Throw Crimson Pumpkin. Hits target for (50000 + INT X 125) magic damage and stuns for 1.5 seconds\r\nAlso heals user for 15000 HP\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  'Dragon Blaster':
    'Active:\r\nOn use, activates Dragon Blast\r\nDeals ((AGI X 125) + 4% max HP) magic damage on collision\r\nCooldown: 60 seconds, cannot be dropped during cooldown',
  'Red Cross':
    'Active:\r\nOn use, activates Blood Purge\r\nDeals (AGI X 25) magic damage and heals allies for (INT X 2.5)\r\nCooldown: 12 seconds, cannot be dropped during cooldown',
  'Eximelia, the True Unholy Sword':
    'Passive:\r\n10% Chance to activate Dark Strike on attack\r\nDeals (AGI X 12) magic damage\r\n',
  'Tepethia, the Crimson Sword of Requiem':
    'Passive:\r\nActivates Blood Release on every 14th attack\r\nHeals user for (2500 + MAIN STAT X 0.6) HP and proccing a random Wrath effect\r\nRed Wrath: deals (MAIN STAT X 27.5) magic splash damage\r\nGreen Wrath: reduces target MOV and ATK SPD by 66% for 3 seconds, deals (MAIN STAT X 15) magic splash damage, and stuns non-boss units for 0.25 seconds\r\n',
  'Storm Reaver':
    'Passive:\r\n~11.1% Chance to slam down lightning on attack dealing (20000 + AGI X 10) magic damage\r\n~11.1% Chance to Awaken for 6 seconds on skill cast\r\nWhile Awakened, increases MOV and ATK SPD by 50% and gives a ~33.3% chance to deal (30000 + AGI X 15) magic damage\r\n',
  'Karonphniamm, the True Holy Sword':
    'Passive:\r\n10% Chance to activate Holy Strike on attack\r\nIf primary stat on hero is STR: deals (STR X 12) magic damage\r\nIf primary stat on hero is AGI or INT: deals (AGI X 12) magic damage\r\n',
  'Bahanar, the Sword of Illusion':
    'Passive:\r\n(8 + HIT COUNT X 0.2)% Chance to activate Grace Tear on attack\r\nDeals ((MAIN STAT X 15) + (ATK DMG DEALT X 3)) magic splash damage and stuns for 0.1 seconds\r\n',
  'Flame Soul':
    'Passive:\r\n10% Chance to activate Crimson Flame on attack\r\nDeals (ATK DMG + STR X 6) magic damage\r\nAlso increases STR by 50 for each stack up to a max of 8 times\r\n',
  'Sanguiel, the Bloodspear of Requiem':
    'Passive:\r\nActivates Blood Release on every 14th attack\r\nHeals user for (2500 + MAIN STAT X 0.6) HP and activates a random Wrath effect\r\nRed Wrath: deals (MAIN STAT X 27.5) magic splash damage\r\nGreen Wrath: reduces target MOV and ATK SPD by 66% for 3 seconds, deals (MAIN STAT X 15) magic splash damage, and stuns non-boss units for 0.25 seconds\r\n',
  'Klenetia, the True Holy Staff':
    'Active:\r\nOn use, activates Holy Explosion\r\nDeals (INT X 75) magic damage around the user, stunning for 1 second\r\nCooldown: 75 seconds',
  'Benziena, the Earthen Pillar':
    'Active:\r\nOn use, activates Twisting Earth in a selected 450 radius\r\nRestores 10% max HP per 0.5 seconds of allies within the area for 10 seconds\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  'Icicle Storm':
    'Passive:\r\nApplies bonus (water affinity X (AGI X (0.75 ~ 1.25))) magic damage and a slow effect on attack for 0.75 seconds.\r\n~8.3% Chance to launch to target 5 icicles on attack\r\nEach icicle deals (water affinity X (AGI X (4 ~ 6))) magic damage\r\n',
  'Alkate, the True Unholy Bow':
    'Passive:\r\n10% Chance to activate Dark Spike on attack\r\nDeals (AGI X 12) magic damage\r\n',
  'Eana, the True Holy Cannon':
    'Passive:\r\n10% Chance to activate Holy Bullet on attack\r\nIf primary stat on hero is STR: deals (STR X 12) magic damage\r\nIf primary stat on hero is AGI or INT: deals (AGI X 12) magic damage\r\n',
  'Retus, the Bullet of Judgment':
    'Passive:\r\nEmpowers next attack with Iron Bullet every 8 seconds\r\nNext attack deals (ATK DMG + AGI X 50) magic damage and stuns for 0.375 seconds\r\n',
  'Spirit Dagger':
    "Passive:\r\nActivates Breath of Ancients every 4 seconds\r\nNext attack deals ((STR + AGI + INT) X 7.5) magic damage\r\nNext attack also has a 20% chance to crit for 2 times the normal damage\r\nAlso reduces target's MOV SPD by 20% for 3 seconds\r\n",
  'Laksha, the Ancient Sword of Poison':
    'Passive:\r\nEmpowers next attack with poison on casting skill\r\nOn attack, gain a stack point up to a max of 10 stacks\r\nNext attack deals (AGI X (stacks X 0.5)) magic damage\r\nActive:\r\nOn use, activates Unleash\r\nDeals (AGI X (stacks X 12.5)) magic damage and resets the stack points\r\nCooldown: 100 seconds, cannot be dropped during cooldown',
  "Asmodeus, the Archdevil's Greatsword":
    'Passive:\r\n15% Chance to activate Chaos Strike on attack\r\nDeals ((STR + AGI) X 15) magic damage\r\n',
  'Bahanar, the True Sword of Illusion':
    'Passive:\r\n(8 + HIT COUNT X 0.2)% Chance to activate Grace Tear on attack\r\nDeals ((MAIN STAT X 20) + (ATK DMG DEALT X 3)) magic splash damage and stuns for 0.1 seconds\r\n',
  Deathbringer:
    'Active:\r\nOn use, activates Hand of Death\r\nDeals ((7.5% max HP) + (STR X 25) + (INT X 50)) magic splash damage and stuns for 1 second\r\nIncreases STR and INT by 650 and ATK DMG by 15000 for 15 seconds\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  Anger:
    "Passive:\r\n25% Chance to activate Devastation on attack\r\nDeals (STR X 60) magic damage to enemies in a frontal cone and reduce their armor by 200 for 6 seconds\r\nCooldown: 5 seconds\r\nActive:\r\nOn use, activates Rage\r\nIncreases ATK SPD by 50%, STR by 100, and SKILL DMG by 1% per 0.5 ~ 1 seconds while draining user's HP\r\nStacks up to 10 times and drains (800 + seconds elapsed X 400) HP per second\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  'Aglaia, the Spear of Heavenly Flows':
    'Passive:\r\nActivates Song of Glory on skill cast\r\nIncreases STR by 125 and SKILL DMG by 2.5% per stack for 5 seconds up to a max of 3 stacks\r\n',
  "Belius, the Archdevil's Staff":
    'Active:\r\nOn use, activates Chaos Explosion\r\nDeals (INT X 150) magic damage around the user, stunning for 1 second\r\nCooldown: 75 seconds',
  'Twin Snow':
    'Passive:\r\nOn skill cast, empowers next attack with ice to deal (INT X 7.5) magic damage and drenches enemy with wetness\r\nIf target is already drenched with wetness, deals (INT X 15) magic damage instead\r\nDamage is affected by ice/water affinity\r\nActive:\r\nOn use, activates Frozen Storm freezing enemies in a targetted area for 4 seconds and dealing (((ice/water affinity X 100) / (INT X 56)) X 8) magic damage for the duration\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  "Yggrect, the Archdevil's Bow":
    'Passive:\r\n~15.8% Chance to activate Chaos Spike on attack dealing ((STR + AGI) X 15) magic damage\r\n',
  'Flame Explosion':
    'Passive:\r\n12.5% Chance to activate Destruction on attack dealing (AGI X 5) magic damage and reduces amor of target by 20 for 10 seconds\r\n',
  'Pheles, the Bow of Skies':
    'Passive:\r\nActivates Poem of Wind on attack\r\nFires 1 additional projectile on every attack that deals (10% ATK DMG) pure damage\r\n',
  "Alchatratz, the Archdevil's Cannon":
    'Passive:\r\n15% Chance to activate Chaos Bullet on attack dealing ((AGI + STR) X 15) magic damage\r\n',
  'Dragon Buster':
    'Active:\r\nOn use, activates Dragon Buster, a projectile that explodes in targetted area stunning for 5 seconds\r\nDeals (((MAIN STAT X 75) + (max HP X 2.5%)) X 25%) magic damage for 8 seconds\r\nCooldown: 45 seconds',
  'Hydro Buster':
    'Passive:\r\nOn healing, activates Healing Water granting healed allies ((INT X 0.2) X water affinity) HP regen for 3 seconds\r\nActive:\r\nOn use, activates Hydro Buster\r\nFor 6 seconds, fires a beam which pushes mobs away and deals (INT X 25) magic damage per second (1000 range)\r\nIf a mob is pushed into terrain, it is stunned for the duration\r\nCooldown: 20 seconds, cannot be dropped during cooldown',
  'Devil Blaster':
    'Active:\r\nOn use, activates Devil Blast, shooting a projectile at the targetted area dealing ((AGI X 175) + (max HP X 6%)) magic damage\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  'Bullet of Ruin':
    'Passive:\r\nEmpowers next attack with Bullet of Ruin that deals (((AGI X 50) + (ATK DMG X 4)) X (50% X (stack - 1)) + 1) magic damage every 8 seconds\r\nEmpower lasts for 6 seconds and stuns targets for 0.375 seconds\r\nUp to 2 additional bullets may be loaded for a max of 3 stacks\r\n',
  'Crimson Cross':
    'Passive:\r\nEmpowers allies upon healing them\r\nEmpowered allies receive: +5% SKILL DMG and healing received for 4 seconds\r\nActive:\r\nOn use, activates Bloody Purge dealing (AGI X 25) magic damage to enemies and healing allies for (INT X 2.5) HP\r\nCooldown: 12 seconds, cannot be dropped during cooldown',
  'Claws of Beriel':
    'Passive:\r\n(1 + 0.125 X attacks without activation)% Chance to activate Doomsday on attack\r\nDeals (ATK DMG X 10 + (STR + AGI) X 65) magic damage\r\nStuns for 0.1 seconds\r\n',
  'Espishu, the Sword of Eternity':
    'Passive:\r\n10% Chance to activate Chaos Strike on attack dealing ((STR + AGI) X 37.5) magic damage\r\n',
  'Blazing Soul':
    'Passive:\r\n~20.8% Chance to activate Fervor on casting skill gaining one stack\r\nIncreases ATK DMG by 2500 per stack and deals (ATK DMG X (1 + stack X 20%) + (STR X 10)) magic damage\r\nDamage is affected by flame affinity\r\nStacks expire after 7.5 seconds of not casting a skill\r\n',
  'Ethenos, the Staff of Space':
    'Active:\r\nOn use, activates Dimensional Explosion\r\nDeals (INT X 300) magic damage in targetted area and stuns for 1.5 seconds\r\nCooldown: 60 seconds, cannot be dropped during cooldown',
  'Griveddon, the Bow of Certain Destruction':
    'Passive:\r\n10% Chance to activate Chaos Strike on attack dealing ((STR + AGI) X 37.5) magic damage\r\n',
  'Chronos, the Cannon of Time':
    'Passive:\r\n10% Chance to activate Chaos Strike on attack dealing ((STR + AGI) X 37.5) magic damage\r\n',
  'Devil Chaser':
    'Active:\r\nOn use, activates Devil Chaser dealing ((AGI X 200) + (max HP X 7.5%)) magic damage\r\nCooldown: 75 seconds',
  'Fiend Chaser':
    "Active:\r\nOn use activates Fiend Chaser, a wave that breaks shields and deals (AGI X 250 + 7.5% target's max HP) magic damage\r\nCooldown: 75 seconds, cannot be dropped during cooldown",
  "Dante's Inferno":
    'Passive:\r\nEmpowers next attack with Bullet of Ruin every 6 seconds dealing ((AGI X 50) + (ATK DMG X 4)) magic damage per bullet and stuns for 0.25 seconds\r\nUp to 2 additional bullets may be loaded\r\n',
  Punisher:
    'Passive:\r\nEmpowers next attack with Bullet of Punishment every 6 seconds dealing ((AGI X 50) + (ATK DMG X 6)) magic damage per bullet and stuns for 0.25 seconds\r\nUp to 3 additional bullets may be loaded\r\n',
  'Laktrisha, the Illusional Sword of Poison':
    'Passive:\r\nEmpowers next attack with True Poison on skill cast dealing (AGI X stacks X 1.3) magic damage per second for a max of 10 stacks\r\nOnce stacks are maxed, deals (AGI X 130) magic damage and stun for 0.375 seconds\r\nActive:\r\nOn use, activates Illusion on next attack received blocking any spells that deal more than 10% of max HP\r\nOn block, reflects damage back to enemy and deals (2 X (min(1, DMG DEALT / (max HP + 10%))) X max HP) magic damage and stuns for 2 seconds\r\nAlso grants user with: up to a max of +1250 AGI and +10% crit chance for 15 seconds\r\nCooldown: 105 seconds, cannot be dropped during cooldown',
  'Crimson Reaper':
    'Passive:\r\nEvery 14th attack activates Wrath of Blood dealing (MAIN STAT X 40) magic splash damage and heals user for ((MAIN STAT X 60%) + 3000) HP\r\n30% Chance to activate Blood Awakening on casting skill to increase AGI by 800 and empower Wrath of Blood for 7.5 seconds\r\nWhile empowered, Every 5th attack activates Empowered Wrath of Blood:\r\nDeals (1.25 X MAIN STAT X 40) magic splash damage\r\nHeals user for ((MAIN STAT X 90%) + 4500) HP\r\nHeals nearby allies for ((MAIN STAT X 45%) + 2250) HP\r\nBlood Awakening cooldown: 15 seconds, cannot be dropped during cooldown\r\n',
  'Oceanus, the Sword of Light':
    "Passive:\r\nOn skill cast, gain a stack and empower next attack with light (up to a max of 6 stacks)\r\nNon-empowered attacks have ~9% chance to deal (MAIN STAT X (15 + stacks X 4)) magic damage\r\nEmpowered attacks deal (2.5 X MAIN STAT) pure damage and has user's crit chance to crit for 2.5 times the normal amount\r\nEmpowered attacks also heal user for 3% of DMG DEALT (affected by crit damage)\r\nActive:\r\nOn use, activates Trail of Light sending (stacks X 2) daggers to target. Each dagger deals (MAIN STAT X 12.5) magic damage\r\nCooldown: 80 seconds, cannot be dropped during cooldown",
  Oblivion:
    "Passive:\r\n25% Chance to activate Devastation on attack causing enemies within a frontal cone area to take (STR X 80) magic damage\r\nReduces armor by 225 and MAGIC DEF by 2% for 6 seconds\r\nCooldown: 5 seconds\r\nActive:\r\nOn use, activates Oblivion granting the user with 75% ATK SPD, 150 STR, and 1.5% SKILL DMG per 1 ~ 0.5 seconds while draining user's HP\r\nStacks up to 10 times and drains (1500 + seconds elapsed X 500) HP per second\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  "Winter's Heart":
    'Passive:\r\nEvery 8th attack activates Everfrost Blast dealing ((STR X 3) + (AGI X 2)) pure splash damage\r\nDamage is affected by ice/water affinity\r\nCounts as a single target\r\nActive:\r\nOn use, activates Frozen Break that launches a projectile that deals (max MP X 4.5) magic damage and breaking any shields in targetted area\r\nIf projectile hits an ally, gives them a (max HP X 30%) shield for 5 seconds\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  'Meacronacer, the Sword of Thousand Illusions':
    'Passive:\r\n(8 + HIT COUNT X 0.2)% chance to activate Grace Tear on attack\r\nDeals ((MAIN STAT X 30) + (ATK DMG DEALT X 3)) magic splash damage and stuns for 0.1 seconds\r\nActive:\r\nOn use, activates Grand Forte\r\nSlams the ground 6 times around user and deals ((MAIN STAT X 130) / 12) magic damage and stunning for 0.125 seconds on each slam\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  'Tiberius, the Spear of Lightning':
    "Passive:\r\nOn skill cast, gain a stack and empower next attack with lightning (up to a max of 6 stacks)\r\nNon-empowered attacks have a ~12.8% chance to deal (MAIN STAT X ((stacks X 4) + 10)) pure damage\r\nEmpowered attacks deal ((MAIN STAT X 2.5)) pure damage and has user's crit chance to crit for 2.5 times normal amount\r\nEmpowered attacks also heal user for 3% of DMG DEALT (affected by crit damage)\r\nDamage is affected by wind/lightning affinity\r\nActive:\r\nOn use, activates Spear of Deity sending (stacks X 2) spears to target. Each spear deals (MAIN STAT X 12.5) magic damage and stuns for 0.125 seconds\r\nCooldown: 80 seconds, cannot be dropped during cooldown",
  'Blazing Heart':
    'Passive:\r\nOn skill cast, gain a stack and activate Burning Fervor giving user +500 STR and 100% MOV and ATK SPD (up to a max of 5 stacks)\r\nEach stack grants user with +100 STR and +1500 damage. Stat increase lasts for 9 seconds\r\nFirst stack can only be gained by casting, every stack after is gained on attack\r\nWhile Burning Fervor is active, has a ~20.8% chance to gain another stack and deal ((((stack X 30%) + 1.5) X base ATK DMG) + (STR X 15)) magic damage on attack\r\nDamage is affected by flame affinity\r\nBurning Fervor cooldown: 15 seconds, cannot be dropped during cooldown\r\n',
  Ruinbringer:
    "Passive:\r\nOn skill cast, gains a stack and activate Ruin, increasing user's damage by 1500, STR and INT by 75, and SKILL DMG by 1% for each stack up to a max of 10 stacks\r\nLasts for 5 seconds\r\nActive:\r\nOn use, activates Ruinbringer dealing (((STR X 40) + (INT X 80)) + (max HP X 7.5%)) magic splash damage and stuns for 1 second\r\nAlso grants the user max stacks, increasing stats accordingly\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  'Benziena, the Earthen Soul':
    'Active:\r\nOn use, activates Twisting Earth\r\nHeals allies for (7.5% max HP) per 0.5 seconds in the targetted area for 10 seconds (450 radius)\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  'Bloody Hatred':
    'Passive:\r\nTemporarily increase INT by 150, flame affinity by 2% on casting skill for 6 seconds (Stacks up to 5 times)\r\nActive:\r\nOn use, activates Eye of Hatred\r\nEvery 0.125 seconds sends a projectile dealing (INT X 12.5) magic damage and stun for 0.5 seconds for a total of 16 projectiles\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  'Staff of Abyss':
    'Passive:\r\nOn skill cast, empowers nearby allies with +10% SKILL DMG and +250 HP regen for 8 seconds\r\n',
  'Staff of Domination':
    "Passive:\r\nINT increased by 100 per 1 nearby self-owned summon\r\nActive:\r\n'Summon Watcher' (has an HP Regen of 4000 HP/S)",
  'Hell Riser':
    "Passive:\r\n'Source of Death' On skill cast gives 375 Int and 10,000 Damage for 4 seconds (12 second CD)\r\nActive:\r\n'Song of Despair' Do 15x ATK DMG + 75x Int damage and lowers Magic Resistance of enemies by 6% for 8 seconds in an AoE",
  'Triple Snow':
    'Passive:\r\nOn skill cast, empowers next attack\r\nDeals (INT X 20) magic damage and slows target\r\nActive:\r\nOn use, activates Glacial Storm\r\nFreezes enemies in targetted area for 4 seconds\r\nDeals ((water affinity X 100 / (INT X 56)) X 8) magic damage over duration\r\nCauses enemies to take (INT X 2) pure damage when they are attacked by you or your allies\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  'Benziena, the Earthen Heart':
    'Passive:\r\nOn skill cast, activates Restoration\r\nApplies to self and a nearby hero with the lowest HP\r\nHeals (10000 + INT) HP and reduces DMG TAKEN by 12% for 9 seconds\r\nCooldown: 3 seconds\r\nActive:\r\nOn use, activates Warping Earth\r\nHeals allies for (7.5% max HP) per 0.5 seconds in targetted area for 10 seconds (450 radius)\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  Heartseeker:
    'Passive:\r\nEmpowers next attack with Corrupt Arrow every 6 seconds\r\nCorrupt Arrow deals (AGI X 120) magic damage to target and (AGI X 80) magic damage to enemies around the target\r\nAlso it heals user for 15% max HP\r\nCooldown: 20 seconds, cannot be dropped during cooldown\r\n',
  Soulstalker:
    'Passive:\r\n10% Chance to activate Soul Reaping on attack dealing (MAIN STAT X 50) magic damage\r\n',
  Hellflame:
    'Passive:\r\n15% Chance to activate Hellflame on attack that burns the target\r\nDeals (AGI X 15) magic damage per second for 10 seconds\r\nIncrease magic DMG TAKEN of target by 2% for 5 seconds\r\n',
  Everfrostbane:
    "Passive:\r\nHit enemies with an icicle on every attack (1.5-2x Agi Damage [Damage is variable])\r\n'Ice Cyclone' 8% chance to activate on attack dealing AoE Damage (40-60x Agi Damage [Damage is variable] 9 second CD)\r\n",
  'Crimson Star':
    'Passive:\r\nEmpowers allies upon healing them with 7.5% SKILL DMG and Healing Received.\r\nActive:\r\nOn use, activates Bloody Baptism.\r\nThrows 3 waves of blood to target area, each dealing INT X 20 damage and heals INT X 1.5 HP per second for 2 seconds\r\nCooldown: 12 seconds, cannot be dropped during cooldown',
  'Death Visage':
    'Active:\r\nOn use, activates Death Vengeance\r\nIf HP is below 40%, increases MAIN STAT by 450 for 8 seconds, heals 40% max HP and stuns nearby enemies for 1 second\r\nIf HP is above 40%, increases MAIN STAT by 350 for 8 seconds\r\nRegardless of HP percentage, increases CRIT MULT by 0.10 for 8 seconds\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  'Grim Visage':
    'Active:\r\nOn use, activates Grim Vengeance\r\nIf HP is below 40%, increases MAIN STAT by 600 for 8 seconds, heals 70% max HP, deals (MAIN STAT X 75) magic damage and stuns nearby enemies for 1.5 seconds\r\nIf HP is above 40%, increases MAIN STAT by 450 for 8 seconds\r\nRegardless of HP percentage, increases CRIT MULT by 0.20 for 8 seconds\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  'Hood of Reaper':
    "Passive:\r\n'Possession' Triggers when Health is low healing you and giving Int for a brief period (20 second CD)\r\n",
  'True Dragon Helm Agron': 'Active:\r\nAnti-Magic Shield (self) (300 second CD)',
  'Hood of Grim Reaper':
    "Passive:\r\n'Possession' Triggers when Health is low healing you and giving 750 Int for a brief period (20 second CD)\r\nActive:\r\nTurn invisible temporarily",
  'Helm of Battle':
    "Passive:\r\nDamage dealt by attack +10%\r\nIncreases nearby allies' speed and HP regen\r\nActive:\r\nBlock magic every 4 minutes\r\nLasts 5 seconds",
  'Horns of Destruction':
    'Active:\r\nOn use, discharges a powerful beam of destruction dealing (MAIN STAT X 100) magic damage\r\nReduces armor of hit targets by 200 (Type-A)\r\nStuns for 1 second\r\nCooldown: 150 seconds, cannot be dropped during cooldown',
  'Archangel Halo':
    'Passive:\r\nDamage dealt by attack +12.5%\r\nActive:\r\nBlock magic every 3 minutes\r\nLasts 5 seconds',
  'Prophetia, the Source of Mana':
    'Active:\r\nTemporarily increases INT by 750 and max MP by 5000 on use for 8 seconds',
  'Void Eye':
    'Passive:\r\nIncreases nearby allies SKILL DMG by 4%\r\nActive:\r\nSummons 6 flying hell minions',
  'Horn of Devil':
    "Passive:\r\nUpon moving 3000 distance, unlesash Devil's Flame on next attack\r\nDeals (MAIN STAT X 20) pure damage\r\nCooldown: 5 seconds, cannot be dropped during cooldown\r\n",
  'Horn of Lightning God':
    "Passive:\r\nUpon moving 3000 distance, unleash Lightning God's Wrath on next attack\r\nDeals (MAIN STAT X 25) pure damage\r\nCooldown: 5 seconds, cannot be dropped during cooldown\r\n",
  'Dragon Mask':
    'Active:\r\nOn use, activates Madness of Dragon for 15 seconds:\r\nInitially increases MAIN STAT by 600, crit multiplier by 0.20, and HP regen by 2000\r\nWhile active, every skill cast increases the bonuses above by 10% up to 10 times\r\nCooldown: 50 seconds, cannot be dropped during cooldown',
  'Eye of Wallachia':
    'Passive:\r\n25% chance to activate Eye of Death on attack\r\nIncreases crit multiplier by 0.20, ATK DMG by 15%, and AGI by 750 1 second after proc for 6 seconds\r\nCooldown: 15 seconds, cannot be dropped during cooldown\r\n',
  "Protector's Will":
    'Passive:\r\n25% chance to restore 5% HP and 10% MP on taking damage\r\nCooldown: 3 seconds, cannot be dropped during cooldown\r\nActive:\r\nIncrease nearby allies Magic Resistance by 40% for 12 seconds\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  'Halo of Judgment':
    'Passive:\r\nDMG DEALT by attack +15%\r\nOn attack, activates Judgment\r\nAdds 1 stack every 0.75 seconds with a max stack of 3\r\nConsume 1 stack on attack and deal (MAIN STAT X 3.75) pure damage on attack\r\nActive:\r\nBlock magic every 1 minute and 30 seconds\r\nLasts 5 seconds',
  'Prophetia, the Greater Source of Mana':
    'Active:\r\nTemporarily increases INT by 1000 and SKILL DMG by 5% on use for 8 seconds',
  'Hood of Apocrypha':
    'Active:\r\nOn use, activates Apocryphos and turns the user invisible for 3 seconds\r\nHeals self for 40% max HP and allies for (INT X 15% max HP)\r\nStuns nearby enemies for 0.5 seconds\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  'Crown of Serenity':
    'Passive:\r\nUpon healing an ally, 15% chance to activate Serenity\r\nGrants 5% SKILL DMG and heals (2% max HP of target + INT X 0.125) HP and (1% max MP) every 0.5 seconds for 5 seconds\r\n',
  'Crown of Rage':
    'Active:\r\nOn use, activates Refined Power\r\nConsumes 40% of current HP and grants the following for 15 seconds:\r\n(1.25% of consumed HP) all stats\r\n(2 X (1.25% of consumed HP)) MAIN STAT\r\n5% flame affinity\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  'Crown of Composure':
    'Active:\r\nOn use, activates Composure\r\nIncreases SKILL DMG by 7.5% and all stats by 375 for 12 seconds\r\n20% chance to freeze nearby enemies for 12 seconds\r\nCooldown: 100 seconds, cannot be dropped during cooldown',
  'Infected Crab Armor':
    'Passive:\r\n10% chance to reflect (STR X 5) Pure Damage and 90% chance to return (STR X 0.5) Pure Damage\r\nImproved HP regen\r\n',
  'Precious Wind-Protection Clothing': 'Passive:\r\nDodge a fatal attack once every 45 seconds\r\n',
  'Bloodstone Plates':
    "Active:\r\n'Bloodstone Form' Increase Health and Mana Regeneration by 7,500, gain 7.5% MAIN STAT, and get a shield for 4x MAIN STAT for 2 seconds (40 second CD)",
  'True Dragon Armor Magron': 'Passive:\r\nBlock 300 damage every hit\r\n',
  'Reactive Armor':
    'Passive:\r\nReflects damage when hit\r\nReleases a powerful blast upon taking enough damage\r\n',
  'Robe of the Sage':
    'Passive:\r\nImproved MP regen\r\nActive:\r\nAnti-Magic Shield (self) (4 min CD)',
  'True Bloodstone Plates':
    "Passive:\r\nBlock 250 Damage every hit\r\nActive:\r\n'Bloodstone Form' Increase Health and Mana Regeneration by 7,500, gain 7.5% MAIN STAT, and get a shield for 4x MAIN STAT for 2 seconds (40 second CD)",
  'Purelight Armor': "Passive:\r\nIncreases nearby allies' stats by 5% (Self not included)\r\n",
  'Cruoris, the Armor of Blood':
    'Passive:\r\nIncreases max HP in combat\r\nStores 1% of DMG DEALT, max of AGI X 2\r\nActive:\r\nReleases the blood stored within Cruoris on use\r\nDeals (stored HP X 30) magic damage to nearby enemies\r\nAlso increases AGI by 15% for 12 seconds (max of 1000 AGI)\r\nCooldown: 150 seconds, cannot be dropped during cooldown',
  'Earthen Plates':
    'Passive:\r\nGrants greatly accelerated Health Regeneration when Health is low\r\n',
  'Guardian Vest': 'Passive:\r\nCreates a barrier that absorbs 5000 damage every 8 seconds\r\n',
  'Fairy Garment': 'Active:\r\nSummons a Fairy Spirit',
  'Frozen Robe': "Active:\r\n'Frozen Protection' Absorbs up to (6 X Int) damage (75 second CD)",
  'Requiem, the Armor of Lamentation':
    "Passive:\r\nIncreases nearby allies' stats by 5% (Including self)\r\nEvery 8 seconds, activates one of Hatred, Oblivion and Obsession buffs\r\n",
  'Creation of the Sky and Earth':
    'Active:\r\nOn use, activates La Pucelle\r\nGrants all nearby allies with 100% MAGIC DEF for 4 seconds\r\nHeals user for 25% HP per second\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  'Tunic of the Wraith':
    'Passive:\r\nActivates when HP drops below 15%\r\nReduces DMG TAKEN by 90% for 3 seconds and instantly heal for 25% max HP\r\nCooldown: 60 seconds, cannot be dropped during cooldown\r\n',
  'Benedict, the Crimson Armor of Blood':
    'Passive:\r\nIncreases max HP in combat by 1%\r\nUp to AGI X 2 max HP and provides 1.5% HP regen\r\nActive:\r\nOn use, activates Force Break\r\nReleases stored HP and deals (stored HP X 20) pure damage to enemies around user\r\nIncreases AGI by 15% and SKILL DMG by 5% for 12 seconds\r\nStuns for 1.5 seconds\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  'Grandine, the Plates of Wraith':
    'Passive:\r\nActivates Grandine when HP drops below 20%\r\nGain 90% damage reduction for 3 seconds and instantly heal for 35% max HP\r\nFor the next 3 seconds, heal 6% max HP per second\r\nCooldown: 60 seconds, cannot be dropped during cooldown\r\n',
  'Hellspike Armor':
    "Passive:\r\n'Hellspike' Reflect 100% of your Max HP as pure damage when hit to all enemies within 200 range (3 second CD)\r\n'Hellspike Eruption' As you take more damage the armor will charge until you've received 125% Max Health total damage. Upon reaching full charge all nearby enemies will receive (3000% your Max HP) in damage and be stunned for 1 seconds. You can accumulate up to 50% charge in a single attack. (5 second CD)\r\nActive:\r\n'Hellspike' Deal 20% of your Max HP to yourself and 100% of Max Health as pure damage to nearby enemies . (3 second CD)",
  'Bloodsoul Plates':
    "Active:\r\n'Blood Armor' Absorb up to (10,000 + Max Health x 20%) Damage over next 5 seconds. When damage is absorbed does 100x MAIN STAT to enemy, heals 20% Max Health and heals mana equal to absorbed damage. (20 second CD)",
  'Frostshard Armor':
    'Passive:\r\nActivates Frostshard when HP drops below 40%\r\nGrants 10% STR, 7.5% damage reduction for 12 seconds and restores 17.5% max HP\r\nDeals (STR X 40) magic damage around user in a 325 radius (damage is affected by water affinity)\r\nReduces MOV and ATK SPD of affected enemies by 75% for 2 seconds\r\nCooldown: 8 seconds, cannot be dropped during cooldown\r\n',
  "Druid's Mantle":
    'Passive:\r\nSummons a forest spirit every 5 seconds, each spirit provides 0.75% hp regeneration, can have up to 4 spirits\r\nActive:\r\nOn use, sends one spirit towards target\r\nIf target is enemy it deals 40 X int damage\r\nIf target is ally it restores 2.5 X int hp\r\nCannot target self, activates single-target effects',
  'Robe of the Necromancer':
    "Active:\r\nOn use, summons Magic Barrier granting the user with magic immunity\r\nAlso increases nearby allies' magic defense by 40% for 5 seconds (225 radius)\r\nCooldown: 120 seconds, cannot be dropped during cooldown",
  'Winter Robe':
    'Active:\r\nOn use, activates Everfrost Soul\r\nForms a shield that blocks damage equal to (INT X 8) for 8 seconds\r\nConstantly rains frostbolts around user in a 350 radius\r\nEach frostbolt deals (INT X 10) magic damage and stuns non-boss mobs for 1s\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  'Diana, the Robe of Holy Maiden':
    'Passive:\r\nIncreases nearby allies SKILL DMG by 6% & MAGIC DEF by 8%\r\nActive:\r\nOn use, activates Prayer of Holy Maiden\r\n7 spiral waves shoot outwards from the user while immobilizing the user (can use dash spells)\r\nRestores (INT X 1.5) HP to all nearby allies per wave\r\nDeals (INT X 25) magic damage to all nearby enemies for 6 waves\r\n7th wave deals (INT X 50) magic damage\r\nApplies a shield of (15000 + INT X 5) to user for 4.2 seconds\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  'Medea, the Robe of the Witch':
    "Passive:\r\nOn skill cast gives an orb. Each orb increases INT by 100 and 1% SD. 50% chance to get 2 orbs on skill cast instead of one. (Max 4 orbs)\r\nActive:\r\n'Witch Time' Increase Int by 500 and 6% SKILL DMG. Gain 1 orb every second and passive can trigger more orbs. During buff, each skill cast will consume all current orbs to deal 25x Int damage per orb in an AoE centered on nearest boss (if no boss, nearest enemy), lasts 6 seconds. (90 second CD)",
  'Fruit Candy Pouch':
    'Active:\r\nOn use, throws out 5 random candies which rapidly heal the user over 4 seconds\r\nGrape Flavored Candy: Increases INT by (LVL / 2 + 50)\r\nBlueberry Flavored Candy: Increases AGI by (LVL / 2 + 50)\r\nApple Flavored Candy: Increases STR by (LVL / 2 + 50)\r\nDuration: 15 minutes, cooldown: 120 seconds\r\nCooldown of pouch: 180 seconds, cannot be dropped during cooldown',
  'Tentacle Horn':
    'Active:\r\nSpawns tentacles around the caster throwing units into the air, stunning them and healing the caster',
  'Teperua, the Ring of Blood': 'Active:\r\nRestore health in a nearby AoE (60 second CD)',
  'Ring of Light': "Passive:\r\n'Holy Wings' Increase nearby allies armor by 200\r\n",
  'Ring of the Sage':
    'Active:\r\nResets the last ability cast, and gain increased Mana Regeneration for 18 seconds (Does not apply to ultimate skill or items) (135 second CD)',
  'Mana Heart Frost': 'Passive:\r\nImproved MP regen\r\nFrost effect on attack\r\n',
  'Ring of the Reaper': 'Active:\r\nConverts DMG TAKEN into Health for 2 seconds',
  'Purefrost Gauntlet': 'Passive:\r\nApplies Frost effect on attack\r\n',
  'Living Dragon Heart':
    "Passive:\r\nIncrease nearby allies' MOV SPD and gives them +150 Health Regeneration\r\nActive:\r\nInflicts INT X 30 damage to enemies in 600 AoE, and summons a dragon (150 second CD)",
  'Ring of Holy Light':
    "Passive:\r\nIncreases nearby allies' Armor by 200 and HP by 3000\r\nOn skill cast, gathers Holy Light\r\nStacks for a max of 5\r\nLasts for 8 seconds\r\nActive:\r\nOn use, releases Holy Light and heals all allies in a 600 radius\r\nHeals (0.20 X (STR + AGI + INT) X stacks) HP\r\nCooldown: 10 seconds",
  "Demonis, the Devil Lord's Ring": 'Passive:\r\nIncrease nearby allies Armor by 300\r\n',
  'Soul Drinker': 'Active:\r\nDMG DEALT in the next 6 seconds is partially converted into Health',
  'Latea, the Ring of Chaos':
    "Passive:\r\nDecreases nearby enemies' armor by 75\r\n'Absolute Protection' Chance to activate when hit blocking all damage received from that attack\r\n",
  'Ring of Intrusion':
    'Active:\r\nResets the last ability cast (Does not apply to ultimate skill or items) and gives you 1200 mana regeneration for 10 seconds. (105 seconds CD)',
  'Heart of Ifrit':
    'Passive:\r\n12% chance to reduce enemy armor by 225 on attack for 5 seconds\r\n',
  'Trueblood Ring': 'Active:\r\nHeals for 30% of Max Health',
  'Azathos, the Pipe of Chaos':
    "Passive:\r\nIncreases nearby allies' stats\r\nATK SPD by 10%\r\nATK DMG by 4000\r\nHP regen by 200\r\n",
  'Eternal Rose':
    'Passive:\r\nIncrease nearby allies Magical Resistance by 8% (Aura Range 1,200)\r\nActive:\r\nShields nearby allies for (5x Int + 20% Health) damage for 5 seconds. (60 second CD)',
  'Bell of Light':
    "Passive:\r\nIncreases nearby allies' armor by 300 and HP by 5000\r\nOn skill cast, gathers Holy Light up to 5 times.\r\nStacks last for 8 seconds\r\nActive:\r\nOn use, releases Holy Light\r\nHeals all allies within 600 radius for (stacks X 0.30 X (STR + AGI + INT)) HP\r\nCooldown: 10 seconds",
  'Ring of Strike':
    'Passive:\r\n7.5% Chance to activate Absolute Strike on attack\r\nNext 3 hits will deal an additional (ATK DMG X 2) pure damage\r\nAlso gain 20000 ATK DMG, 1000 MAIN STAT, and 1000 HP regen for 7.5 seconds\r\nAbsolute Strike cooldown: 15 seconds, cannot be dropped during cooldown\r\n',
  'Ring of Time':
    "Passive:\r\nIf HP drops below 1, Heals HP x 40%, then deals the damage that procc'd the effect (CD: 300 Seconds)\r\nIf hero dies immediately after passive is procc'd, cooldown does not start.\r\nActive:\r\n'Time Distortion' Resets the last ability cast (Does not apply to ultimate skill or items) and makes you immune to stuns, silence and knockback for 10 seconds, also regenerate 1500 Mana each second while duration (90 seconds CD)",
  'Ispion, the Runed Ring':
    "Passive:\r\nIncreases nearby allies' damage reduction by 6%, healing received by 12%\r\nActive:\r\nOn use, activates Rune Field, placing a 500 radius field around the user that restores 10% max HP per 0.5 seconds of all allies on the field for 5 seconds\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  'Cold Ring of Death':
    'Active:\r\nOn use, activate Darkness Ray\r\nAbsorbs all DMG TAKEN for 3 seconds and unleashes it around user\r\nDeals (absorbed DMG + ATK DMG X 5) magic damage\r\nCannot exceed 1 million damage\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  'Seal of Deceiver':
    'Passive:\r\nConverts 0.5% of dealt damage into max HP and MP with a cap of (base STR X 1.5) for HP and (base INT X 1.5) for MP\r\nLasts 6 seconds after the last time you deal damage\r\nActive:\r\nOn use, activates Dark Light, consuming all stored HP and MP\r\nEvery second for 5 seconds, deals ((12 X stored HP) + (20 X stored MP)) magic damage in a 500 radius around user\r\nReduces MOV SPD and ATK DMG by 50% and silences on affected enemies for 1.5 seconds\r\nOn the last second, deals a final damage of ((60 X stored HP) + (100 X stored MP)) magic damage in a 500 radius around user and stuns for 1 second\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  "Heaven's Fist":
    "Passive:\r\nEmpowers next attack with Holy Fist every 6 seconds\r\nDeals 3 additional attacks with 200% damage\r\nReduces target's armor by 225 for 3 seconds\r\n",
  'Wing of Sea':
    "Passive:\r\n'Revelation' Chance to temporarily increase Experience Gain and Mana Regeneration on kill\r\nActive:\r\nTeleport you to Alfon Village (first town)",
  'Dragon Wings': 'Active:\r\nCreates a portal between Capitol Prius and your current location',
  'Cape of the Count':
    'Passive:\r\nWhen casting a spell, empower next attack with darkness (5000 + 2 X MAIN STAT) damage\r\n',
  'Hungry Bat Wings':
    'Passive:\r\nUpon moving 400 distance, activates Hungry Drain on next attack\r\nDeals bonus (40% ATK DMG) pure damage and heals for 8% HP\r\nGives 150 HP regen on every proc up to 5 times for 2.5 seconds\r\ncooldown: 0.125 seconds\r\n',
  'Cape of Corrupt Flame':
    'Passive:\r\nSingle-target skill hits engulf target in corrupt flames\r\nDeals 10% additional damage over 3 seconds (effect stacks)\r\n',
  'Frozen Heart': 'Passive:\r\nSlows nearby enemies\r\n',
  'Fairy Wings': 'Active:\r\nCreates a portal between Capitol Prius and your current location',
  'Wings of Fury':
    'Passive:\r\nWhen casting a spell, empower next attack with Fury\r\nDeals ((MAIN STAT X 2.5) + AGI) pure damage\r\nEmpowered attacks have a 12.5% chance to crit, dealing ((MAIN STAT X 5) + (AGI X 2)) pure damage\r\nEach stack, up to 10, increases AGI by 60 for 7 seconds\r\n',
  "Wanderer's Cape": 'Active:\r\nCreates a portal between Capitol Prius and your current location',
  'Frost Fairy Wings':
    'Active:\r\nOn use, creates a Magical Passage, connecting your current location to Capital Prius',
  'Pure Crystal Wings':
    'Passive:\r\nOn skill cast, 5% chance to reset all cooldowns (except ultimate), effect triggers 2 seconds after the skill that initiates it (150 second CD)\r\n',
  'Wings of Phoenix':
    'Active:\r\nOn use, activates Flame Flight\r\nDeals (ATK DMG X 5 + MAIN STAT X 75) magic damage to enemies in targeted area\r\nStuns for 0.5 seconds\r\nMax dash distance of 900\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  'Soul Eater':
    'Passive:\r\nPeriodically absorbs nearby souls\r\nAbsorbs 3 souls every 5 seconds that heal you for 2.5% HP and 3% MP each (for a total of 7.5% HP and 9% MP)\r\nActive:\r\nOn use, activates Soul Absorb\r\nHeals user for (30% max HP)\r\nCooldown: 40 seconds, cannot be dropped during cooldown',
  'Soul of the Dead':
    'Passive:\r\nResurrect upon death with 40% Health and 100% Mana (180 second CD)\r\nRespawn time reduced by 40%\r\nOn death, deals 275x MAIN STAT to nearby enemies\r\n',
  'Cloak of the Fallen Shadows':
    'Passive:\r\nOn single-target hits, engulfs target with Corruption\r\nDeals 12.5% additional damage over 3 seconds (effect stacks)\r\nReduces MAGIC DEF of targets by 4%\r\n',
  'Grim Heart':
    "Passive:\r\nReduces MOV and ATK SPD by 20% of nearby enemies\r\nActive:\r\nOn use, activates Grim Howl\r\nHeals 33% of user's max HP and stuns nearby enemies for 1 second\r\nDecreases target's ATK DMG by 25% for 8 seconds\r\nCooldown: 40 seconds, cannot be dropped during cooldown",
  'Wings of Slayer':
    "Passive:\r\nOn skill cast, empowers next attack with Decimation\r\nNext attack deals (MAIN STAT X 1.5 + AGI X 1) pure damage\r\nCan crit based on user's critical chance\r\nEmpowered attack stacks Madness of Slayer\r\nFor 6 seconds increases AGI by 90 (stacks up to 10 times)\r\nOnce max stacks is reached, user can no longer gain more for duration but gains 10% SKILL DMG\r\n",
  'Rusty Pickaxe':
    'Active:\r\nSwings axe to mine ores.\r\nFor 5 minutes, mines 1 ores per 1 second\r\nAvailable ores: Iron Ore, Silver Ore, Gold Ore',
  'Sturdy Pickaxe':
    'Active:\r\nSwings axe to mine ores.\r\nFor 5 minutes, mines 2 ores per 1 second\r\nAvailable ores: Iron Ore, Silver Ore, Gold Ore',
  'Rusty Magical Pickaxe':
    'Active:\r\nSwings axe to mine ores.\r\nFor 5 minutes, mines 1 ores per 1 second\r\nAvailable ores: Worthless Magical Stone, Lesser Magical Stone, Medium Magical Stone, Greater Magical Stone',
  'Sturdy Magic Pickaxe':
    'Active:\r\nSwings axe to mine magical stones.\r\nFor 5 minutes, mines 2 ores per 1 second\r\nAvailable ores: Worthless Magical Stone, Lesser Magical Stone, Medium Magical Stone, Greater Magical Stone',
  'Mithril Pickaxe':
    'Active:\r\nQuickly Swings axe to mine ores.\r\nFor 1 second, mines 10 ores per 0.1 seconds\r\nAvailable ores: Iron Ore, Silver Ore, Gold Ore',
  'Abyssal Pickaxe':
    'Active:\r\nQuickly Swings axe to mine magical stones.\r\nFor 1 second, mines 10 ores per 0.1 seconds\r\nAvailable ores: Worthless Magical Stone, Lesser Magical Stone, Medium Magical Stone, Greater Magical Stone',
  'Chaos Pickaxe':
    'Active:\r\nQuickly Swings axe to mine chaos stones.\r\nFor 1 second, mines 10 ores per 0.1 seconds (1 ore for Chaos Magic Stones)\r\nAvailable ores: Worthless Magical Stone, Lesser Magical Stone, Medium Magical Stone, Greater Magical Stone, Chaos Magic Stone',
  'Ring of Fervor':
    "Passive:\r\nCasting single-target spells on ally applies Fervor\r\nIncreases target's damage by 5% and MAIN STAT by 300 for 12 seconds\r\nActive:\r\nOn use, activates Joy\r\nRestores 40% HP of allies affected by Fervor\r\nCooldown: 30 seconds, cannot be dropped during cooldown",
  'Ring of Composure':
    'Passive:\r\nCasting single-target spells on enemies decreases their magic resistance by 6% (Type-B) for 12 seconds\r\nActive:\r\nDeals water affinity X (0.75% Max HP) pure damage to debuffed enemy and freezes them for 2 seconds\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  'Plates of Lightning':
    'Passive:\r\nAfter casting a spell, emits lightning waves around you for 3 seconds, dealing 20 X (STR + AGI) damage to nearby enemies and restoring 2.5% Max HP per second (6s CD)\r\n',
  'Maw of Greed':
    'Passive:\r\n20% chance to activate Devour on attack\r\nCauses your attack to splash in a 375 radius and restore 2500 hp\r\nActive:\r\nOn use, activates Decimation\r\nPulls in all enemies from 300 ~ 800 radius around you, deals (ATK DMG X 40) magic damage and stuns for 2 seconds\r\nCooldown: 60 seconds, cannot be dropped during cooldown',
  'Ring of Deep Darkness':
    'Active:\r\nConsumes 50% of max MP and for 8s grants (mana consumed/80) MAIN STAT and 30% ATK SPD (30s cd)',
  'Grimoire of Darkness':
    'Active:\r\nConsumes 50% of Max Mana and for 10s grants (mana consumed/60) MAIN STAT and 50% ATK SPD (30s cd)',
  'Vest of Cyclone':
    'Passive:\r\nOn skill cast, activates Wind Fury for 1.5 seconds\r\nNext 2 attacks hit once to deal bonus 50% ATK DMG\r\nIncreases MOV SPD by 300\r\nBonus MOV SPD decreases by half over buff duration\r\n',
  'Vest of Storm':
    'Passive:\r\nOn skill cast, activates Wind Fury for 1.5 seconds\r\nNext 3 attacks hit once more and deal 50% ATK DMG\r\nIncreases MOV SPD by 300\r\nBonus MOV SPD decreases by half over buff duration\r\n',
  'Ring of Revival':
    'Passive:\r\nOn death, revives after 2 seconds with full HP and MP\r\nCooldown: 240 seconds, cannot be dropped during cooldown\r\nActive:\r\nOn use, activates Revival\r\nRestores 50% of HP and MP/RP\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  'Ring of Insanity':
    'Passive:\r\n12.5% Chance to activate Frenzy on attack\r\nNext 3 hits will deal an additional (ATK DMG X 2) pure damage\r\nAlso gain 25000 ATK DMG, 1250 MAIN STAT and HP regen for 7.5 seconds\r\nFrenzy cooldown: 15 seconds, cannot be dropped during cooldown\r\n',
  'Latea, the Ring of Overlord':
    "Passive:\r\n20% chance of 20% additional damage\r\n'Absolute Protection' Chance to activate when hit blocking all damage received from that attack\r\n",
  'Horn of God':
    "Passive:\r\nEmpowers nearby allies\r\nIncreases ATK DMG by (INT X 0.6). Max of 6000\r\nIncreases ATK SPD by 15%\r\nHP regen by 400\r\nActive:\r\nOn use, activates Purification\r\nFor 3 seconds, prevents HP from dropping below 1\r\nHeals (0.10 X target's max HP) and removes any debuffs each second for duration\r\nCooldown: 20 seconds, cannot be dropped during cooldown",
  'Ring of Fate':
    'Passive:\r\nIf HP drops below 1, activates Time Reversal, restoring HP to 100%\r\nCooldown: 300 seconds\r\nActive:\r\nOn use, activates Time Distortion, resetting the cooldown of the last non-ultimate spell used\r\nAlso increases MP regen by 2500 and provides immunity to stuns, silences, and knockbacks for 10 seconds\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  'Ring of Hope':
    "Passive:\r\nCasting single-target spells on ally applies Passion\r\nIncreases target's damage by 6% and MAIN STAT by 400 for 12 seconds\r\nActive:\r\nOn use, activates Hope\r\nCleanses debuffs from allies and restores 50% max HP of allies affected by Passion\r\nCooldown: 30 seconds, cannot be dropped during cooldown",
  'Ring of Despair':
    "Passive:\r\nCasting single-target spells on enemies decreases their magic resistance by 7.5% (Type-B) for 12 seconds\r\nActive:\r\nDeals water affinity X (1% Max HP) pure damage to debuffed enemy, freezes for 3 seconds, and increases allies' DMG DEALT to it by 5% for 2 seconds\r\nCooldown: 30 seconds, cannot be dropped during cooldown",
  'Nebula Rose':
    'Passive:\r\nIncrease nearby allies Magical Resistance by 10%\r\nAura range: 1200\r\nActive:\r\nActivates Cosmic Protection, which provides ((INT X 5) + (Max HP X 0.2)) shield to nearby allies for 5 seconds\r\nTargets taking spell damage during shield will gain 4% damage output and 12% damage resistance for 30 seconds\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  'Ring of Divine Winds':
    'Passive:\r\nOn attack, 15% chance to activate Double Attack\r\nOn spellcast, 15% chance to refresh cooldown of that spell\r\nOn casting a stack-based spell, 8% chance to refresh cooldown of that spell\r\nActive:\r\nOn use, teleports user to target location\r\nMax distance: 1200\r\nCooldown: 25 seconds, cannot be dropped during cooldown',
  'Demonic Fist':
    "Passive:\r\nEvery 5 seconds, empowers next attack with Demon's Grasp:\r\nNext attack hits 5 extra times with 150% ATK DMG each\r\nReduces target's armor by 300 for 3 seconds (Type-A)\r\nHeals user for 7.5% max HP\r\nOnly works on melee attacks\r\nActive:\r\nOn use, empowers next attack with Demon's Grasp\r\nCooldown: 10 seconds, cannot be dropped during cooldown",
  'Ring of Frozen Soul':
    'Active:\r\nOn use, activates Frozen Aegis\r\nProvides immunity to damage and debuffs for 3 seconds\r\nUpon expiration, deals (1000% damage received) pure damage to nearby enemies (max of 1000% max HP)\r\nCooldown: 60 seconds, cannot be dropped during cooldown',
  'Mark of Sin':
    'Active:\r\nOn use, activates Forbidden Magic\r\nConsumes 50% max MP\r\nIncreases MAIN STAT by (MP consumed / 60) and ATK SPD by 50% for 10 seconds\r\nConsumes 1 Evil Magic stack per second and deals (INT X 25) magic damage to nearby enemies\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  'Seed of Malice':
    'Passive:\r\nLanding a spell generates Seed of Malice nearby\r\nAbsorbs when approached, it restores 4000 HP and 10000 MP and adds stack of Evil Magic for 10 seconds\r\nEvil Magic increases damage output by 2% per stack and stacks up to 5 times\r\nCan be generated during Forbidden Magic\r\nCooldown: 4 seconds\r\nActive:\r\nOn use, activates Forbidden Magic\r\nConsumes 50% max MP\r\nIncreases MAIN STAT by (MP consumed / 60) and ATK SPD by 60% for 10 seconds\r\nConsumes 1 Evil Magic stack per second and deals (INT X 50) magic damage to nearby enemies\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  'Ring of the One':
    'Passive:\r\nOn attack, 20% chance of 25% additional damage\r\nOn skill cast, 15% chance to increase DMG DEALT by 5% for 5 seconds\r\nOn being hit, 10% Chance to activate Absolute Defense blocking all damage to user\r\n',
  'Eye of the Flame Lord':
    'Passive:\r\nIncreases nearby allies SKILL DMG and ATK DMG by 5%\r\nActive:\r\nSummons 2 Flame Giants\r\nFlame Giant MAGIC DEF: 50%',
  'Hood of Apocalypse':
    'Active:\r\nOn use, activates Apocalypse dealing (MAIN STAT X 250) magic damage to nearby enemies\r\nInstantly restores 30% HP of nearby allies and grants them 10% HP regen for 3 seconds\r\nStuns nearby enemies for 1.5 seconds and silences for 3 seconds\r\nAlso lowers affected enemies MOV and ATK SPD by 50% for 3 seconds\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  'Prophetia, the Origin of Knowledge':
    'Passive:\r\nOn spell cast, 7.5% chance to activate Enlightment\r\nRefreshes cooldown of a random spell\r\nActive:\r\nOn use, activates Magical Concentration\r\nIncreases INT by 1250 and SKILL DMG by 5% for 8 seconds\r\nIncreases INT by 100 and SKILL DMG by 0.5% every second\r\nCooldown: 60 seconds, cannot be dropped during cooldown',
  'Mask of Demigod':
    'Active:\r\nOn use, activates Demigod Infusion\r\nIncreases AGI by 800, critical damage by 0.25 and HP regen by 2000 for 15 seconds\r\nCasting a spell empowers these buffs by 10% (up to 100%)\r\nUsing the [M] hotkey lets you teleport up to 800 distance up to 3 times\r\nCooldown: 40 seconds, cannot be dropped during cooldown',
  'Eye of the Reaper':
    'Passive:\r\nOn attack, activates Eye of the Reaper\r\nIncreases ATK DMG by 17.5%, critical damage by 0.25 and AGI by 1000 for 7.5 seconds\r\nCooldown: 15 seconds, cannot be dropped during cooldown\r\n',
  'Radiance of the One':
    'Passive:\r\nDMG DEALT by attack +18%\r\nOn attack, activates Judgment\r\nAdds 1 stack every 0.75 seconds with a max stack of 3\r\nConsume 1 stack on attack to do (MAIN STAT X 5) pure damage on attack\r\nActive:\r\nBlock magic every 1 minute\r\nLasts 5 seconds',
  'Spirit of Protector':
    'Passive:\r\nProvides the user and nearby allies with 1% HP regen and 15% damage resistance for 15 seconds\r\nActive:\r\nOn use, activates Spirit of Protector\r\nFor 12 seconds provides 40% damage resistance to nearby allies\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  'Horn of Demon God':
    "Passive:\r\nWhen moving 3000 distance, your next attack is empowered by Demonic Ray\r\nDeals (MAIN STAT X 30) pure damage in a line in front of user\r\nIncreases user's DMG DEALT to target by 8% for 4 seconds\r\nCooldown: 5 seconds, cannot be dropped during cooldown\r\n",
  'Crown of Great Rage':
    'Active:\r\nOn use, activates Fury\r\nConsumes 40% of current HP\r\nDeals (flame affinity X (MAIN STAT X 150)) magic damage to nearby enemies\r\nIncreases all stats by 1.25% consumed HP (double for MAIN STAT) and flame affinity by 5% for 15 seconds\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  'Crown of Extreme Anger':
    'Active:\r\nOn use, activates Extreme Anger\r\nConsumes 50% of current HP\r\nDeals (flame affinity X (MAIN STAT X 250)) magic damage to nearby enemies\r\nIncreases all stats by 1.25% consumed HP (double for MAIN STAT) and flame affinity by 7.5% for 15 seconds\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  'Crown of Absolute Zero':
    'Active:\r\nOn use, activates Composure\r\nIncreases SKILL DMG by 12.5% and all stats by 500 for 12 seconds\r\nGrants CC immunity for 12 seconds\r\nCooldown: 100 seconds, cannot be dropped during cooldown',
  'Robe of Archlich':
    'Active:\r\nOn use, summons Magic Field granting the user with magic and CC immunity.\r\nAlso provides a 40% magic resistance to allies in a 500 radius around user\r\nRestores 6% HP and 3% MP per second to all affected units\r\nLasts 8 seconds\r\nCooldown: 100 seconds, cannot be dropped during cooldown',
  'Thanatos, the Robe of Hell':
    'Active:\r\nOn use, activates Extinction\r\nProvides 1100 INT for 7 seconds\r\nUpon expiration, send a meteor to every nearby enemy dealing (INT X (20 + number of spells casted (max 20)) X 20) magic damage\r\nStuns targets hit for 1.5 seconds\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  'Jupiter, the Robe of Heavens':
    'Passive:\r\nIncreases nearby allies SKILL DMG by 8% & MAGIC DEF by 10%\r\nActive:\r\nOn use, activates Salvation\r\nHeals nearby allies to full\r\nAfterwards emits a divine light that restores (INT X 2.5) HP to 3 allies with lowest HP and all summons every 0.5 seconds for 6 seconds\r\nAlso deals (INT X 50) magic damage and stuns all nearby enemies for 1 second every second\r\nPrevents HP from dropping below 1 for duration\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  'Hades, the Armor of Despair':
    "Passive:\r\nIncreases nearby allies stats by 6% in 800 AoE(Including self)\r\n'Despair of the Damned' Every 6 seconds deal 20x All Stats magic damage to all nearby enemies and increase the damage they take by 4% for 6 seconds. Heal for 6% Max Health the next time you attack\r\n",
  'Felspike Armor':
    'Passive:\r\nOn absorbing 100% max HP worth of damage, empowers next Hellspike\r\nEmpowered Hellspike deals 5000% max HP around user and stuns for 2 seconds\r\nCan accumulate up to 50% max HP damage from one damage instance\r\nCooldown: 5 seconds before accumulating again\r\nActive:\r\nOn use, activates Hellspike\r\nDeals 2000% max HP to enemies around user and increases ATK DMG by 5000 for 2.5 seconds\r\nCooldown: 7.5 seconds, cannot be dropped during cooldown',
  'Athanasia, the Armor of the Reaper':
    'Passive:\r\nIf HP drops below 20%, summons Reaper\r\nReaper prevents HP from dropping below 1 for 6 seconds\r\nAfter 6 seconds deals (AGI X 50 ~ 125) pure damage based on missing HP of targets around user and restores HP to 100%\r\nCooldown: 60 seconds, cannot be dropped during cooldown\r\n',
  'Nevedium, the Armor of Demonblood':
    'Passive:\r\nOn dealing damage, accumulates Blood\r\nConverts 1% of DMG DEALT into max HP (AGI X 2 max)\r\nWhen fully stacked provides 2% HP regen\r\nActive:\r\nOn use, activates Demon Break\r\nReleases stored HP to deal (stored HP X 30) pure damage to nearby enemies and stuns for 1.5 seconds\r\nIncreases AGI by 20% and damage output by 5% for 12 seconds\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  'Harmony of Sky and Earth':
    'Passive:\r\nNearby allies gain passive 1% HP regen\r\nActive:\r\nOn use, activates Cosmos\r\nProvides 100% MAGIC DEF and debuff immunity to allies within 800 radius for 5 seconds\r\nApplies MAGIC DEF first then cleanses\r\nHeals user for 25% HP per second\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  'Bloodseeker Plates':
    'Passive:\r\nWhen HP drops below 20%, activates Bloodthirst\r\nProvides 7.5% damage output and 3% HP regen for 8 seconds\r\nCooldown: 15 seconds\r\nActive:\r\nOn use, activates Bloody Soul\r\nProvides (15000 + 25% max HP) shield for 5 seconds\r\nUpon expiration, restores HP and MP equal to absorbed damage\r\nAlso deals (MAIN STAT X 150) magic damage to nearby enemies\r\nCooldown: 20 seconds, cannot be dropped during cooldown',
  'Vest of Divine Winds':
    'Passive:\r\nOn skill cast, activates Wind Fury for 1.5 seconds\r\nNext 2 attacks hit 2 more times and deals 50% ATK DMG\r\nIncreases AGI by 250 and MOV SPD by 400\r\nBonus MOV SPD decreases by half over buff duration\r\n',
  'Voidshard Armor':
    'Passive:\r\nWhen HP drops below 50%, activates Voidshard\r\nHeals 20% HP\r\nDeals (STR X 75) magic damage to nearby enemies\r\nIncreases STR by 15% and reduces DMG TAKEN by 7.5% for 12 seconds\r\nCooldown: 8 seconds\r\nActive:\r\nOn use, activates Event Horizon\r\nPrevents HP from dropping below 1 for 3 seconds\r\nAfterwards, pauses nearby enemies for 2 seconds and activates Voidshard\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  "Heaven's Door":
    "Passive:\r\nEmpowers next attack with Heaven's Light every 4 seconds\r\nDeals (INT X 50) magic damage to target and heals (INT X 1.5) HP to allies near target\r\nActive:\r\nOn use, activates Heaven's Door\r\nRefreshes a random non-ultimate spell of 2 closest nearby allies\r\nAllies cannot be affected by this more than once every 60 seconds\r\nCooldown: 30 seconds, cannot be dropped during cooldown",
  'Chaos Dagger':
    "Passive:\r\nEnables Chaos Breath every 4 seconds\r\nNext attack deals ((STR + AGI + INT) X 15) magic damage\r\nNext attack also has a 33% chance to crit for 3 times the normal damage\r\nAlso reduces target's MOV SPD by 25% and ATK SPD by 10% for 3 seconds\r\nActive:\r\nOn use, summons Servant of Chaos\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  'Ethenos, the Staff of Chaos':
    'Active:\r\nOn use, activates Big Bang\r\nDeals (INT X 750) magic damage to nearby enemies\r\nStuns for 3 seconds\r\nCooldown: 60 seconds, cannot be dropped during cooldown',
  Armageddon:
    'Passive:\r\nOn skill cast, activates Calamity\r\nIncreases ATK DMG by 12500 and INT by 750 for 4 seconds\r\nCooldown: 12 seconds\r\nActive:\r\nOn use, activates Song of Destruction\r\nDeals (2500% ATK DMG + INT X 125) magic damage to nearby enemies\r\nIncreases magic DMG TAKEN of hit enemies by 9% for 10 seconds\r\nStuns for 2 seconds\r\nUser is invulnerable while channeling\r\nCooldown: 60 seconds, cannot be dropped during cooldown',
  'Staff of Plague':
    'Active:\r\nOn use, activates Chain of Plague, infecting the target and next closest target for 8 seconds\r\nIf target is an enemy: deals (INT X 5) magic damage per second and lose 10% heal received\r\nIf target is an ally: grants target with 40% MAGIC DEF and heals for (INT X 1) per second\r\nIf target is self: grants target with 40% MAGIC DEF and heals for (INT X 0.5) per second\r\nUpon expiration on enemy, will explode dealing (INT X 40) magic splash damage\r\nCooldown: 20 seconds, cannot be dropped during cooldown',
  'Soul of Abyss':
    'Passive:\r\nOn skill cast, activates Power of Abyss\r\nGrants 12% SKILL DMG (Type-B) and 300 HP regen for allies in 375 radius for 8 seconds\r\nActive:\r\nOn use, activates Call of Abyss\r\nGrants a targetted ally 8% damage output and 15% HP regen for 10 seconds\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  'Crimson Hatred':
    "Passive:\r\nOn skill cast, temporarily increases INT by 250 and flame affinity by 2.5% for 6 seconds (stacks up to 5 times)\r\nActive:\r\nOn use, activates Beam of Hatred\r\nDeals (INT X 15.625) magic damage every 0.125 seconds and stuns for 0.5 seconds (up to 16 times)\r\nDeals up to 100% more damage based on target's missing HP\r\nCooldown: 75 seconds, cannot be dropped during cooldown",
  'Harmonia, the Sparkle of Life':
    'Passive:\r\nOn skill cast activate Spark of Life\r\nApplies to yourself and a nearby hero with the lowest HP\r\nHeals (15000 + INT) HP over 9 seconds\r\nProvides 15% damage resistance and 50 MOV SPD for duration\r\nCooldown: 3 seconds\r\nActive:\r\nOn use, activates Life Bind\r\nProvides 15% max HP regen and Spark of Life to allies within 600 radius for 10 seconds\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  'Power of Beriel':
    'Passive:\r\n(1 + 0.125 X attacks without activation)% chance to activate Doomsday on attack\r\nDeals (ATK DMG X 12.5 + (STR + AGI) X 75) magic damage\r\nStuns for 0.1 seconds\r\nActive:\r\nOn use, activates Grasp of Demon Lord\r\nPulls in all enemies from 300 ~ 800 radius around you, deals (ATK DMG X 50) magic damage and stuns for 2 seconds\r\nCooldown: 60 seconds, cannot be dropped during cooldown',
  'Espishu, the Sword of Chaos':
    'Passive:\r\n10% Chance to activate Chaos Strike on attack dealing ((STR + AGI) X 50) magic damage\r\n',
  'Eternal Winter':
    "Passive:\r\nEvery 8th attack activates Frost Explosion dealing water affinity X ((STR X 4) + (AGI X 3)) pure splash damage\r\nCounts as a single target\r\nActive:\r\nOn use, activates Permafrost\r\nDeals (max MP X 6) pure damage to nearby enemies and destroys their shields\r\nFreezes the ground and procs the following every second for 3 seconds\r\nDeals (max MP X 2) pure damage to enemies and freezes them for 1 second\r\nProvides (target's max MP X 0.3) shield to allies for 5 seconds\r\nCooldown: 30 seconds, cannot be dropped during cooldown",
  'Atricia, the Sword of Dreams':
    'Passive:\r\nOn spellcast, empowers next attack to deal (MAIN STAT X 6) pure damage, restore (MAIN STAT X 0.15), and adds stacks. Can have up to 6 stacks\r\nActive:\r\nConsumes all stacks and deals (50 X Mainstat X stack) damage to nearby enemies, stuns for 2 seconds, and gives 0.5 X stack seconds of 100% damage reduction and CC immunity\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  Calamity:
    "Passive:\r\nOn skill cast, gains a stack and activate Ruin\r\nIncreases ATK DMG by 1500, STR and INT by 100 and SKILL DMG by 1.5% for 5 seconds\r\nStacks up to 10 times\r\nActive:\r\nOn use, activates Sword of Calamity\r\nDeals (MAIN STAT X 500) magic damage to enemies in targetted area and silences for 3 seconds\r\nDeals up to 100% more damage based on target's missing HP\r\nSets Ruin stacks to max for 15 seconds\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  'Splitting of the Sky and Earth':
    'Passive:\r\nOn skill cast, activates Song of Glory increasing STR by 250 and SKILL DMG by 2.5% for 5 seconds.\r\nStacks up to a max of 4 times. Once max is reached, cannot refresh duration of buff.\r\nActive:\r\nOn use, activates Light of Creation which provides user with max stacks, passive, and damage output is increased by 7.5% for 10 seconds.\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  Chaos:
    "Passive:\r\n25% Chance to activate Devastation on attack causing enemies within a frontal cone area to take (STR X 100) magic damage\r\nReduces armor by 250 and MAGIC DEF by 2.5% for 6 seconds\r\nCooldown: 5 seconds\r\nActive:\r\nOn use, activates Oblivion granting the user with 100% ATK SPD, 200 STR, and 1.5% SKILL DMG per 1 ~ 0.5 seconds while draining user's HP\r\nStacks up to 10 times and drains (3000 + seconds elapsed X 750) HP per second\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  'Astra, the Sword of Moonlight':
    'Passive:\r\n10% chance to activate Moonlight Slash\r\nDeals ((MAIN STAT X 30) + (ATK DMG DEALT X 3)) magic splash damage and stuns for 0.25s\r\nEvery 3rd proc deals 200% DMG\r\nActive:\r\nOn use, activates Moonlight Eclipse\r\nStuns nearby enemies for 2.5 seconds\r\nIncreases magic damage taken of targets from next 3 hits by 25% for 6 seconds\r\nAfter 4th hit, target takes (MAIN STAT X 300) magic damage\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  'Cosmic Reaper':
    'Passive:\r\nOn every 12th attack, activates Dimension Cut. Deals (MAIN STAT X 50) magic damage to target and enemies around it\r\nOn skill cast, activates Awakening. Increases AGI by 1000 and regenerates 7.5% max Hp per second for 7.5 seconds\r\nIf user is NOT Martial Artist: On-attack activates every 4th attack for duration\r\nSpellcast Cooldown: 15 seconds, cannot be dropped during cooldown\r\n',
  Soulbane:
    'Passive:\r\n10% Chance to activate Soul Reaping on attack to deal (AGI X 60) bonus damage\r\nActive:\r\nOn use, activates Soul Bombardment\r\nShoots 4 arrows to target area, each dealing (AGI X 200) magic damage and stunning targets for 2.5 second\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  'Eternal Flame':
    "Passive:\r\n15% Chance to activate Mark of Flame on attack that burns the target\r\nDeals flame affinity X (AGI X 30) bonus magic damage and applies a debuff to target\r\nDebuff deals flame affinity X (AGI X 15) per second and takes 2.5% more magic damage for 10 seconds\r\nAccumulates Heat while in combat every 6 seconds increasing user's SKILL DMG and flame affinity by 1% (stacks up to 15 times)\r\n",
  'Pheles, the Bow of God':
    'Passive:\r\nActivates Poem of Wind on attack\r\nFires 1 additional projectile on every attack that deals (10% ATK DMG) pure damage\r\n50% chance to fire a 2nd additional projectile\r\n',
  'Last Word':
    'Passive:\r\nCharges a Bullet of Penance every 4 seconds\r\nEmpowers next attack to deal (ATK DMG X 8 + AGI X 50) bonus magic damage and stun target for 0.25 seconds\r\nUp to 3 bullets can be loaded\r\n',
  'Chrono Chaser':
    "Active:\r\nOn use activates Chrono Chaser, a projectile that breaks shields and deals (AGI X 250 + 7.5% target's max HP) magic damage\r\nStuns for 1 second\r\nProjectile stays in target area for 4 seconds and deals 20% of initial damage per second\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  Rainmaker:
    'Passive:\r\nOn healing, activates Healing Water granting healed allies ((INT X 0.3) X water affinity) HP regen for 3 seconds\r\nActive:\r\nOn use, activates Rainstorm around the user\r\nRestores (INT X 1) max HP to all nearby allies every 2 seconds for 6 seconds\r\nCooldown: 20 seconds',
  'Cosmic Star':
    'Passive:\r\nEmpowers healed allies with 9% SKILL DMG and healing for 6 seconds.\r\nActive:\r\nThrows 3 waves of light to target area (400 radius) each dealing INT X 40 damage and heals INT X 1.5 HP to allies (10 second CD)',
  'Wings of Frost Lord':
    'Passive:\r\nOn skill cast, summons Ice Spikes that target closest enemy boss\r\nDeals (INT X 25) magic damage per spike\r\n5 Ice Spikes can be summoned at once\r\n',
  'Wings of Flame Lord':
    'Active:\r\nOn use, activates Flame Descent\r\nDeals (ATK DMG X 15 + MAIN STAT X 125) magic damage to enemies in targeted area\r\nStuns for 1.5 seconds\r\nMax dash distance of 1500\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  'Brave Heart':
    'Passive:\r\nReduces MOV and ATK SPD by 25% of nearby enemies\r\nActive:\r\nOn use activates Bravery\r\nRestores 50% max HP of self and 30% max HP of nearby allies\r\nStuns nearby enemies for 1.5 seconds\r\nCooldown: 40 seconds, cannot be dropped during cooldown',
  'Ruler of the Skies':
    'Passive:\r\nOn skill cast, activates Power of Skies\r\nEvery 4th attack deals (MAIN STAT X 3) pure damage and increases all stats by 500 for 5 seconds\r\nCooldown: 15 seconds, cannot be dropped during cooldown\r\nActive:\r\nOn use, activates Star of Destruction\r\nDeals ((STR + AGI) X 250) magic damage to enemies at target location and reduces their armor by 300 for 10 seconds\r\nStuns for 2.5 seconds\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  'Wings of Blood Lord':
    'Passive:\r\nUpon moving 400 distance, activates Bloody Bite on next attack\r\nOn each proc, deal (50% ATK DMG) pure damage\r\nHeals 8% max HP, and for 4 seconds increases ATK DMG by 1500, MOV SPD by 15, and HP Recovery Rate by 250 (can overlap up to 5 times)\r\n',
  'Protection of the Fairies':
    'Passive:\r\nHealing received by nearby allies +15%\r\nActive:\r\nOn use, revives a fallen ally with full HP and MP\r\nCooldown: 300 seconds, cannot be dropped during cooldown',
  'Archangel Wings':
    'Passive:\r\n"Archangel\'s Judgement" On spell cast, 5% chance to reset the cooldown of all non-ultimate skills after 2 seconds of delay, gain 10% SKILL DMG, and 50% damage resistance for 10 seconds (120 second CD)\r\n',
  Storm:
    'Passive:\r\nOn spell cast, increases SKILL DMG and crit chance by 4% for 6 seconds. Stacks up to 3 times\r\n',
  'Wings of Night Lord':
    "Passive:\r\nOn skill cast, empowers next attack\r\nNext attack deals (MAIN STAT X 2 + AGI X 1.5) pure damage\r\nCan crit based on user's critical chance\r\nEmpowered attack stacks Madness of Night\r\nFor 8 seconds increases AGI by 120 (stacks up to 10 times)\r\nOnce max stacks is reached, user can no longer gain more for duration but gains 10% damage output\r\n",
  'Cape of Deep Abyss':
    "Passive:\r\nOn direct hit, activates Drowning Abyss\r\nDeals 15% of effect's damage over 5 seconds\r\nIncreases target's magic DMG TAKEN by 6 ~ 9% (increases based on amount of time target is debuffed, max at 15 seconds)\r\nIf target dies while debuffed it explodes and deals (MAIN STAT X 30) pure damage to nearby enemies\r\nActive:\r\nOn use, manually activates explosion on targets that have max reduction stacks",
  'Wings of Immortal':
    'Passive:\r\nWhile in combat, every 3 seconds increases MAIN STAT by 30 for a max of 1500\r\nOn death, revives user\r\nCooldown: 180 seconds, cannot be dropped during cooldown\r\n',
  'Soul Devourer':
    'Passive:\r\nEvery 5 seconds restores 10% max HP and max MP to user\r\nActive:\r\nOn use, activates Soul Swallow\r\nCleanses debuffs from user\r\nRestores 40% max HP\r\nCooldown: 40 seconds, cannot be dropped during cooldown',
  'Ring of Healed':
    "Passive:\r\nIf HP drops below 1, Gives you a text that says HEALED but thats it.\r\nActive:\r\nOn use, activates Time Distortion resetting it's own cooldown, but only once.\r\nCannot be dropped",
  '반 아저씨의 과일': 'Active:\r\nIncreases EXP gain by 15% for 10 minutes',
  '반 아저씨의 메론': 'Active:\r\nIncrease SKILL DMG by 12% for 60 seconds',
  '반 아저씨의 호박': 'Active:\r\nRestores HP by 30%\r\nRestores MP by 5000',
  '반 아저씨의 당근':
    "Active:\r\nATK DMG and MOV SPD increased by 40% for 5 minutes\r\nDoes not work if you're above level 400",
  '죽음의 책': 'Active:\r\nOn use, immediately fills up fatigue',
  '마법의 뿔피리': 'Active:\r\nSummons a field boss',
  '마녀의 초대장': 'Active:\r\nSummons a field boss',
  '자연의 장검': "Passive:\r\nOn attack, decreases target's armor by 25 for 5 seconds\r\n",
  '자연의 장갑': 'Passive:\r\nOn attack, increases AGI by 25 for 4 seconds\r\n',
  '자연의 활': 'Passive:\r\nOn attack, leaves a poison that deals 2000 damage per second\r\n',
  '자연의 갑옷': 'Passive:\r\nAbsorbs DMG TAKEN by 75\r\n',
  '자연의 날개': 'Active:\r\nOn use, creates a portal that connects to Alfon Village',
  '나이트메어 로드':
    'Active:\r\nSummons a field boss\r\nMay be used without powder\r\nHowever if used together with 8 Red Powder, it summons a powerful boss',
  '화염의 망토': 'Passive:\r\nPeriodically deals 5000 magic damage to nearby enemies\r\n',
  '심해의 보옥':
    'Active:\r\nSummons a field boss\r\nGreen Powder x4 needed\r\nBlue Powder x4 needed',
  '심해의 검': 'Passive:\r\n20% Chance to deal (0.01 X ATK DMG X 2) splash damage on attack\r\n',
  '심해의 장갑': 'Passive:\r\n20% Chance to deal (0.01 X ATK DMG X 2) splash damage on attack\r\n',
  '심해의 장검': 'Passive:\r\n20% Chance to deal (0.01 X ATK DMG X 2) splash damage on attack\r\n',
  '심해의 활': 'Passive:\r\n20% Chance to deal (0.01 X ATK DMG X 2) splash damage on attack\r\n',
  '심해의 소총': 'Passive:\r\n20% Chance to deal (0.01 X ATK DMG X 2) splash damage on attack\r\n',
  '타락의 검': 'Passive:\r\n10% Chance to deal 5000 bonus damage on attack\r\n',
  '타락의 장갑': 'Passive:\r\n10% Chance to deal 5000 bonus damage on attack\r\n',
  '타락의 장검': 'Passive:\r\n10% Chance to deal 5000 bonus damage on attack\r\n',
  '타락의 지팡이': 'Passive:\r\n10% Chance to deal 5000 bonus damage on attack\r\n',
  '타락의 활': 'Passive:\r\n10% Chance to deal 5000 bonus damage on attack\r\n',
  '타락의 소총': 'Passive:\r\n10% Chance to deal 5000 bonus damage on attack\r\n',
  '봉인 해제석': 'Passive:\r\nBring to the sleeping Ancient Ent to break its seal.\r\n',
  '대지의 갑주':
    'Passive:\r\nTemporarily boosts HP regen to 2500 HP per second when HP drops below 30% of max HP for 10 seconds\r\nCooldown: 55 seconds, cannot be dropped during cooldown\r\n',
  '수호의 복장': 'Passive:\r\nCreates a barrier that absorbs 3000 damage every 8 seconds\r\n',
  '요정의 로브':
    "Active:\r\nSummons fairy on use. Has two spells:\r\nHeals 40000 HP over 12 seconds\r\nDecrease the target's armor by 200 with fairy's fire for 10 seconds\r\nLasts 30 seconds on non-boss units\r\nCooldown: 90 seconds",
  '생명의 돌':
    "Passive:\r\nIncreases allies' ATK SPD by 10%\r\nActivates revival on death\r\nCooldown: 180 seconds, cannot be dropped during cooldown\r\n",
  '정령검 스피리투스':
    "Passive:\r\nEnables the use of Breath of Ancients every 5 seconds\r\nDeals ((STR + AGI + INT) X 7.5) magic damage on attack\r\nReduces target's MOV SPD by 20% for 3 seoncds\r\n",
  '폭풍우의 화관':
    'Passive:\r\nOn crit, strike down a lightning\r\nDeals ((STR + AGI + INT) X 3) magic damage\r\nHas a 15% chance to deal ((STR + AGI + INT) X 15) magic damage instead\r\nCooldown: 2.5 seconds\r\n',
  '우레의 망치 비스바이레':
    'Passive:\r\nActivates Source of Power on skill cast\r\nDeals (STR X 1.5) magic damage on next attack\r\nIncreases MOV SPD by 100% and STR by 425 for 6 seconds\r\nCooldown: 10 seconds, cannot be dropped during cooldown\r\n',
  '맹독의 검': 'Passive:\r\nInflicts poison that periodically deals 800 damage on attack\r\n',
  '맹독의 장검': 'Passive:\r\nInflicts poison that periodically deals 800 damage on attack\r\n',
  '맹독의 장갑': 'Passive:\r\nInflicts poison that periodically deals 800 damage on attack\r\n',
  '맹독의 지팡이': 'Passive:\r\nInflicts poison that periodically deals 800 damage on attack\r\n',
  '맹독의 활': 'Passive:\r\nInflicts poison that periodically deals 800 damage on attack\r\n',
  '맹독의 소총': 'Passive:\r\nInflicts poison that periodically deals 800 damage on attack\r\n',
  '피의 검 테페시아': 'Passive:\r\nOn attack, drains 10% of DMG DEALT as life (up to 800)\r\n',
  '혈포 체페슈': 'Passive:\r\nOn attack, drains 10% of DMG DEALT as life (up to 800)\r\n',
  '피의 창 상귀엘': 'Passive:\r\nOn attack, drains 8% of DMG DEALT as life (up to 600)\r\n',
  '펌킨 로드':
    'Active:\r\nOn use, activates Throw Pumpkin\r\nDeals (7500 + INT X 40) magic damage\r\nStuns target for 1 second and heals caster for 10000 HP\r\nUsable on magic immune targets (still damage type magic)\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  '사탕 주머니':
    'Active:\r\nOn use, throws out 5 random candies\r\nCinnamon Candy: +50 STR\r\nIcicle Candy: +50 AGI\r\nMana Candy: +50 INT\r\nSoul Candy: +10% EXP Received\r\nDuration: 30 minutes for all candies',
  '용검 라인하르트':
    "Passive:\r\n10% Chance to activate Dragon's Claw on attack\r\nDeals (4500 + MAIN STAT X 2.5) magic damage\r\n",
  '용궁 에이엔스':
    "Passive:\r\n10% Chance to activate Dragon's Claws on attack\r\nDeals (4500 + MAIN STAT X 2.5) magic damage\r\n",
  '용봉 이레이브':
    'Active:\r\nOn use, activates Mana Cannon\r\nDeals (INT X 75) magic damage in a linear path\r\nCooldown: 60 seconds',
  '용포 벨레누스':
    "Passive:\r\n10% Chance to activate Dragon's Claws on attack\r\nDeals (4500 + MAIN STAT X 2.5) magic damage\r\n",
  '용갑 마그론': 'Passive:\r\nAbsorbs DMG TAKEN by 300\r\n',
  '용투 아그론': 'Active:\r\nOn use, block magic every 8 minutes',
  '불의 장검 리오레우스':
    'Passive:\r\n10% Chance to create Flame Explosion on attack\r\nDeals (flame affinity X (12000 + STR X 9)) magic damage\r\n',
  '뇌전의 검 이르베스':
    'Passive:\r\n10% Chance to strike down lightning on attack\r\nDeals (wind affinity X (12000 + AGI X 5)) magic damage\r\n',
  '바람의 궁 피레스':
    "Active:\r\nOn use, activates Sylph's Blessing\r\nHeals all allies in a 550 AoE radius for 20% max HP and 25% max MP\r\nCooldown: 50 seconds, cannot be dropped during cooldown",
  '대지의 봉 벤지이나':
    'Active:\r\nOn use, activates Earthen Rage\r\nDeals (INT X 45) magic damage to enemies in a targetted area',
  '강철의 탄환 레투스':
    'Passive:\r\nEmpowers next attack with Iron Bullet every 8 seconds\r\nEmpowered attacks deal (50 X AGI) magic damage and stuns for 0.375 seconds\r\n',
  '로브 오브 메이지': 'Active:\r\nOn use, block magic every 5 minutes',
  '후드 오브 메이지':
    'Active:\r\nOn use, grants invisibility for 20 seconds\r\nCooldown: 60 seconds, cannot be dropped during cooldown',
  '공명의 반지':
    'Active:\r\nOn use, activates Resonance\r\nRefreshes the cooldown of the last skill used\r\nDoes not apply to ultimate skill or items\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  '성검 카론프니엠':
    'Passive:\r\n10% chance to activate Holy Strike on attack\r\nIf MAIN STAT is STR: deals (STR X 12) magic damage\r\nIf MAIN STAT is AGI or INT: deals (AGI X 12) magic damage\r\n',
  '성봉 클레네티아':
    'Active:\r\nOn use, activates Holy Explosion\r\nDeals (INT X 75) magic damage to enemies in a targetted area and stuns for 1 second',
  '성포 이아나':
    'Passive:\r\n10% chance to activate Holy Bullet on attack\r\nIf MAIN STAT is STR: deals (STR X 12) magic damage\r\nIf MAIN STAT is AGI or INT: deals (AGI X 12) magic damage\r\n',
  '성갑 홀리오스':
    'Passive:\r\n10% Chance to create a barrier on being hit\r\nIncreases armor by 10000 for 4 seconds\r\nCooldown: 12 seconds\r\n',
  '성투 홀리로스':
    'Active:\r\nOn use, block magic every 4 minutes\r\nShares cooldown with Helm of Battle',
  '마검 엑시멜리아':
    'Passive:\r\n10% Chance to activate Dark Strike on attack\r\nDeals (AGI X 12) magic damage\r\n',
  '마갑 데카로스':
    "Passive:\r\n12% Chance to reduce attacker's armor on being hit\r\nReduces armor by 125 for 5 seconds\r\n",
  '마궁 알카테':
    'Passive:\r\n12% Chance to activate Dark Spike on attack\r\nDeals (AGI X 12) magic damage\r\n',
  '서리한의 로브 켈투자드':
    'Passive:\r\n10% Chance to activate Frost Armor on being hit\r\nIncreases armor by 400 for 15 seconds\r\n',
  '서리한의 투구 프로스트':
    'Passive:\r\n10% Chance to freeze attacker on being attacked for 1.5 seconds\r\n',
  '서리한의 후드 프로스트':
    'Passive:\r\n10% Chance to freeze attacker on being attacked for 1.5 seconds\r\n',
  '윈터 로즈':
    'Passive:\r\n10% Chance to temporarily boost INT by 250 on attack for 6 seconds\r\nDoes not stack\r\n',
  '빙결의 창 오켈렌크':
    "Passive:\r\n13% Chance to activate Frost effect on attack\r\nDeals (MAIN STAT X 12) magic damage and reduces enemy's MOV SPD by 20% for 3 seconds\r\n",
  '빙결의 활 오켈렌크':
    "Passive:\r\n13% Chance to activate Frost effect on attack\r\nDeals (MAIN STAT X 12) magic damage and reduces enemy's MOV SPD by 20% for 3 seconds\r\n",
  '프로스트 웹 브로치':
    "Passive:\r\nDMG DEALT by attack +10%\r\n8% chance to reduce target's armor by 175 on attack for 5 seconds\r\n",
  '겨울의 눈물':
    'Passive:\r\nSlows enemies on attack\r\nEvery 8th attack unleashes Chilling Strike that ignores all resistance\r\nDeals (water affinity X (STR X 1.8 + AGI X 1.5)) pure damage\r\n',
  프로스트베인:
    'Passive:\r\n15% chance to slow target on attack\r\nDeals (AGI X 7.5 ~ 10) magic damage and slows for 3 seconds\r\n',
  니플하임:
    'Active:\r\nOn use, increases ATK DMG by 15000 and STR by 1000 for 8 seconds\r\nCooldown: 25 seconds',
  '리플 스노우':
    'Passive:\r\nOn use, activates Frozen Shard\r\nDeals (water affinity X (INT X 60)) magic damage and freezes enemies for 2 seconds\r\nDamage is affected by ice/water affinity\r\n',
  '파괴의 손톱':
    'Passive:\r\n(1 + HIT COUNT X 0.125)% Chance to activate Doomsday on attack\r\nDeals (42 X (STR + AGI)) + (8 X ATK DMG) magic splash damage and stuns for 0.1 seconds\r\n',
  '파괴의 탄환':
    'Passive:\r\n(1 + HIT COUNT X 0.125)% Chance to activate Doomsday on attack\r\nDeals (42 X (STR + AGI)) + (8 X ATK DMG) magic splash damage and stuns for 0.1 seconds\r\n',
  '마왕의 뿔':
    "Active:\r\nSteals target's soul on use for 5 seconds, healing hero for (max HP / 7.5) and deals (MAIN STAT X 8 + max HP / 7.5) magic damage to target\r\nIf target dies while draining, grants 350 AGI for 5 minutes\r\nCooldown: 150 seconds, cannot be dropped during cooldown",
  '심연의 눈':
    "Passive:\r\nNearby allies' SKILL DMG +4%\r\nActive:\r\nOn use, summons 4 monsters\r\nINT increase is lowered by half while on cooldown\r\nCooldown: 100 seconds, cannot be dropped during cooldown",
  '쉘 소드':
    "Passive:\r\n25% Chance to deal pure splash damage on attack\r\nDamage depends on hero's ATK DMG\r\n",
  '크랩 아머':
    "Passive:\r\nReflects damage if attacked\r\nReflected damage depends on user's base ATK DMG:\r\nIf base ATK DMG is more than 300, damage reflected is 1200 pure damage\r\nIf base ATK DMG is 300 and less, damage reflected is (base ATK DMG X 4) pure damage\r\n",
  '바다의 진주':
    'Active:\r\nCalls a refreshing wave upon use\r\nIf unit hit with wave is ally, heals for 3000 HP\r\nIf unit hit with wave is enemy, deals (MAIN STAT X 25) + 4000 magic damage\r\nCooldown: 120 seconds',
  '워터폴 슈즈':
    'Passive:\r\nOn kill, 8% chance to temporarily boost EXP gain by 12% and MP regen by 15% for 30 seconds\r\n',
  '상아 지팡이': 'Passive:\r\nDeal 1500 bonus magic damage on attack\r\n',
  '아이시클 보우':
    'Passive:\r\nApplies bonus magic damage and a slow effect on attack\r\nEach attack deals a bonus of (Water/Ice affinity X 800 ~ 1500) magic damage\r\nSlow effect lasts for 0.75 seconds\r\n',
  '스노우맨 펜던트':
    "Active:\r\nSummons Snowman on use that deals (INT X 15) + 5000 magic damage upon landing on an enemy\r\nEach snowman's attack applies a slow effect to target and has a 15% chance to deal (INT X 2.5) + 2500 magic damage\r\nCooldown: 120 seconds, cannot be dropped during cooldown",
  '글래시어 가드':
    'Passive:\r\n10% Chance to freeze nearby enemies on being hit and deal 30000 magic damage\r\nFreeze lasts for 1.5 seconds\r\n',
  '바람막이 털옷':
    'Passive:\r\nAllows you to dodge a fatal damage if DMG DEALT makes HP drop below 40.5% every 90 seconds\r\nCannot be dropped during cooldown\r\n',
  '킹콩의 손톱':
    'Passive:\r\n+10% DMG DEALT by attack\r\nDeals 2500 when attacking same target\r\nSecond attack applied is pure damage\r\n',
  '고기 주머니':
    'Passive:\r\nOn use, activates Restore Stamina, restoring HP and MP for 2000 and increasing ATK SPD by 15%\r\n',
  '열정의 투구': "Passive:\r\nIncreases nearby allies' MOV SPD by 20% and ATK SPD by 10%\r\n",
  적석:
    'Passive:\r\nOn skill cast, increases HP regen by 300 and SKILL DMG by 6% for 3 seconds\r\n',
  블래스터:
    'Passive:\r\n14% Chance to activate Explosion on attack dealing (AGI X 10) magic splash damage\r\n',
  '작은 분노의 조각':
    'Passive:\r\n12.5% Chance to activate Wrath on skill cast dealing (MAIN STAT X 40) magic splash damage and stuns for 1 second\r\n',
  플레임리버:
    'Passive:\r\nGrants 2% chance to inflict STR X 50 magic damage on attack\r\nDamage is affected by flame affinity\r\n',
  진혼검:
    'Passive:\r\nActivates Unleash every 14th attack\r\nRed Wrath: deals (MAIN STAT X 22.5) magic splash damage\r\nGreen Wrath: reduces target MOV and ATK SPD by 66% for 3 seconds, deals (MAIN STAT X 12.5) magic splash damage, and stuns non-boss units for 0.25 seconds\r\nBlue Wrath: heals user for (MAIN STAT + 3000) HP and (current MP + (max MP X 15%)) MP\r\n',
  진혼궁:
    'Passive:\r\nActivates Unleash every 14th attack\r\nRed Wrath: deals (MAIN STAT X 22.5) magic splash damage\r\nGreen Wrath: reduces target MOV and ATK SPD by 66% for 3 seconds, deals (MAIN STAT X 12.5) magic splash damage, and stuns non-boss units for 0.25 seconds\r\nBlue Wrath: heals user for (MAIN STAT + 3000) HP and (current MP + (max MP X 15%)) MP\r\n',
  '블러드 오브':
    'Passive:\r\nSteals HP on attack\r\nActive:\r\nOn use, grants 10% SKILL DMG and 6% life steal for skills for 9 seconds',
  '망자의 옷':
    'Passive:\r\nIf HP drops below 15%, gain 90% damage reduction for 3 seconds\r\nCooldown: 90 seconds\r\n',
  '망자의 반지':
    'Passive:\r\nPeriodically drains HP from nearby enemies (50 HP from creeps and 300 HP bosses)\r\n',
  '피의 가면':
    'Active:\r\nOn use, activates Bloodlust granting 30% life steal, 400 MAIN STAT, and 100% bonus ATK and MOV SPD for 8 seconds\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  '저주받은 가면': 'Active:\r\nSummons a field boss',
  돌갑주:
    'Active:\r\nOn use, activates Stone Form\r\nGrants the user with an 8000 shield for 2 seconds and 4000 bonus HP and MP regen\r\nCooldown: 40 seconds, cannot be dropped during cooldown',
  '박쥐 날개':
    'Passive:\r\nUpon moving 400 distance, activates Drain on next attack dealing bonus (33% ATK DMG) pure damage and heal for 6% HP\r\ncooldown: 0.125 seconds\r\n',
  삼지창: 'Passive:\r\nOn skill cast, enhances the next 3 attacks for 6 seconds\r\n',
  '타이달 로브': 'Passive:\r\nRecovers 4000 HP over 5 seconds when hit\r\n',
  '물방울 보주':
    "Active:\r\nOn use, creates a Bubble Barrier for 6 seconds\r\nIncreases the user's MAGIC DEF by 90%\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  '정화의 날개': 'Passive:\r\nEvery 5 seconds recovers 3000 HP of nearby allies\r\n',
  커럽터:
    'Passive:\r\n25% Chance to corrupt enemies in frontal cone on attack dealing (STR X 40) magic damage and reducing their armor by 175 for 6 seconds\r\n',
  추적자:
    'Passive:\r\n9% Chance to activate Corrupt Explosion on attack\r\nDeals (1.5 X AGI X 10) magic damage and deals (AGI X 10) magic damage to enemies around target\r\n',
  복수자:
    'Active:\r\nOn use, activates Vengeance blocking the next spell-inflicted damage instance for 6 seconds and increases AGI by 1000 for 15 seconds\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  체이서:
    'Active:\r\nOn use, activates Chaser spawning 6 projectiles around user for 6-8 seconds\r\nOn the next 6 attacks, one projectile per attack gets released and deals (AGI X 17.5) magic splash damage to target.\r\nCooldown: 20 seconds, cannot be dropped during cooldown',
  '해골 인장':
    'Passive:\r\nOn being healed, converts 10% of excess amount into max HP\r\nMax bonus HP is 7500\r\n',
  '타락의 포션':
    'Active:\r\nOn use, transforms user for 12 seconds\r\nGrants the user with 250 all stats, increase MAGIC DEF by 60%, and heals 1% of max HP per second over duration\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  '전염의 지팡이':
    'Active:\r\nOn use, creates a poisonous field at the target location for 8 seconds\r\nDeals (INT X 125) total magic damage in a 375 AoE over duration\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  증오:
    'Passive:\r\nConverts 0.035% of DMG DEALT into INT for a max of 600 INT (can be released)\r\nActive:\r\nOn use, can release stored INT that deals ((0.5 + ( stored INT - 300 ) / 600) X INT X 90) magic damage to enemies in a 450 radius around user\r\nStuns for 1.5 seconds\r\nAt least 300 stored INT required to use\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  '플레임샤드 아머':
    'Passive:\r\nActivates Flameshard when HP drops below 35%\r\nIncreases STR by 5% for 10 seconds and restores 14% max HP\r\nDeals (STR X 25) magic damage to enemies in a 325 radius around user and reduce their ATK and MOV SPD by 75% for 1.5 seconds\r\nDamage is affected by flame affinity\r\nCooldown: 8 seconds, cannot be dropped during cooldown\r\n',
  '악몽의 반지':
    'Passive:\r\n5% Chance to activate Nightmare on attack\r\nGain 15000 ATK DMG, 900 MAIN STAT, and 1000 HP regen for 6 seconds\r\n',
  인페르노:
    'Passive:\r\n20% Chance to activate Burning Wrath on attack that causes 5 explosions on target over 2.5 seconds\r\nEach explosion deals (AGI X 20) magic damage to enemies in a 325 radius around target\r\nRestores 1% HP per explosion for a total of 5% max HP\r\nCooldown: 10 seconds, cannot be dropped during cooldown\r\n',
  '열정의 화관': 'Passive:\r\nConverts 2% of max HP into INT (max 500)\r\n',
  '워터 캐논':
    'Active:\r\nOn use, releases Water Beam dealing (INT X 25) magic damage per 0.125 seconds and pushes all enemies hit\r\nDamage is affected by Ice/Water Affinity\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  '교활의 튜닉': 'Passive:\r\nDodges upto 3 attacks every 20 seconds\r\n',
  '마력의 정수':
    'Active:\r\nOn use, restores 20% MP\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  '스케일 프로텍터':
    'Passive:\r\n12.5% Chance to restore 2.5% HP on being hit\r\nActive:\r\nOn use, increases max HP by 20000 and MP by 7500 for 15 seconds\r\nCooldown: 180 seconds, cannot be dropped during cooldown',
  '용기의 맹세':
    'Passive:\r\nIncreases nearby allies MAGIC DEF by 8%\r\nActive:\r\nOn use, consumes HP to activate Blessing\r\nCreates a shield for all allies within 400 radius\r\nCooldown: 60 seconds',
  '데스 사이드':
    "Passive:\r\n12% Chance to activate Strike of Malice on attack dealing (MAIN STAT X 35) magic damage\r\nActive:\r\nOn use, activates Soul Reaper dealing (MAIN STAT X 150) magic damage and slowing target's MOV SPD by 50%\r\nAlso gives +5% SKILL DMG to user\r\nCooldown: 150 seconds, cannot be dropped during cooldown",
  '영혼의 지팡이':
    'Active:\r\nOn use, activates Dark Howl\r\nDeals (INT X 19.75) magic damage\r\nStacks magic DMG TAKEN of target by 1% per wave for 4 waves\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  '사신의 로브':
    'Active:\r\nOn use, activates Death Pact granting the user 850 INT for 11 seconds at the cost of 40% HP\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  '본 네크리스':
    'Passive:\r\nEvery 8 seconds, activates one of the following:\r\nAnger: +10% SKILL DMG\r\nOblivion: +16% damage reduction\r\nObsession: (MAIN STAT X 20%) HP regen\r\nActive:\r\nOn use, temporarily activates all effects\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  '기생의 지팡이':
    'Active:\r\nOn use, activate Parasite for 5 seconds\r\nIf target is an enemy: deals (INT X 5) magic damage per second and lose 10% heal received\r\nIf target is an ally: grants target with 40% MAGIC DEF and heals for INT X 1 per second\r\nIf target is self: grants target with 40% MAGIC DEF and heals for INT X 0.5 per second\r\nUpon expiration, will explode dealing (INT X 40) magic splash damage\r\nCooldown: 25 seconds, cannot be dropped during cooldown',
  '망자의 두건':
    "Passive:\r\nActivates Hands of Fallen on death\r\nExplodes dealing (MAIN STAT X 275) magic damage to enemies nearby\r\nScales with user's stats\r\n",
  '집념의 장막':
    'Passive:\r\n8% Chance to activate Perseverance on attack\r\nGrants user with +50% MOV and ATK SPD, +100 MAIN STAT per tick for 10 seconds, and a 40% heal\r\nCooldown: 30 seconds, cannot be dropped during cooldown\r\n',
  '대자연의 포옹':
    "Active:\r\nOn use, temporarily increases nearby allies' max HP\r\nIf self or summon: grants +6000 HP and +5% SKILL DMG for 45 seconds\r\nIf ally is a hero: grants +3000 HP for 45 seconds\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  '수호의 검 그리세우스':
    'Active:\r\nOn use, activates Ethereal Strike that (max MP X 2) pure damage and stuns for 1 second if target is enemy\r\nIf an ally is hit: heals the target for (max HP X 25%)\r\nCooldown: 15 seconds, cannot be dropped during cooldown',
  '폭풍의 반지':
    'Passive:\r\nOn skill cast, increases SKILL DMG by 3% for 6 seconds (stacks up to 4 times)\r\nActive:\r\nOn use, summons a storm in a 325 radius above the user that deals (MAIN STAT X 12.5) magic damage per second for 4 seconds\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  '애증의 검 르반테':
    'Passive:\r\nResonates with nearby allies to become stronger\r\nFor each ally nearby, the user gains +1750 ATK DMG and +1% SKILL DMG\r\n12% chance to deal (MAIN STAT X 37.5) magic damage\r\n',
  '드래고닉 스킨 루살카':
    'Passive:\r\n10% Chance to activate Dragonic Skin on being damaged which blocks any amount of damage and heals you for that amount\r\nCooldown: 4 seconds, cannot be dropped during cooldown\r\nActive:\r\nOn use, blocks harmful magic every 3 minutes\r\nLasts 5 seconds\r\nCooldown: 180 seconds',
  '각인의 반지 네프티스':
    'Active:\r\nOn use, activates Gifted Power which grants +300 HP regen and +5% MAGIC DEF every 1.5 seconds up to 5 times or fully healed\r\nCooldown: 120 seconds',
  '창공의 수호자':
    'Passive:\r\nActivates Power of Skies on casting skill\r\nEvery 4th attack deals (MAIN STAT X 2) pure damage and increases MAIN STAT by 250 for 4 seconds\r\nCooldown: 16 seconds, cannot be dropped during cooldown\r\nActive:\r\nOn use, activates Star of Creation\r\nDeals (MAIN STAT X 15) magic damage to all enemies in targetted area and stuns for 2 seconds\r\nUpon expiration, will explode dealing (MAIN STAT X 115) magic damage and reduce enemy armor by 250\r\nCooldown: 150 seconds, cannot be dropped during cooldown',
  '디 엔더':
    'Passive:\r\nWhen attacking an enemy under 50% HP, increases damage output by 15% for 5 seconds\r\nEmpowers next attack for (MAIN STAT X 125) magic damage every 12 seconds\r\nCannot be dropped during cooldown\r\n',
  '원한의 갑주':
    'Passive:\r\nReleases Grudge every 6 seconds\r\nSpikes protrude outwards from user in a 275 AoE dealing (ATK DMG X 7.5) magic damage\r\nAlso increases ATK DMG by 20000 for 1.5 seconds\r\n',
  '주시자의 눈':
    'Active:\r\nOn use, activates Death Gaze\r\nDeals (MAIN STAT X 250) magic damage\r\nIncreases magic DMG TAKEN by enemies (Type-A) by 8% for 4 seconds\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  '파괴의 반지': 'Passive:\r\n15% chance to do 40% bonus damage upon dealing damage\r\n',
  '하늘의 족쇄':
    'Active:\r\nOn use, activates Shackles of Heaven:\r\nLatches onto all enemies in targetted area dragging them for 5 seconds\r\nDeals (MAIN STAT X 25) for every 200 distance traveled\r\nReduces damage output of shackled enemies by 50%\r\nNote: Shackles can be released if target is knockback immune or distance between user and target reaches 1500 or more range\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  '화산의 심장':
    'Passive:\r\nGain one stack after 5 seconds of attacking, for a max of 5 stacks and 25 seconds of attacking\r\nStacks last for 15 seconds while in combat\r\nActive:\r\nOn use, activates Grand Explosion causing the user to explode and die after 1 second of delay.\r\nDeals (1 + stacks X 50%) X (MAIN STAT X 250) magic damage and stuns for 3 seconds\r\nCooldown: 180 seconds, cannot be dropped during cooldown',
  '영원의 잔':
    'Passive:\r\nCreates Water Barrier that absorbs up to 10000 damage and provides 1% HP and MP regen every 8 seconds\r\n',
  '드래고닉 오브':
    'Active:\r\nOn use, unleashes Draconic Power to summon a Dragon, grants the user 90% magic reduction and render the user invulnerable to instant deaths for 15 seconds.\r\nDragon skills:\n↳ Flame Breath [Q]: (MAIN STAT X 75) magic damage per second to enemies in target area\n↳ Dragon Scale [W]: Absorbs up to 30000 damage, +7500 HP regen, and lasts 2 seconds\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  '낡은 모래시계':
    'Passive:\r\nEvery 3 seconds, your next attack strikes for 2 additional times\r\nActive:\r\nOn use, refreshes a random skill\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  '탐욕의 저주':
    'Passive:\r\nOn dealing damage, inflicts Greed\r\nWhen in combat for 5 seconds, increases ATK SPD and DMG OUTPUT by 1%\r\nAlso increases DMG TAKEN by 2%\r\nCan be stacked up to 25 times\r\nCooldown: 1 second\r\n',
  '작은 폭풍의 결정':
    "Active:\r\nDeals (max HP X 20%) pure damage to the target and stuns for 1 second\r\nWorks only if user level is greater than or equal to target's level\r\nCooldown: 180 seconds",
  '작은 대지의 결정':
    "Active:\r\nPulls in nearby enemies from 900 range for 60 seconds\r\nWorks only if user level is greater than or equal to target's level\r\nCooldown: 180 seconds",
  '작은 바다의 결정':
    "Active:\r\nFreezes target for 5 seconds\r\nWorks only if user level is greater than or equal to target's level\r\nCooldown: 180 seconds",
  '작은 화염의 결정':
    'Active:\r\nOn use, deals hero level X 2000 magic damage to nearby enemies within 1800 radius\r\nCooldown: 180 seconds',
  '작은 빛의 결정':
    'Active:\r\n성스러움을 느낀다. (Does nothing special, just a graphic. Probably just something to be of use in later content?)\r\nCooldown: 180 seconds',
  '작은 혼돈의 결정':
    'Active:\r\nCorrupts target monster. (Does nothing special. Probably just something to be of use in later content?)\r\nCooldown: 180 seconds',
  '도토리 폭탄':
    'Active:\r\nOn use, launches an Acorn Bomb dealing (500 + MAIN STAT X 25) magic damage and stuns for 2 seconds\r\nCooldown: 30 seconds\r\nDoes not stun bosses',
  안경: 'Passive:\r\nEnhances your field of sight at night to be the same as day-time.\r\n',
  '종말의 배낭':
    "Active:\r\nOn use, throws Eitr\r\nIncreases target's damage output by 7.5% for 15 seconds\r\nEitr duration: 30 seconds\r\nCooldown: 15 seconds, cannot be dropped during cooldown",
  '폭발의 배낭':
    'Active:\r\nOn use, obtains Throw Bomb\r\nReplaces Throwing Healing Potion with Throw Bomb. Use again to revert back\r\nCooldown: 2 second',
  '절망의 배낭':
    'Active:\r\nOn use, obtains Throw Bomb\r\nReplaces Throwing Healing Potion with Throw Bomb. Use again to revert back\r\nCooldown: 2 second',
  '만물의 배낭':
    'Active:\r\nOn use, throws Elixir\r\nElixir restores 100% of max HP and clears debuffs on consumption\r\nLasts 60 seconds on ground\r\nCooldown: 15 seconds, cannot be dropped during cooldown',
  '암흑의 검': 'Passive:\r\n10% Chance to amplify ATK DMG by 2x for 5 seconds on attack\r\n',
  '암흑의 지팡이': 'Passive:\r\nIncreased MP regen\r\n',
  '암흑의 활': 'Passive:\r\n10% Chance to amplify ATK DMG by 2x for 5 seconds on attack\r\n',
  '극염의 검': 'Passive:\r\n10% Chance to amplify ATK DMG by 2x for 5 seconds on attack\r\n',
  '극염의 지팡이': 'Passive:\r\nIncreased MP regen\r\n',
  '극염의 활': 'Passive:\r\n10% Chance to amplify ATK DMG by 2x for 5 seconds on attack\r\n',
  '극염의 소총': 'Passive:\r\n10% Chance to amplify ATK DMG by 2x for 5 seconds on attack\r\n',
  '극독의 검': 'Passive:\r\nInflicts poison that periodically deals 1500 damage on attack\r\n',
  '극독의 장검': 'Passive:\r\nInflicts poison that periodically deals 1500 damage on attack\r\n',
  '극독의 장갑': 'Passive:\r\nInflicts poison that periodically deals 1500 damage on attack\r\n',
  '극독의 지팡이': 'Passive:\r\nInflicts poison that periodically deals 1500 damage on attack\r\n',
  '극독의 활': 'Passive:\r\nInflicts poison that periodically deals 1500 damage on attack\r\n',
  '극독의 소총': 'Passive:\r\nInflicts poison that periodically deals 1500 damage on attack\r\n',
  '진 용검 라인하르트':
    "Passive:\r\n10% Chance to activate Dragon's Strike on attack dealing (15000 + MAIN STAT X 10) magic damage\r\n",
  '진 용봉 이레이브':
    'Active:\r\nOn use, activates True Mana Cannon\r\nShoots out a blast mana in a straight line dealing (INT X 100) magic damage\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  '진 용궁 에이엔스':
    "Passive:\r\n10% Chance to activate Dragon's Strike on each attack dealing (15000 + MAIN STAT X 10) magic damage\r\n",
  '진 용포 벨레누스':
    "Passive:\r\n10% Chance to activate Dragon's Breath on attack dealing (15000 + MAIN STAT X 10) magic damage\r\n",
  '기생의 검':
    'Passive:\r\n30% Chance to use Splash effect on attack and 15% chance to steal 600 HP\r\n',
  '촉수의 지팡이': 'Passive:\r\nRestores 500 HP and MP on kill\r\n',
  '독의 지배검 라크샤': 'Passive:\r\nDeals 3000 bonus poison damage on attack\r\n',
  '스태프 오브 보이드':
    'Passive:\r\nOn skill cast, empower nearby allies with 6% SKILL DMG and 150 HP regen for 4 seconds\r\n',
  '괴물의 손아귀':
    'Passive:\r\n20% chance to activate Devour on attack\r\nCauses your attack to splash in a 375 radius and restore 1000 hp\r\n',
  '피의 지배검 테페시아': 'Passive:\r\nOn attack, heals for 18% of DMG DEALT (max 1500)\r\n',
  '진 혈포 체페슈': 'Passive:\r\nOn attack, heals 18% of DMG DEALT (max 1500)\r\n',
  '스태프 오브 매드니스':
    'Passive:\r\nOn skill cast, empower nearby allies with 7.5% SKILL DMG and 200 HP regen for 6 seconds\r\n',
  '작렬의 장검 리오레우스':
    'Passive:\r\n10% Chance to activate Conflagration on attack. Deals ((16000 + STR X 12) X flame affinity) magic damage\r\n',
  '크림슨 펌킨 로드':
    'Passive:\r\nOn skill cast, increase INT by 50, flame affinity by 1.5% for 4 seconds (stacks up to 5 times)\r\nActive:\r\nOn use, activates Throw Crimson Pumpkin. Hits target for (50000 + INT X 125) magic damage and stuns for 1.5 seconds\r\nAlso heals user for 15000 HP\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  '드래곤 블래스터':
    'Active:\r\nOn use, activates Dragon Blast\r\nDeals ((AGI X 125) + 4% max HP) magic damage on collision\r\nCooldown: 60 seconds, cannot be dropped during cooldown',
  '레드 크로스':
    'Active:\r\nOn use, activates Blood Purge\r\nDeals (AGI X 25) magic damage and heals allies for (INT X 2.5)\r\nCooldown: 12 seconds, cannot be dropped during cooldown',
  '진 마검 엑시멜리아':
    'Passive:\r\n10% Chance to activate Dark Strike on attack\r\nDeals (AGI X 12) magic damage\r\n',
  '혈혼검 테페시아':
    'Passive:\r\nActivates Blood Release on every 14th attack\r\nHeals user for (2500 + MAIN STAT X 0.6) HP and proccing a random Wrath effect\r\nRed Wrath: deals (MAIN STAT X 27.5) magic splash damage\r\nGreen Wrath: reduces target MOV and ATK SPD by 66% for 3 seconds, deals (MAIN STAT X 15) magic splash damage, and stuns non-boss units for 0.25 seconds\r\n',
  '스톰 리버':
    'Passive:\r\n~11.1% Chance to slam down lightning on attack dealing (20000 + AGI X 10) magic damage\r\n~11.1% Chance to Awaken for 6 seconds on skill cast\r\nWhile Awakened, increases MOV and ATK SPD by 50% and gives a ~33.3% chance to deal (30000 + AGI X 15) magic damage\r\n',
  '진 성검 카론프니엠':
    'Passive:\r\n10% Chance to activate Holy Strike on attack\r\nIf primary stat on hero is STR: deals (STR X 12) magic damage\r\nIf primary stat on hero is AGI or INT: deals (AGI X 12) magic damage\r\n',
  '환검 바하나르':
    'Passive:\r\n(8 + HIT COUNT X 0.2)% Chance to activate Grace Tear on attack\r\nDeals ((MAIN STAT X 15) + (ATK DMG DEALT X 3)) magic splash damage and stuns for 0.1 seconds\r\n',
  '플레임 소울':
    'Passive:\r\n10% Chance to activate Crimson Flame on attack\r\nDeals (ATK DMG + STR X 6) magic damage\r\nAlso increases STR by 50 for each stack up to a max of 8 times\r\n',
  '피의 진혼창 상귀엘':
    'Passive:\r\nActivates Blood Release on every 14th attack\r\nHeals user for (2500 + MAIN STAT X 0.6) HP and activates a random Wrath effect\r\nRed Wrath: deals (MAIN STAT X 27.5) magic splash damage\r\nGreen Wrath: reduces target MOV and ATK SPD by 66% for 3 seconds, deals (MAIN STAT X 15) magic splash damage, and stuns non-boss units for 0.25 seconds\r\n',
  '진 성봉 클레네티아':
    'Active:\r\nOn use, activates Holy Explosion\r\nDeals (INT X 75) magic damage around the user, stunning for 1 second\r\nCooldown: 75 seconds',
  '대지의 기둥 벤지이나':
    'Active:\r\nOn use, activates Twisting Earth in a selected 450 radius\r\nRestores 10% max HP per 0.5 seconds of allies within the area for 10 seconds\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  '아이시클 스톰':
    'Passive:\r\nApplies bonus (water affinity X (AGI X (0.75 ~ 1.25))) magic damage and a slow effect on attack for 0.75 seconds.\r\n~8.3% Chance to launch to target 5 icicles on attack\r\nEach icicle deals (water affinity X (AGI X (4 ~ 6))) magic damage\r\n',
  '진 마궁 알카테':
    'Passive:\r\n10% Chance to activate Dark Spike on attack\r\nDeals (AGI X 12) magic damage\r\n',
  '진 성포 이아나':
    'Passive:\r\n10% Chance to activate Holy Bullet on attack\r\nIf primary stat on hero is STR: deals (STR X 12) magic damage\r\nIf primary stat on hero is AGI or INT: deals (AGI X 12) magic damage\r\n',
  '심판의 탄환 레투스':
    'Passive:\r\nEmpowers next attack with Iron Bullet every 8 seconds\r\nNext attack deals (ATK DMG + AGI X 50) magic damage and stuns for 0.375 seconds\r\n',
  '정령의 비수':
    "Passive:\r\nActivates Breath of Ancients every 4 seconds\r\nNext attack deals ((STR + AGI + INT) X 7.5) magic damage\r\nNext attack also has a 20% chance to crit for 2 times the normal damage\r\nAlso reduces target's MOV SPD by 20% for 3 seconds\r\n",
  '독의 고대검 라크샤':
    'Passive:\r\nEmpowers next attack with poison on casting skill\r\nOn attack, gain a stack point up to a max of 10 stacks\r\nNext attack deals (AGI X (stacks X 0.5)) magic damage\r\nActive:\r\nOn use, activates Unleash\r\nDeals (AGI X (stacks X 12.5)) magic damage and resets the stack points\r\nCooldown: 100 seconds, cannot be dropped during cooldown',
  '천 마검 아스모데우스':
    'Passive:\r\n15% Chance to activate Chaos Strike on attack\r\nDeals ((STR + AGI) X 15) magic damage\r\n',
  '진 환검 바하나르':
    'Passive:\r\n(8 + HIT COUNT X 0.2)% Chance to activate Grace Tear on attack\r\nDeals ((MAIN STAT X 20) + (ATK DMG DEALT X 3)) magic splash damage and stuns for 0.1 seconds\r\n',
  데스브링어:
    'Active:\r\nOn use, activates Hand of Death\r\nDeals ((7.5% max HP) + (STR X 25) + (INT X 50)) magic splash damage and stuns for 1 second\r\nIncreases STR and INT by 650 and ATK DMG by 15000 for 15 seconds\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  분노:
    "Passive:\r\n25% Chance to activate Devastation on attack\r\nDeals (STR X 60) magic damage to enemies in a frontal cone and reduce their armor by 200 for 6 seconds\r\nCooldown: 5 seconds\r\nActive:\r\nOn use, activates Rage\r\nIncreases ATK SPD by 50%, STR by 100, and SKILL DMG by 1% per 0.5 ~ 1 seconds while draining user's HP\r\nStacks up to 10 times and drains (800 + seconds elapsed X 400) HP per second\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  '천류의 창 아글라이아':
    'Passive:\r\nActivates Song of Glory on skill cast\r\nIncreases STR by 125 and SKILL DMG by 2.5% per stack for 5 seconds up to a max of 3 stacks\r\n',
  '천 마봉 벨리우스':
    'Active:\r\nOn use, activates Chaos Explosion\r\nDeals (INT X 150) magic damage around the user, stunning for 1 second\r\nCooldown: 75 seconds',
  '트윈 스노우':
    'Passive:\r\nOn skill cast, empowers next attack with ice to deal (INT X 7.5) magic damage and drenches enemy with wetness\r\nIf target is already drenched with wetness, deals (INT X 15) magic damage instead\r\nDamage is affected by ice/water affinity\r\nActive:\r\nOn use, activates Frozen Storm freezing enemies in a targetted area for 4 seconds and dealing (((ice/water affinity X 100) / (INT X 56)) X 8) magic damage for the duration\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  '천 마궁 이드렉트':
    'Passive:\r\n~15.8% Chance to activate Chaos Spike on attack dealing ((STR + AGI) X 15) magic damage\r\n',
  '플레임 익스플로전':
    'Passive:\r\n12.5% Chance to activate Destruction on attack dealing (AGI X 5) magic damage and reduces amor of target by 20 for 10 seconds\r\n',
  '창공의 활 피레스':
    'Passive:\r\nActivates Poem of Wind on attack\r\nFires 1 additional projectile on every attack that deals (10% ATK DMG) pure damage\r\n',
  '천 마포 알카트라츠':
    'Passive:\r\n15% Chance to activate Chaos Bullet on attack dealing ((AGI + STR) X 15) magic damage\r\n',
  '드래곤 버스터':
    'Active:\r\nOn use, activates Dragon Buster, a projectile that explodes in targetted area stunning for 5 seconds\r\nDeals (((MAIN STAT X 75) + (max HP X 2.5%)) X 25%) magic damage for 8 seconds\r\nCooldown: 45 seconds',
  '하이드로 버스터':
    'Passive:\r\nOn healing, activates Healing Water granting healed allies ((INT X 0.2) X water affinity) HP regen for 3 seconds\r\nActive:\r\nOn use, activates Hydro Buster\r\nFor 6 seconds, fires a beam which pushes mobs away and deals (INT X 25) magic damage per second (1000 range)\r\nIf a mob is pushed into terrain, it is stunned for the duration\r\nCooldown: 20 seconds, cannot be dropped during cooldown',
  '데블 블래스터':
    'Active:\r\nOn use, activates Devil Blast, shooting a projectile at the targetted area dealing ((AGI X 175) + (max HP X 6%)) magic damage\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  '파멸의 탄환':
    'Passive:\r\nEmpowers next attack with Bullet of Ruin that deals (((AGI X 50) + (ATK DMG X 4)) X (50% X (stack - 1)) + 1) magic damage every 8 seconds\r\nEmpower lasts for 6 seconds and stuns targets for 0.375 seconds\r\nUp to 2 additional bullets may be loaded for a max of 3 stacks\r\n',
  '크림슨 크로스':
    'Passive:\r\nEmpowers allies upon healing them\r\nEmpowered allies receive: +5% SKILL DMG and healing received for 4 seconds\r\nActive:\r\nOn use, activates Bloody Purge dealing (AGI X 25) magic damage to enemies and healing allies for (INT X 2.5) HP\r\nCooldown: 12 seconds, cannot be dropped during cooldown',
  '베리엘의 손톱':
    'Passive:\r\n(1 + 0.125 X attacks without activation)% Chance to activate Doomsday on attack\r\nDeals (ATK DMG X 10 + (STR + AGI) X 65) magic damage\r\nStuns for 0.1 seconds\r\n',
  '영겁의 검 에스피슈':
    'Passive:\r\n10% Chance to activate Chaos Strike on attack dealing ((STR + AGI) X 37.5) magic damage\r\n',
  '블레이징 소울':
    'Passive:\r\n~20.8% Chance to activate Fervor on casting skill gaining one stack\r\nIncreases ATK DMG by 2500 per stack and deals (ATK DMG X (1 + stack X 20%) + (STR X 10)) magic damage\r\nDamage is affected by flame affinity\r\nStacks expire after 7.5 seconds of not casting a skill\r\n',
  '차원의 지팡이 에테노스':
    'Active:\r\nOn use, activates Dimensional Explosion\r\nDeals (INT X 300) magic damage in targetted area and stuns for 1.5 seconds\r\nCooldown: 60 seconds, cannot be dropped during cooldown',
  '필멸의 활 그리베돈':
    'Passive:\r\n10% Chance to activate Chaos Strike on attack dealing ((STR + AGI) X 37.5) magic damage\r\n',
  '시공의 대포 크로노스':
    'Passive:\r\n10% Chance to activate Chaos Strike on attack dealing ((STR + AGI) X 37.5) magic damage\r\n',
  '데블 체이서':
    'Active:\r\nOn use, activates Devil Chaser dealing ((AGI X 200) + (max HP X 7.5%)) magic damage\r\nCooldown: 75 seconds',
  '핀드 체이서':
    "Active:\r\nOn use activates Fiend Chaser, a wave that breaks shields and deals (AGI X 250 + 7.5% target's max HP) magic damage\r\nCooldown: 75 seconds, cannot be dropped during cooldown",
  '단테스 인페르노':
    'Passive:\r\nEmpowers next attack with Bullet of Ruin every 6 seconds dealing ((AGI X 50) + (ATK DMG X 4)) magic damage per bullet and stuns for 0.25 seconds\r\nUp to 2 additional bullets may be loaded\r\n',
  퍼니셔:
    'Passive:\r\nEmpowers next attack with Bullet of Punishment every 6 seconds dealing ((AGI X 50) + (ATK DMG X 6)) magic damage per bullet and stuns for 0.25 seconds\r\nUp to 3 additional bullets may be loaded\r\n',
  '독의 환상검 라크트리샤':
    'Passive:\r\nEmpowers next attack with True Poison on skill cast dealing (AGI X stacks X 1.3) magic damage per second for a max of 10 stacks\r\nOnce stacks are maxed, deals (AGI X 130) magic damage and stun for 0.375 seconds\r\nActive:\r\nOn use, activates Illusion on next attack received blocking any spells that deal more than 10% of max HP\r\nOn block, reflects damage back to enemy and deals (2 X (min(1, DMG DEALT / (max HP + 10%))) X max HP) magic damage and stuns for 2 seconds\r\nAlso grants user with: up to a max of +1250 AGI and +10% crit chance for 15 seconds\r\nCooldown: 105 seconds, cannot be dropped during cooldown',
  '크림슨 리퍼':
    'Passive:\r\nEvery 14th attack activates Wrath of Blood dealing (MAIN STAT X 40) magic splash damage and heals user for ((MAIN STAT X 60%) + 3000) HP\r\n30% Chance to activate Blood Awakening on casting skill to increase AGI by 800 and empower Wrath of Blood for 7.5 seconds\r\nWhile empowered, Every 5th attack activates Empowered Wrath of Blood:\r\nDeals (1.25 X MAIN STAT X 40) magic splash damage\r\nHeals user for ((MAIN STAT X 90%) + 4500) HP\r\nHeals nearby allies for ((MAIN STAT X 45%) + 2250) HP\r\nBlood Awakening cooldown: 15 seconds, cannot be dropped during cooldown\r\n',
  '빛의 검 오케아노스':
    "Passive:\r\nOn skill cast, gain a stack and empower next attack with light (up to a max of 6 stacks)\r\nNon-empowered attacks have ~9% chance to deal (MAIN STAT X (15 + stacks X 4)) magic damage\r\nEmpowered attacks deal (2.5 X MAIN STAT) pure damage and has user's crit chance to crit for 2.5 times the normal amount\r\nEmpowered attacks also heal user for 3% of DMG DEALT (affected by crit damage)\r\nActive:\r\nOn use, activates Trail of Light sending (stacks X 2) daggers to target. Each dagger deals (MAIN STAT X 12.5) magic damage\r\nCooldown: 80 seconds, cannot be dropped during cooldown",
  망각:
    "Passive:\r\n25% Chance to activate Devastation on attack causing enemies within a frontal cone area to take (STR X 80) magic damage\r\nReduces armor by 225 and MAGIC DEF by 2% for 6 seconds\r\nCooldown: 5 seconds\r\nActive:\r\nOn use, activates Oblivion granting the user with 75% ATK SPD, 150 STR, and 1.5% SKILL DMG per 1 ~ 0.5 seconds while draining user's HP\r\nStacks up to 10 times and drains (1500 + seconds elapsed X 500) HP per second\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  '겨울의 심장':
    'Passive:\r\nEvery 8th attack activates Everfrost Blast dealing ((STR X 3) + (AGI X 2)) pure splash damage\r\nDamage is affected by ice/water affinity\r\nCounts as a single target\r\nActive:\r\nOn use, activates Frozen Break that launches a projectile that deals (max MP X 4.5) magic damage and breaking any shields in targetted area\r\nIf projectile hits an ally, gives them a (max HP X 30%) shield for 5 seconds\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  '천영의 환검 미크로네이서':
    'Passive:\r\n(8 + HIT COUNT X 0.2)% chance to activate Grace Tear on attack\r\nDeals ((MAIN STAT X 30) + (ATK DMG DEALT X 3)) magic splash damage and stuns for 0.1 seconds\r\nActive:\r\nOn use, activates Grand Forte\r\nSlams the ground 6 times around user and deals ((MAIN STAT X 130) / 12) magic damage and stunning for 0.125 seconds on each slam\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  '번개의 창 티베리우스':
    "Passive:\r\nOn skill cast, gain a stack and empower next attack with lightning (up to a max of 6 stacks)\r\nNon-empowered attacks have a ~12.8% chance to deal (MAIN STAT X ((stacks X 4) + 10)) pure damage\r\nEmpowered attacks deal ((MAIN STAT X 2.5)) pure damage and has user's crit chance to crit for 2.5 times normal amount\r\nEmpowered attacks also heal user for 3% of DMG DEALT (affected by crit damage)\r\nDamage is affected by wind/lightning affinity\r\nActive:\r\nOn use, activates Spear of Deity sending (stacks X 2) spears to target. Each spear deals (MAIN STAT X 12.5) magic damage and stuns for 0.125 seconds\r\nCooldown: 80 seconds, cannot be dropped during cooldown",
  '블레이징 하트':
    'Passive:\r\nOn skill cast, gain a stack and activate Burning Fervor giving user +500 STR and 100% MOV and ATK SPD (up to a max of 5 stacks)\r\nEach stack grants user with +100 STR and +1500 damage. Stat increase lasts for 9 seconds\r\nFirst stack can only be gained by casting, every stack after is gained on attack\r\nWhile Burning Fervor is active, has a ~20.8% chance to gain another stack and deal ((((stack X 30%) + 1.5) X base ATK DMG) + (STR X 15)) magic damage on attack\r\nDamage is affected by flame affinity\r\nBurning Fervor cooldown: 15 seconds, cannot be dropped during cooldown\r\n',
  루인브링어:
    "Passive:\r\nOn skill cast, gains a stack and activate Ruin, increasing user's damage by 1500, STR and INT by 75, and SKILL DMG by 1% for each stack up to a max of 10 stacks\r\nLasts for 5 seconds\r\nActive:\r\nOn use, activates Ruinbringer dealing (((STR X 40) + (INT X 80)) + (max HP X 7.5%)) magic splash damage and stuns for 1 second\r\nAlso grants the user max stacks, increasing stats accordingly\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  '대지의 영혼 벤지이나':
    'Active:\r\nOn use, activates Twisting Earth\r\nHeals allies for (7.5% max HP) per 0.5 seconds in the targetted area for 10 seconds (450 radius)\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  '핏빛 증오':
    'Passive:\r\nTemporarily increase INT by 150, flame affinity by 2% on casting skill for 6 seconds (Stacks up to 5 times)\r\nActive:\r\nOn use, activates Eye of Hatred\r\nEvery 0.125 seconds sends a projectile dealing (INT X 12.5) magic damage and stun for 0.5 seconds for a total of 16 projectiles\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  '스태프 오브 어비스':
    'Passive:\r\nOn skill cast, empowers nearby allies with +10% SKILL DMG and +250 HP regen for 8 seconds\r\n',
  '지배자의 지팡이':
    "Passive:\r\nINT increased by 100 per 1 nearby self-owned summon\r\nActive:\r\n'Summon Watcher' (has an HP Regen of 4000 HP/S)",
  '헬 라이서':
    "Passive:\r\n'Source of Death' On skill cast gives 375 Int and 10,000 Damage for 4 seconds (12 second CD)\r\nActive:\r\n'Song of Despair' Do 15x ATK DMG + 75x Int damage and lowers Magic Resistance of enemies by 6% for 8 seconds in an AoE",
  '트리플 스노우':
    'Passive:\r\nOn skill cast, empowers next attack\r\nDeals (INT X 20) magic damage and slows target\r\nActive:\r\nOn use, activates Glacial Storm\r\nFreezes enemies in targetted area for 4 seconds\r\nDeals ((water affinity X 100 / (INT X 56)) X 8) magic damage over duration\r\nCauses enemies to take (INT X 2) pure damage when they are attacked by you or your allies\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  '대지의 심장 벤지이나':
    'Passive:\r\nOn skill cast, activates Restoration\r\nApplies to self and a nearby hero with the lowest HP\r\nHeals (10000 + INT) HP and reduces DMG TAKEN by 12% for 9 seconds\r\nCooldown: 3 seconds\r\nActive:\r\nOn use, activates Warping Earth\r\nHeals allies for (7.5% max HP) per 0.5 seconds in targetted area for 10 seconds (450 radius)\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  심장추적자:
    'Passive:\r\nEmpowers next attack with Corrupt Arrow every 6 seconds\r\nCorrupt Arrow deals (AGI X 120) magic damage to target and (AGI X 80) magic damage to enemies around the target\r\nAlso it heals user for 15% max HP\r\nCooldown: 20 seconds, cannot be dropped during cooldown\r\n',
  소울스토커:
    'Passive:\r\n10% Chance to activate Soul Reaping on attack dealing (MAIN STAT X 50) magic damage\r\n',
  헬플레임:
    'Passive:\r\n15% Chance to activate Hellflame on attack that burns the target\r\nDeals (AGI X 15) magic damage per second for 10 seconds\r\nIncrease magic DMG TAKEN of target by 2% for 5 seconds\r\n',
  '에버프로스트 베인':
    "Passive:\r\nHit enemies with an icicle on every attack (1.5-2x Agi Damage [Damage is variable])\r\n'Ice Cyclone' 8% chance to activate on attack dealing AoE Damage (40-60x Agi Damage [Damage is variable] 9 second CD)\r\n",
  '크림슨 스타':
    'Passive:\r\nEmpowers allies upon healing them with 7.5% SKILL DMG and Healing Received.\r\nActive:\r\nOn use, activates Bloody Baptism.\r\nThrows 3 waves of blood to target area, each dealing INT X 20 damage and heals INT X 1.5 HP per second for 2 seconds\r\nCooldown: 12 seconds, cannot be dropped during cooldown',
  '데스 비사쥬':
    'Active:\r\nOn use, activates Death Vengeance\r\nIf HP is below 40%, increases MAIN STAT by 450 for 8 seconds, heals 40% max HP and stuns nearby enemies for 1 second\r\nIf HP is above 40%, increases MAIN STAT by 350 for 8 seconds\r\nRegardless of HP percentage, increases CRIT MULT by 0.10 for 8 seconds\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  '그림 비사쥬':
    'Active:\r\nOn use, activates Grim Vengeance\r\nIf HP is below 40%, increases MAIN STAT by 600 for 8 seconds, heals 70% max HP, deals (MAIN STAT X 75) magic damage and stuns nearby enemies for 1.5 seconds\r\nIf HP is above 40%, increases MAIN STAT by 450 for 8 seconds\r\nRegardless of HP percentage, increases CRIT MULT by 0.20 for 8 seconds\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  '후드 오브 리퍼':
    "Passive:\r\n'Possession' Triggers when Health is low healing you and giving Int for a brief period (20 second CD)\r\n",
  '진 용투 아그론': 'Active:\r\nAnti-Magic Shield (self) (300 second CD)',
  '후드 오브 그림 리퍼':
    "Passive:\r\n'Possession' Triggers when Health is low healing you and giving 750 Int for a brief period (20 second CD)\r\nActive:\r\nTurn invisible temporarily",
  '전장의 투구':
    "Passive:\r\nDamage dealt by attack +10%\r\nIncreases nearby allies' speed and HP regen\r\nActive:\r\nBlock magic every 4 minutes\r\nLasts 5 seconds",
  '파괴의 뿔':
    'Active:\r\nOn use, discharges a powerful beam of destruction dealing (MAIN STAT X 100) magic damage\r\nReduces armor of hit targets by 200 (Type-A)\r\nStuns for 1 second\r\nCooldown: 150 seconds, cannot be dropped during cooldown',
  '대천사의 헤일로':
    'Passive:\r\nDamage dealt by attack +12.5%\r\nActive:\r\nBlock magic every 3 minutes\r\nLasts 5 seconds',
  '마력의 원천 프로피티아':
    'Active:\r\nTemporarily increases INT by 750 and max MP by 5000 on use for 8 seconds',
  '나락의 눈':
    'Passive:\r\nIncreases nearby allies SKILL DMG by 4%\r\nActive:\r\nSummons 6 flying hell minions',
  '악마의 뿔':
    "Passive:\r\nUpon moving 3000 distance, unlesash Devil's Flame on next attack\r\nDeals (MAIN STAT X 20) pure damage\r\nCooldown: 5 seconds, cannot be dropped during cooldown\r\n",
  '뇌신의 뿔':
    "Passive:\r\nUpon moving 3000 distance, unleash Lightning God's Wrath on next attack\r\nDeals (MAIN STAT X 25) pure damage\r\nCooldown: 5 seconds, cannot be dropped during cooldown\r\n",
  '드래곤 마스크':
    'Active:\r\nOn use, activates Madness of Dragon for 15 seconds:\r\nInitially increases MAIN STAT by 600, crit multiplier by 0.20, and HP regen by 2000\r\nWhile active, every skill cast increases the bonuses above by 10% up to 10 times\r\nCooldown: 50 seconds, cannot be dropped during cooldown',
  '왈라키아의 눈':
    'Passive:\r\n25% chance to activate Eye of Death on attack\r\nIncreases crit multiplier by 0.20, ATK DMG by 15%, and AGI by 750 1 second after proc for 6 seconds\r\nCooldown: 15 seconds, cannot be dropped during cooldown\r\n',
  '윌 오브 프로텍터':
    'Passive:\r\n25% chance to restore 5% HP and 10% MP on taking damage\r\nCooldown: 3 seconds, cannot be dropped during cooldown\r\nActive:\r\nIncrease nearby allies Magic Resistance by 40% for 12 seconds\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  '심판의 헤일로':
    'Passive:\r\nDMG DEALT by attack +15%\r\nOn attack, activates Judgment\r\nAdds 1 stack every 0.75 seconds with a max stack of 3\r\nConsume 1 stack on attack and deal (MAIN STAT X 3.75) pure damage on attack\r\nActive:\r\nBlock magic every 1 minute and 30 seconds\r\nLasts 5 seconds',
  '대마력의 원천 프로피티아':
    'Active:\r\nTemporarily increases INT by 1000 and SKILL DMG by 5% on use for 8 seconds',
  '후드 오브 아포크리파':
    'Active:\r\nOn use, activates Apocryphos and turns the user invisible for 3 seconds\r\nHeals self for 40% max HP and allies for (INT X 15% max HP)\r\nStuns nearby enemies for 0.5 seconds\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  '청명의 화관':
    'Passive:\r\nUpon healing an ally, 15% chance to activate Serenity\r\nGrants 5% SKILL DMG and heals (2% max HP of target + INT X 0.125) HP and (1% max MP) every 0.5 seconds for 5 seconds\r\n',
  '진노의 화관':
    'Active:\r\nOn use, activates Refined Power\r\nConsumes 40% of current HP and grants the following for 15 seconds:\r\n(1.25% of consumed HP) all stats\r\n(2 X (1.25% of consumed HP)) MAIN STAT\r\n5% flame affinity\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  '냉정의 화관':
    'Active:\r\nOn use, activates Composure\r\nIncreases SKILL DMG by 7.5% and all stats by 375 for 12 seconds\r\n20% chance to freeze nearby enemies for 12 seconds\r\nCooldown: 100 seconds, cannot be dropped during cooldown',
  '감염된 크랩 아머':
    'Passive:\r\n10% chance to reflect (STR X 5) Pure Damage and 90% chance to return (STR X 0.5) Pure Damage\r\nImproved HP regen\r\n',
  '소중한 바람막이 털옷': 'Passive:\r\nDodge a fatal attack once every 45 seconds\r\n',
  '혈석 갑주':
    "Active:\r\n'Bloodstone Form' Increase Health and Mana Regeneration by 7,500, gain 7.5% MAIN STAT, and get a shield for 4x MAIN STAT for 2 seconds (40 second CD)",
  '진 용갑 마그론': 'Passive:\r\nBlock 300 damage every hit\r\n',
  '리액티브 아머':
    'Passive:\r\nReflects damage when hit\r\nReleases a powerful blast upon taking enough damage\r\n',
  '로브 오브 세이지':
    'Passive:\r\nImproved MP regen\r\nActive:\r\nAnti-Magic Shield (self) (4 min CD)',
  '진 혈석 갑주':
    "Passive:\r\nBlock 250 Damage every hit\r\nActive:\r\n'Bloodstone Form' Increase Health and Mana Regeneration by 7,500, gain 7.5% MAIN STAT, and get a shield for 4x MAIN STAT for 2 seconds (40 second CD)",
  '퓨어라이트 아머': "Passive:\r\nIncreases nearby allies' stats by 5% (Self not included)\r\n",
  '피의 갑주 크루오리스':
    'Passive:\r\nIncreases max HP in combat\r\nStores 1% of DMG DEALT, max of AGI X 2\r\nActive:\r\nReleases the blood stored within Cruoris on use\r\nDeals (stored HP X 30) magic damage to nearby enemies\r\nAlso increases AGI by 15% for 12 seconds (max of 1000 AGI)\r\nCooldown: 150 seconds, cannot be dropped during cooldown',
  '대지의 각갑':
    'Passive:\r\nGrants greatly accelerated Health Regeneration when Health is low\r\n',
  '수호의 도복': 'Passive:\r\nCreates a barrier that absorbs 5000 damage every 8 seconds\r\n',
  '요정의 예복': 'Active:\r\nSummons a Fairy Spirit',
  '프로즌 로브': "Active:\r\n'Frozen Protection' Absorbs up to (6 X Int) damage (75 second CD)",
  '탄식의 갑주 레퀴엠':
    "Passive:\r\nIncreases nearby allies' stats by 5% (Including self)\r\nEvery 8 seconds, activates one of Hatred, Oblivion and Obsession buffs\r\n",
  천지창조:
    'Active:\r\nOn use, activates La Pucelle\r\nGrants all nearby allies with 100% MAGIC DEF for 4 seconds\r\nHeals user for 25% HP per second\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  '망령의 튜닉':
    'Passive:\r\nActivates when HP drops below 15%\r\nReduces DMG TAKEN by 90% for 3 seconds and instantly heal for 25% max HP\r\nCooldown: 60 seconds, cannot be dropped during cooldown\r\n',
  '선혈의 갑주 베네딕트':
    'Passive:\r\nIncreases max HP in combat by 1%\r\nUp to AGI X 2 max HP and provides 1.5% HP regen\r\nActive:\r\nOn use, activates Force Break\r\nReleases stored HP and deals (stored HP X 20) pure damage to enemies around user\r\nIncreases AGI by 15% and SKILL DMG by 5% for 12 seconds\r\nStuns for 1.5 seconds\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  '망령의 갑주 그란디네':
    'Passive:\r\nActivates Grandine when HP drops below 20%\r\nGain 90% damage reduction for 3 seconds and instantly heal for 35% max HP\r\nFor the next 3 seconds, heal 6% max HP per second\r\nCooldown: 60 seconds, cannot be dropped during cooldown\r\n',
  '헬스파이크 아머':
    "Passive:\r\n'Hellspike' Reflect 100% of your Max HP as pure damage when hit to all enemies within 200 range (3 second CD)\r\n'Hellspike Eruption' As you take more damage the armor will charge until you've received 125% Max Health total damage. Upon reaching full charge all nearby enemies will receive (3000% your Max HP) in damage and be stunned for 1 seconds. You can accumulate up to 50% charge in a single attack. (5 second CD)\r\nActive:\r\n'Hellspike' Deal 20% of your Max HP to yourself and 100% of Max Health as pure damage to nearby enemies . (3 second CD)",
  '혈혼의 갑주':
    "Active:\r\n'Blood Armor' Absorb up to (10,000 + Max Health x 20%) Damage over next 5 seconds. When damage is absorbed does 100x MAIN STAT to enemy, heals 20% Max Health and heals mana equal to absorbed damage. (20 second CD)",
  '프로스트샤드 아머':
    'Passive:\r\nActivates Frostshard when HP drops below 40%\r\nGrants 10% STR, 7.5% damage reduction for 12 seconds and restores 17.5% max HP\r\nDeals (STR X 40) magic damage around user in a 325 radius (damage is affected by water affinity)\r\nReduces MOV and ATK SPD of affected enemies by 75% for 2 seconds\r\nCooldown: 8 seconds, cannot be dropped during cooldown\r\n',
  '드루이드의 가운':
    'Passive:\r\nSummons a forest spirit every 5 seconds, each spirit provides 0.75% hp regeneration, can have up to 4 spirits\r\nActive:\r\nOn use, sends one spirit towards target\r\nIf target is enemy it deals 40 X int damage\r\nIf target is ally it restores 2.5 X int hp\r\nCannot target self, activates single-target effects',
  '로브 오브 네크로맨서':
    "Active:\r\nOn use, summons Magic Barrier granting the user with magic immunity\r\nAlso increases nearby allies' magic defense by 40% for 5 seconds (225 radius)\r\nCooldown: 120 seconds, cannot be dropped during cooldown",
  '윈터 로브':
    'Active:\r\nOn use, activates Everfrost Soul\r\nForms a shield that blocks damage equal to (INT X 8) for 8 seconds\r\nConstantly rains frostbolts around user in a 350 radius\r\nEach frostbolt deals (INT X 10) magic damage and stuns non-boss mobs for 1s\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  '성녀의 로브 다이아나':
    'Passive:\r\nIncreases nearby allies SKILL DMG by 6% & MAGIC DEF by 8%\r\nActive:\r\nOn use, activates Prayer of Holy Maiden\r\n7 spiral waves shoot outwards from the user while immobilizing the user (can use dash spells)\r\nRestores (INT X 1.5) HP to all nearby allies per wave\r\nDeals (INT X 25) magic damage to all nearby enemies for 6 waves\r\n7th wave deals (INT X 50) magic damage\r\nApplies a shield of (15000 + INT X 5) to user for 4.2 seconds\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  '마녀의 로브 메데이아':
    "Passive:\r\nOn skill cast gives an orb. Each orb increases INT by 100 and 1% SD. 50% chance to get 2 orbs on skill cast instead of one. (Max 4 orbs)\r\nActive:\r\n'Witch Time' Increase Int by 500 and 6% SKILL DMG. Gain 1 orb every second and passive can trigger more orbs. During buff, each skill cast will consume all current orbs to deal 25x Int damage per orb in an AoE centered on nearest boss (if no boss, nearest enemy), lasts 6 seconds. (90 second CD)",
  '과일맛 사탕 주머니':
    'Active:\r\nOn use, throws out 5 random candies which rapidly heal the user over 4 seconds\r\nGrape Flavored Candy: Increases INT by (LVL / 2 + 50)\r\nBlueberry Flavored Candy: Increases AGI by (LVL / 2 + 50)\r\nApple Flavored Candy: Increases STR by (LVL / 2 + 50)\r\nDuration: 15 minutes, cooldown: 120 seconds\r\nCooldown of pouch: 180 seconds, cannot be dropped during cooldown',
  '촉수의 뿔피리':
    'Active:\r\nSpawns tentacles around the caster throwing units into the air, stunning them and healing the caster',
  '피의 반지 테페루아': 'Active:\r\nRestore health in a nearby AoE (60 second CD)',
  '빛의 반지 세인트': "Passive:\r\n'Holy Wings' Increase nearby allies armor by 200\r\n",
  '현자의 반지':
    'Active:\r\nResets the last ability cast, and gain increased Mana Regeneration for 18 seconds (Does not apply to ultimate skill or items) (135 second CD)',
  '마나 하트 프로스트': 'Passive:\r\nImproved MP regen\r\nFrost effect on attack\r\n',
  '사신의 반지': 'Active:\r\nConverts DMG TAKEN into Health for 2 seconds',
  '퓨어프로스트 건틀릿': 'Passive:\r\nApplies Frost effect on attack\r\n',
  '리빙 드래곤 하트':
    "Passive:\r\nIncrease nearby allies' MOV SPD and gives them +150 Health Regeneration\r\nActive:\r\nInflicts INT X 30 damage to enemies in 600 AoE, and summons a dragon (150 second CD)",
  '신성한 빛의 반지':
    "Passive:\r\nIncreases nearby allies' Armor by 200 and HP by 3000\r\nOn skill cast, gathers Holy Light\r\nStacks for a max of 5\r\nLasts for 8 seconds\r\nActive:\r\nOn use, releases Holy Light and heals all allies in a 600 radius\r\nHeals (0.20 X (STR + AGI + INT) X stacks) HP\r\nCooldown: 10 seconds",
  '마왕의 반지 데모니스': 'Passive:\r\nIncrease nearby allies Armor by 300\r\n',
  '소울 드링커': 'Active:\r\nDMG DEALT in the next 6 seconds is partially converted into Health',
  '혼돈의 반지 라테아':
    "Passive:\r\nDecreases nearby enemies' armor by 75\r\n'Absolute Protection' Chance to activate when hit blocking all damage received from that attack\r\n",
  '잠식의 반지':
    'Active:\r\nResets the last ability cast (Does not apply to ultimate skill or items) and gives you 1200 mana regeneration for 10 seconds. (105 seconds CD)',
  '이프리트의 심장':
    'Passive:\r\n12% chance to reduce enemy armor by 225 on attack for 5 seconds\r\n',
  '트루블러드 링': 'Active:\r\nHeals for 30% of Max Health',
  '혼돈의 파이프 아자토스':
    "Passive:\r\nIncreases nearby allies' stats\r\nATK SPD by 10%\r\nATK DMG by 4000\r\nHP regen by 200\r\n",
  '이터널 로즈':
    'Passive:\r\nIncrease nearby allies Magical Resistance by 8% (Aura Range 1,200)\r\nActive:\r\nShields nearby allies for (5x Int + 20% Health) damage for 5 seconds. (60 second CD)',
  '빛의 종':
    "Passive:\r\nIncreases nearby allies' armor by 300 and HP by 5000\r\nOn skill cast, gathers Holy Light up to 5 times.\r\nStacks last for 8 seconds\r\nActive:\r\nOn use, releases Holy Light\r\nHeals all allies within 600 radius for (stacks X 0.30 X (STR + AGI + INT)) HP\r\nCooldown: 10 seconds",
  '일격의 반지':
    'Passive:\r\n7.5% Chance to activate Absolute Strike on attack\r\nNext 3 hits will deal an additional (ATK DMG X 2) pure damage\r\nAlso gain 20000 ATK DMG, 1000 MAIN STAT, and 1000 HP regen for 7.5 seconds\r\nAbsolute Strike cooldown: 15 seconds, cannot be dropped during cooldown\r\n',
  '시간의 반지':
    "Passive:\r\nIf HP drops below 1, Heals HP x 40%, then deals the damage that procc'd the effect (CD: 300 Seconds)\r\nIf hero dies immediately after passive is procc'd, cooldown does not start.\r\nActive:\r\n'Time Distortion' Resets the last ability cast (Does not apply to ultimate skill or items) and makes you immune to stuns, silence and knockback for 10 seconds, also regenerate 1500 Mana each second while duration (90 seconds CD)",
  '룬의 반지 이스피온':
    "Passive:\r\nIncreases nearby allies' damage reduction by 6%, healing received by 12%\r\nActive:\r\nOn use, activates Rune Field, placing a 500 radius field around the user that restores 10% max HP per 0.5 seconds of all allies on the field for 5 seconds\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  '시린 죽음의 반지':
    'Active:\r\nOn use, activate Darkness Ray\r\nAbsorbs all DMG TAKEN for 3 seconds and unleashes it around user\r\nDeals (absorbed DMG + ATK DMG X 5) magic damage\r\nCannot exceed 1 million damage\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  '위장자의 인장':
    'Passive:\r\nConverts 0.5% of dealt damage into max HP and MP with a cap of (base STR X 1.5) for HP and (base INT X 1.5) for MP\r\nLasts 6 seconds after the last time you deal damage\r\nActive:\r\nOn use, activates Dark Light, consuming all stored HP and MP\r\nEvery second for 5 seconds, deals ((12 X stored HP) + (20 X stored MP)) magic damage in a 500 radius around user\r\nReduces MOV SPD and ATK DMG by 50% and silences on affected enemies for 1.5 seconds\r\nOn the last second, deals a final damage of ((60 X stored HP) + (100 X stored MP)) magic damage in a 500 radius around user and stuns for 1 second\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  '헤븐즈 피스트':
    "Passive:\r\nEmpowers next attack with Holy Fist every 6 seconds\r\nDeals 3 additional attacks with 200% damage\r\nReduces target's armor by 225 for 3 seconds\r\n",
  '바다의 날개':
    "Passive:\r\n'Revelation' Chance to temporarily increase Experience Gain and Mana Regeneration on kill\r\nActive:\r\nTeleport you to Alfon Village (first town)",
  '드래곤 윙': 'Active:\r\nCreates a portal between Capitol Prius and your current location',
  '백작의 망토':
    'Passive:\r\nWhen casting a spell, empower next attack with darkness (5000 + 2 X MAIN STAT) damage\r\n',
  '굶주린 박쥐 날개':
    'Passive:\r\nUpon moving 400 distance, activates Hungry Drain on next attack\r\nDeals bonus (40% ATK DMG) pure damage and heals for 8% HP\r\nGives 150 HP regen on every proc up to 5 times for 2.5 seconds\r\ncooldown: 0.125 seconds\r\n',
  '타락한 불꽃의 망토':
    'Passive:\r\nSingle-target skill hits engulf target in corrupt flames\r\nDeals 10% additional damage over 3 seconds (effect stacks)\r\n',
  '프로즌 하트': 'Passive:\r\nSlows nearby enemies\r\n',
  '요정의 날개': 'Active:\r\nCreates a portal between Capitol Prius and your current location',
  '진노의 날개':
    'Passive:\r\nWhen casting a spell, empower next attack with Fury\r\nDeals ((MAIN STAT X 2.5) + AGI) pure damage\r\nEmpowered attacks have a 12.5% chance to crit, dealing ((MAIN STAT X 5) + (AGI X 2)) pure damage\r\nEach stack, up to 10, increases AGI by 60 for 7 seconds\r\n',
  '방랑자의 망토': 'Active:\r\nCreates a portal between Capitol Prius and your current location',
  '서리 요정의 날개':
    'Active:\r\nOn use, creates a Magical Passage, connecting your current location to Capital Prius',
  '퓨어 크리스탈 윙':
    'Passive:\r\nOn skill cast, 5% chance to reset all cooldowns (except ultimate), effect triggers 2 seconds after the skill that initiates it (150 second CD)\r\n',
  '불사조의 날개':
    'Active:\r\nOn use, activates Flame Flight\r\nDeals (ATK DMG X 5 + MAIN STAT X 75) magic damage to enemies in targeted area\r\nStuns for 0.5 seconds\r\nMax dash distance of 900\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  '소울 이터':
    'Passive:\r\nPeriodically absorbs nearby souls\r\nAbsorbs 3 souls every 5 seconds that heal you for 2.5% HP and 3% MP each (for a total of 7.5% HP and 9% MP)\r\nActive:\r\nOn use, activates Soul Absorb\r\nHeals user for (30% max HP)\r\nCooldown: 40 seconds, cannot be dropped during cooldown',
  '망자의 영혼':
    'Passive:\r\nResurrect upon death with 40% Health and 100% Mana (180 second CD)\r\nRespawn time reduced by 40%\r\nOn death, deals 275x MAIN STAT to nearby enemies\r\n',
  '타락한 그림자의 망토':
    'Passive:\r\nOn single-target hits, engulfs target with Corruption\r\nDeals 12.5% additional damage over 3 seconds (effect stacks)\r\nReduces MAGIC DEF of targets by 4%\r\n',
  '그림 하트':
    "Passive:\r\nReduces MOV and ATK SPD by 20% of nearby enemies\r\nActive:\r\nOn use, activates Grim Howl\r\nHeals 33% of user's max HP and stuns nearby enemies for 1 second\r\nDecreases target's ATK DMG by 25% for 8 seconds\r\nCooldown: 40 seconds, cannot be dropped during cooldown",
  '학살자의 날개':
    "Passive:\r\nOn skill cast, empowers next attack with Decimation\r\nNext attack deals (MAIN STAT X 1.5 + AGI X 1) pure damage\r\nCan crit based on user's critical chance\r\nEmpowered attack stacks Madness of Slayer\r\nFor 6 seconds increases AGI by 90 (stacks up to 10 times)\r\nOnce max stacks is reached, user can no longer gain more for duration but gains 10% SKILL DMG\r\n",
  '녹슨 곡괭이':
    'Active:\r\nSwings axe to mine ores.\r\nFor 5 minutes, mines 1 ores per 1 second\r\nAvailable ores: Iron Ore, Silver Ore, Gold Ore',
  '튼튼한 곡괭이':
    'Active:\r\nSwings axe to mine ores.\r\nFor 5 minutes, mines 2 ores per 1 second\r\nAvailable ores: Iron Ore, Silver Ore, Gold Ore',
  '녹슨 마법 곡괭이':
    'Active:\r\nSwings axe to mine ores.\r\nFor 5 minutes, mines 1 ores per 1 second\r\nAvailable ores: Worthless Magical Stone, Lesser Magical Stone, Medium Magical Stone, Greater Magical Stone',
  '튼튼한 마법 곡괭이':
    'Active:\r\nSwings axe to mine magical stones.\r\nFor 5 minutes, mines 2 ores per 1 second\r\nAvailable ores: Worthless Magical Stone, Lesser Magical Stone, Medium Magical Stone, Greater Magical Stone',
  '미스릴 곡괭이':
    'Active:\r\nQuickly Swings axe to mine ores.\r\nFor 1 second, mines 10 ores per 0.1 seconds\r\nAvailable ores: Iron Ore, Silver Ore, Gold Ore',
  '심연의 곡괭이':
    'Active:\r\nQuickly Swings axe to mine magical stones.\r\nFor 1 second, mines 10 ores per 0.1 seconds\r\nAvailable ores: Worthless Magical Stone, Lesser Magical Stone, Medium Magical Stone, Greater Magical Stone',
  '혼돈의 곡괭이':
    'Active:\r\nQuickly Swings axe to mine chaos stones.\r\nFor 1 second, mines 10 ores per 0.1 seconds (1 ore for Chaos Magic Stones)\r\nAvailable ores: Worthless Magical Stone, Lesser Magical Stone, Medium Magical Stone, Greater Magical Stone, Chaos Magic Stone',
  '열정의 반지':
    "Passive:\r\nCasting single-target spells on ally applies Fervor\r\nIncreases target's damage by 5% and MAIN STAT by 300 for 12 seconds\r\nActive:\r\nOn use, activates Joy\r\nRestores 40% HP of allies affected by Fervor\r\nCooldown: 30 seconds, cannot be dropped during cooldown",
  '냉정의 반지':
    'Passive:\r\nCasting single-target spells on enemies decreases their magic resistance by 6% (Type-B) for 12 seconds\r\nActive:\r\nDeals water affinity X (0.75% Max HP) pure damage to debuffed enemy and freezes them for 2 seconds\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  '번개의 갑주':
    'Passive:\r\nAfter casting a spell, emits lightning waves around you for 3 seconds, dealing 20 X (STR + AGI) damage to nearby enemies and restoring 2.5% Max HP per second (6s CD)\r\n',
  '탐욕의 손아귀':
    'Passive:\r\n20% chance to activate Devour on attack\r\nCauses your attack to splash in a 375 radius and restore 2500 hp\r\nActive:\r\nOn use, activates Decimation\r\nPulls in all enemies from 300 ~ 800 radius around you, deals (ATK DMG X 40) magic damage and stuns for 2 seconds\r\nCooldown: 60 seconds, cannot be dropped during cooldown',
  '깊은 어둠의 반지':
    'Active:\r\nConsumes 50% of max MP and for 8s grants (mana consumed/80) MAIN STAT and 30% ATK SPD (30s cd)',
  '흑의 마도서':
    'Active:\r\nConsumes 50% of Max Mana and for 10s grants (mana consumed/60) MAIN STAT and 50% ATK SPD (30s cd)',
  '태풍의 도복':
    'Passive:\r\nOn skill cast, activates Wind Fury for 1.5 seconds\r\nNext 2 attacks hit once to deal bonus 50% ATK DMG\r\nIncreases MOV SPD by 300\r\nBonus MOV SPD decreases by half over buff duration\r\n',
  '폭풍의 도복':
    'Passive:\r\nOn skill cast, activates Wind Fury for 1.5 seconds\r\nNext 3 attacks hit once more and deal 50% ATK DMG\r\nIncreases MOV SPD by 300\r\nBonus MOV SPD decreases by half over buff duration\r\n',
  '소생의 반지':
    'Passive:\r\nOn death, revives after 2 seconds with full HP and MP\r\nCooldown: 240 seconds, cannot be dropped during cooldown\r\nActive:\r\nOn use, activates Revival\r\nRestores 50% of HP and MP/RP\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  '광기의 반지':
    'Passive:\r\n12.5% Chance to activate Frenzy on attack\r\nNext 3 hits will deal an additional (ATK DMG X 2) pure damage\r\nAlso gain 25000 ATK DMG, 1250 MAIN STAT and HP regen for 7.5 seconds\r\nFrenzy cooldown: 15 seconds, cannot be dropped during cooldown\r\n',
  '지배자의 반지 라테아':
    "Passive:\r\n20% chance of 20% additional damage\r\n'Absolute Protection' Chance to activate when hit blocking all damage received from that attack\r\n",
  '신의 뿔피리':
    "Passive:\r\nEmpowers nearby allies\r\nIncreases ATK DMG by (INT X 0.6). Max of 6000\r\nIncreases ATK SPD by 15%\r\nHP regen by 400\r\nActive:\r\nOn use, activates Purification\r\nFor 3 seconds, prevents HP from dropping below 1\r\nHeals (0.10 X target's max HP) and removes any debuffs each second for duration\r\nCooldown: 20 seconds, cannot be dropped during cooldown",
  '운명의 반지':
    'Passive:\r\nIf HP drops below 1, activates Time Reversal, restoring HP to 100%\r\nCooldown: 300 seconds\r\nActive:\r\nOn use, activates Time Distortion, resetting the cooldown of the last non-ultimate spell used\r\nAlso increases MP regen by 2500 and provides immunity to stuns, silences, and knockbacks for 10 seconds\r\nCooldown: 75 seconds, cannot be dropped during cooldown',
  '희망의 반지':
    "Passive:\r\nCasting single-target spells on ally applies Passion\r\nIncreases target's damage by 6% and MAIN STAT by 400 for 12 seconds\r\nActive:\r\nOn use, activates Hope\r\nCleanses debuffs from allies and restores 50% max HP of allies affected by Passion\r\nCooldown: 30 seconds, cannot be dropped during cooldown",
  '절망의 반지':
    "Passive:\r\nCasting single-target spells on enemies decreases their magic resistance by 7.5% (Type-B) for 12 seconds\r\nActive:\r\nDeals water affinity X (1% Max HP) pure damage to debuffed enemy, freezes for 3 seconds, and increases allies' DMG DEALT to it by 5% for 2 seconds\r\nCooldown: 30 seconds, cannot be dropped during cooldown",
  '네뷸라 로즈':
    'Passive:\r\nIncrease nearby allies Magical Resistance by 10%\r\nAura range: 1200\r\nActive:\r\nActivates Cosmic Protection, which provides ((INT X 5) + (Max HP X 0.2)) shield to nearby allies for 5 seconds\r\nTargets taking spell damage during shield will gain 4% damage output and 12% damage resistance for 30 seconds\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  '신풍의 반지':
    'Passive:\r\nOn attack, 15% chance to activate Double Attack\r\nOn spellcast, 15% chance to refresh cooldown of that spell\r\nOn casting a stack-based spell, 8% chance to refresh cooldown of that spell\r\nActive:\r\nOn use, teleports user to target location\r\nMax distance: 1200\r\nCooldown: 25 seconds, cannot be dropped during cooldown',
  '데모닉 피스트':
    "Passive:\r\nEvery 5 seconds, empowers next attack with Demon's Grasp:\r\nNext attack hits 5 extra times with 150% ATK DMG each\r\nReduces target's armor by 300 for 3 seconds (Type-A)\r\nHeals user for 7.5% max HP\r\nOnly works on melee attacks\r\nActive:\r\nOn use, empowers next attack with Demon's Grasp\r\nCooldown: 10 seconds, cannot be dropped during cooldown",
  '얼어붙은 영혼의 반지':
    'Active:\r\nOn use, activates Frozen Aegis\r\nProvides immunity to damage and debuffs for 3 seconds\r\nUpon expiration, deals (1000% damage received) pure damage to nearby enemies (max of 1000% max HP)\r\nCooldown: 60 seconds, cannot be dropped during cooldown',
  '죄악의 증표':
    'Active:\r\nOn use, activates Forbidden Magic\r\nConsumes 50% max MP\r\nIncreases MAIN STAT by (MP consumed / 60) and ATK SPD by 50% for 10 seconds\r\nConsumes 1 Evil Magic stack per second and deals (INT X 25) magic damage to nearby enemies\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  '악의 씨앗':
    'Passive:\r\nLanding a spell generates Seed of Malice nearby\r\nAbsorbs when approached, it restores 4000 HP and 10000 MP and adds stack of Evil Magic for 10 seconds\r\nEvil Magic increases damage output by 2% per stack and stacks up to 5 times\r\nCan be generated during Forbidden Magic\r\nCooldown: 4 seconds\r\nActive:\r\nOn use, activates Forbidden Magic\r\nConsumes 50% max MP\r\nIncreases MAIN STAT by (MP consumed / 60) and ATK SPD by 60% for 10 seconds\r\nConsumes 1 Evil Magic stack per second and deals (INT X 50) magic damage to nearby enemies\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  '절대자의 반지':
    'Passive:\r\nOn attack, 20% chance of 25% additional damage\r\nOn skill cast, 15% chance to increase DMG DEALT by 5% for 5 seconds\r\nOn being hit, 10% Chance to activate Absolute Defense blocking all damage to user\r\n',
  '화신의 눈':
    'Passive:\r\nIncreases nearby allies SKILL DMG and ATK DMG by 5%\r\nActive:\r\nSummons 2 Flame Giants\r\nFlame Giant MAGIC DEF: 50%',
  '후드 오브 아포칼립스':
    'Active:\r\nOn use, activates Apocalypse dealing (MAIN STAT X 250) magic damage to nearby enemies\r\nInstantly restores 30% HP of nearby allies and grants them 10% HP regen for 3 seconds\r\nStuns nearby enemies for 1.5 seconds and silences for 3 seconds\r\nAlso lowers affected enemies MOV and ATK SPD by 50% for 3 seconds\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  '지혜의 원천 프로피티아':
    'Passive:\r\nOn spell cast, 7.5% chance to activate Enlightment\r\nRefreshes cooldown of a random spell\r\nActive:\r\nOn use, activates Magical Concentration\r\nIncreases INT by 1250 and SKILL DMG by 5% for 8 seconds\r\nIncreases INT by 100 and SKILL DMG by 0.5% every second\r\nCooldown: 60 seconds, cannot be dropped during cooldown',
  '반신의 가면':
    'Active:\r\nOn use, activates Demigod Infusion\r\nIncreases AGI by 800, critical damage by 0.25 and HP regen by 2000 for 15 seconds\r\nCasting a spell empowers these buffs by 10% (up to 100%)\r\nUsing the [M] hotkey lets you teleport up to 800 distance up to 3 times\r\nCooldown: 40 seconds, cannot be dropped during cooldown',
  '사신의 눈':
    'Passive:\r\nOn attack, activates Eye of the Reaper\r\nIncreases ATK DMG by 17.5%, critical damage by 0.25 and AGI by 1000 for 7.5 seconds\r\nCooldown: 15 seconds, cannot be dropped during cooldown\r\n',
  '절대자의 광휘':
    'Passive:\r\nDMG DEALT by attack +18%\r\nOn attack, activates Judgment\r\nAdds 1 stack every 0.75 seconds with a max stack of 3\r\nConsume 1 stack on attack to do (MAIN STAT X 5) pure damage on attack\r\nActive:\r\nBlock magic every 1 minute\r\nLasts 5 seconds',
  '스피릿 오브 프로텍터':
    'Passive:\r\nProvides the user and nearby allies with 1% HP regen and 15% damage resistance for 15 seconds\r\nActive:\r\nOn use, activates Spirit of Protector\r\nFor 12 seconds provides 40% damage resistance to nearby allies\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  '마신의 뿔':
    "Passive:\r\nWhen moving 3000 distance, your next attack is empowered by Demonic Ray\r\nDeals (MAIN STAT X 30) pure damage in a line in front of user\r\nIncreases user's DMG DEALT to target by 8% for 4 seconds\r\nCooldown: 5 seconds, cannot be dropped during cooldown\r\n",
  '격노의 화관':
    'Active:\r\nOn use, activates Fury\r\nConsumes 40% of current HP\r\nDeals (flame affinity X (MAIN STAT X 150)) magic damage to nearby enemies\r\nIncreases all stats by 1.25% consumed HP (double for MAIN STAT) and flame affinity by 5% for 15 seconds\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  '극대노의 화관':
    'Active:\r\nOn use, activates Extreme Anger\r\nConsumes 50% of current HP\r\nDeals (flame affinity X (MAIN STAT X 250)) magic damage to nearby enemies\r\nIncreases all stats by 1.25% consumed HP (double for MAIN STAT) and flame affinity by 7.5% for 15 seconds\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  '절대영도의 화관':
    'Active:\r\nOn use, activates Composure\r\nIncreases SKILL DMG by 12.5% and all stats by 500 for 12 seconds\r\nGrants CC immunity for 12 seconds\r\nCooldown: 100 seconds, cannot be dropped during cooldown',
  '로브 오브 아크리치':
    'Active:\r\nOn use, summons Magic Field granting the user with magic and CC immunity.\r\nAlso provides a 40% magic resistance to allies in a 500 radius around user\r\nRestores 6% HP and 3% MP per second to all affected units\r\nLasts 8 seconds\r\nCooldown: 100 seconds, cannot be dropped during cooldown',
  '지옥의 로브 타나토스':
    'Active:\r\nOn use, activates Extinction\r\nProvides 1100 INT for 7 seconds\r\nUpon expiration, send a meteor to every nearby enemy dealing (INT X (20 + number of spells casted (max 20)) X 20) magic damage\r\nStuns targets hit for 1.5 seconds\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  '천상의 로브 유피테르':
    'Passive:\r\nIncreases nearby allies SKILL DMG by 8% & MAGIC DEF by 10%\r\nActive:\r\nOn use, activates Salvation\r\nHeals nearby allies to full\r\nAfterwards emits a divine light that restores (INT X 2.5) HP to 3 allies with lowest HP and all summons every 0.5 seconds for 6 seconds\r\nAlso deals (INT X 50) magic damage and stuns all nearby enemies for 1 second every second\r\nPrevents HP from dropping below 1 for duration\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  '절망의 갑주 하데스':
    "Passive:\r\nIncreases nearby allies stats by 6% in 800 AoE(Including self)\r\n'Despair of the Damned' Every 6 seconds deal 20x All Stats magic damage to all nearby enemies and increase the damage they take by 4% for 6 seconds. Heal for 6% Max Health the next time you attack\r\n",
  '펠스파이크 아머':
    'Passive:\r\nOn absorbing 100% max HP worth of damage, empowers next Hellspike\r\nEmpowered Hellspike deals 5000% max HP around user and stuns for 2 seconds\r\nCan accumulate up to 50% max HP damage from one damage instance\r\nCooldown: 5 seconds before accumulating again\r\nActive:\r\nOn use, activates Hellspike\r\nDeals 2000% max HP to enemies around user and increases ATK DMG by 5000 for 2.5 seconds\r\nCooldown: 7.5 seconds, cannot be dropped during cooldown',
  '사신의 갑주 아타나시아':
    'Passive:\r\nIf HP drops below 20%, summons Reaper\r\nReaper prevents HP from dropping below 1 for 6 seconds\r\nAfter 6 seconds deals (AGI X 50 ~ 125) pure damage based on missing HP of targets around user and restores HP to 100%\r\nCooldown: 60 seconds, cannot be dropped during cooldown\r\n',
  '마혈의 갑주 네베디움':
    'Passive:\r\nOn dealing damage, accumulates Blood\r\nConverts 1% of DMG DEALT into max HP (AGI X 2 max)\r\nWhen fully stacked provides 2% HP regen\r\nActive:\r\nOn use, activates Demon Break\r\nReleases stored HP to deal (stored HP X 30) pure damage to nearby enemies and stuns for 1.5 seconds\r\nIncreases AGI by 20% and damage output by 5% for 12 seconds\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  천지조화:
    'Passive:\r\nNearby allies gain passive 1% HP regen\r\nActive:\r\nOn use, activates Cosmos\r\nProvides 100% MAGIC DEF and debuff immunity to allies within 800 radius for 5 seconds\r\nApplies MAGIC DEF first then cleanses\r\nHeals user for 25% HP per second\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  '혈귀의 갑주':
    'Passive:\r\nWhen HP drops below 20%, activates Bloodthirst\r\nProvides 7.5% damage output and 3% HP regen for 8 seconds\r\nCooldown: 15 seconds\r\nActive:\r\nOn use, activates Bloody Soul\r\nProvides (15000 + 25% max HP) shield for 5 seconds\r\nUpon expiration, restores HP and MP equal to absorbed damage\r\nAlso deals (MAIN STAT X 150) magic damage to nearby enemies\r\nCooldown: 20 seconds, cannot be dropped during cooldown',
  '신풍의 도복':
    'Passive:\r\nOn skill cast, activates Wind Fury for 1.5 seconds\r\nNext 2 attacks hit 2 more times and deals 50% ATK DMG\r\nIncreases AGI by 250 and MOV SPD by 400\r\nBonus MOV SPD decreases by half over buff duration\r\n',
  '보이드샤드 아머':
    'Passive:\r\nWhen HP drops below 50%, activates Voidshard\r\nHeals 20% HP\r\nDeals (STR X 75) magic damage to nearby enemies\r\nIncreases STR by 15% and reduces DMG TAKEN by 7.5% for 12 seconds\r\nCooldown: 8 seconds\r\nActive:\r\nOn use, activates Event Horizon\r\nPrevents HP from dropping below 1 for 3 seconds\r\nAfterwards, pauses nearby enemies for 2 seconds and activates Voidshard\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  '헤븐즈 도어':
    "Passive:\r\nEmpowers next attack with Heaven's Light every 4 seconds\r\nDeals (INT X 50) magic damage to target and heals (INT X 1.5) HP to allies near target\r\nActive:\r\nOn use, activates Heaven's Door\r\nRefreshes a random non-ultimate spell of 2 closest nearby allies\r\nAllies cannot be affected by this more than once every 60 seconds\r\nCooldown: 30 seconds, cannot be dropped during cooldown",
  '혼돈의 비수':
    "Passive:\r\nEnables Chaos Breath every 4 seconds\r\nNext attack deals ((STR + AGI + INT) X 15) magic damage\r\nNext attack also has a 33% chance to crit for 3 times the normal damage\r\nAlso reduces target's MOV SPD by 25% and ATK SPD by 10% for 3 seconds\r\nActive:\r\nOn use, summons Servant of Chaos\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  '혼돈의 지팡이 에테노스':
    'Active:\r\nOn use, activates Big Bang\r\nDeals (INT X 750) magic damage to nearby enemies\r\nStuns for 3 seconds\r\nCooldown: 60 seconds, cannot be dropped during cooldown',
  아마겟돈:
    'Passive:\r\nOn skill cast, activates Calamity\r\nIncreases ATK DMG by 12500 and INT by 750 for 4 seconds\r\nCooldown: 12 seconds\r\nActive:\r\nOn use, activates Song of Destruction\r\nDeals (2500% ATK DMG + INT X 125) magic damage to nearby enemies\r\nIncreases magic DMG TAKEN of hit enemies by 9% for 10 seconds\r\nStuns for 2 seconds\r\nUser is invulnerable while channeling\r\nCooldown: 60 seconds, cannot be dropped during cooldown',
  '역병의 지팡이':
    'Active:\r\nOn use, activates Chain of Plague, infecting the target and next closest target for 8 seconds\r\nIf target is an enemy: deals (INT X 5) magic damage per second and lose 10% heal received\r\nIf target is an ally: grants target with 40% MAGIC DEF and heals for (INT X 1) per second\r\nIf target is self: grants target with 40% MAGIC DEF and heals for (INT X 0.5) per second\r\nUpon expiration on enemy, will explode dealing (INT X 40) magic splash damage\r\nCooldown: 20 seconds, cannot be dropped during cooldown',
  '소울 오브 어비스':
    'Passive:\r\nOn skill cast, activates Power of Abyss\r\nGrants 12% SKILL DMG (Type-B) and 300 HP regen for allies in 375 radius for 8 seconds\r\nActive:\r\nOn use, activates Call of Abyss\r\nGrants a targetted ally 8% damage output and 15% HP regen for 10 seconds\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  '선혈빛 증오':
    "Passive:\r\nOn skill cast, temporarily increases INT by 250 and flame affinity by 2.5% for 6 seconds (stacks up to 5 times)\r\nActive:\r\nOn use, activates Beam of Hatred\r\nDeals (INT X 15.625) magic damage every 0.125 seconds and stuns for 0.5 seconds (up to 16 times)\r\nDeals up to 100% more damage based on target's missing HP\r\nCooldown: 75 seconds, cannot be dropped during cooldown",
  '생명의 불꽃 하르모니아':
    'Passive:\r\nOn skill cast activate Spark of Life\r\nApplies to yourself and a nearby hero with the lowest HP\r\nHeals (15000 + INT) HP over 9 seconds\r\nProvides 15% damage resistance and 50 MOV SPD for duration\r\nCooldown: 3 seconds\r\nActive:\r\nOn use, activates Life Bind\r\nProvides 15% max HP regen and Spark of Life to allies within 600 radius for 10 seconds\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  '베리엘의 힘':
    'Passive:\r\n(1 + 0.125 X attacks without activation)% chance to activate Doomsday on attack\r\nDeals (ATK DMG X 12.5 + (STR + AGI) X 75) magic damage\r\nStuns for 0.1 seconds\r\nActive:\r\nOn use, activates Grasp of Demon Lord\r\nPulls in all enemies from 300 ~ 800 radius around you, deals (ATK DMG X 50) magic damage and stuns for 2 seconds\r\nCooldown: 60 seconds, cannot be dropped during cooldown',
  '혼돈의 검 에스피슈':
    'Passive:\r\n10% Chance to activate Chaos Strike on attack dealing ((STR + AGI) X 50) magic damage\r\n',
  '이터널 윈터':
    "Passive:\r\nEvery 8th attack activates Frost Explosion dealing water affinity X ((STR X 4) + (AGI X 3)) pure splash damage\r\nCounts as a single target\r\nActive:\r\nOn use, activates Permafrost\r\nDeals (max MP X 6) pure damage to nearby enemies and destroys their shields\r\nFreezes the ground and procs the following every second for 3 seconds\r\nDeals (max MP X 2) pure damage to enemies and freezes them for 1 second\r\nProvides (target's max MP X 0.3) shield to allies for 5 seconds\r\nCooldown: 30 seconds, cannot be dropped during cooldown",
  '몽환의 검 아트리샤':
    'Passive:\r\nOn spellcast, empowers next attack to deal (MAIN STAT X 6) pure damage, restore (MAIN STAT X 0.15), and adds stacks. Can have up to 6 stacks\r\nActive:\r\nConsumes all stacks and deals (50 X Mainstat X stack) damage to nearby enemies, stuns for 2 seconds, and gives 0.5 X stack seconds of 100% damage reduction and CC immunity\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  캘러미티:
    "Passive:\r\nOn skill cast, gains a stack and activate Ruin\r\nIncreases ATK DMG by 1500, STR and INT by 100 and SKILL DMG by 1.5% for 5 seconds\r\nStacks up to 10 times\r\nActive:\r\nOn use, activates Sword of Calamity\r\nDeals (MAIN STAT X 500) magic damage to enemies in targetted area and silences for 3 seconds\r\nDeals up to 100% more damage based on target's missing HP\r\nSets Ruin stacks to max for 15 seconds\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  천지개벽:
    'Passive:\r\nOn skill cast, activates Song of Glory increasing STR by 250 and SKILL DMG by 2.5% for 5 seconds.\r\nStacks up to a max of 4 times. Once max is reached, cannot refresh duration of buff.\r\nActive:\r\nOn use, activates Light of Creation which provides user with max stacks, passive, and damage output is increased by 7.5% for 10 seconds.\r\nCooldown: 90 seconds, cannot be dropped during cooldown',
  혼돈:
    "Passive:\r\n25% Chance to activate Devastation on attack causing enemies within a frontal cone area to take (STR X 100) magic damage\r\nReduces armor by 250 and MAGIC DEF by 2.5% for 6 seconds\r\nCooldown: 5 seconds\r\nActive:\r\nOn use, activates Oblivion granting the user with 100% ATK SPD, 200 STR, and 1.5% SKILL DMG per 1 ~ 0.5 seconds while draining user's HP\r\nStacks up to 10 times and drains (3000 + seconds elapsed X 750) HP per second\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  '월광의 검 아스트라':
    'Passive:\r\n10% chance to activate Moonlight Slash\r\nDeals ((MAIN STAT X 30) + (ATK DMG DEALT X 3)) magic splash damage and stuns for 0.25s\r\nEvery 3rd proc deals 200% DMG\r\nActive:\r\nOn use, activates Moonlight Eclipse\r\nStuns nearby enemies for 2.5 seconds\r\nIncreases magic damage taken of targets from next 3 hits by 25% for 6 seconds\r\nAfter 4th hit, target takes (MAIN STAT X 300) magic damage\r\nCooldown: 45 seconds, cannot be dropped during cooldown',
  '코즈믹 리퍼':
    'Passive:\r\nOn every 12th attack, activates Dimension Cut. Deals (MAIN STAT X 50) magic damage to target and enemies around it\r\nOn skill cast, activates Awakening. Increases AGI by 1000 and regenerates 7.5% max Hp per second for 7.5 seconds\r\nIf user is NOT Martial Artist: On-attack activates every 4th attack for duration\r\nSpellcast Cooldown: 15 seconds, cannot be dropped during cooldown\r\n',
  소울베인:
    'Passive:\r\n10% Chance to activate Soul Reaping on attack to deal (AGI X 60) bonus damage\r\nActive:\r\nOn use, activates Soul Bombardment\r\nShoots 4 arrows to target area, each dealing (AGI X 200) magic damage and stunning targets for 2.5 second\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  '이터널 플레임':
    "Passive:\r\n15% Chance to activate Mark of Flame on attack that burns the target\r\nDeals flame affinity X (AGI X 30) bonus magic damage and applies a debuff to target\r\nDebuff deals flame affinity X (AGI X 15) per second and takes 2.5% more magic damage for 10 seconds\r\nAccumulates Heat while in combat every 6 seconds increasing user's SKILL DMG and flame affinity by 1% (stacks up to 15 times)\r\n",
  '신궁 피레스':
    'Passive:\r\nActivates Poem of Wind on attack\r\nFires 1 additional projectile on every attack that deals (10% ATK DMG) pure damage\r\n50% chance to fire a 2nd additional projectile\r\n',
  '라스트 워드':
    'Passive:\r\nCharges a Bullet of Penance every 4 seconds\r\nEmpowers next attack to deal (ATK DMG X 8 + AGI X 50) bonus magic damage and stun target for 0.25 seconds\r\nUp to 3 bullets can be loaded\r\n',
  '크로노 체이서':
    "Active:\r\nOn use activates Chrono Chaser, a projectile that breaks shields and deals (AGI X 250 + 7.5% target's max HP) magic damage\r\nStuns for 1 second\r\nProjectile stays in target area for 4 seconds and deals 20% of initial damage per second\r\nCooldown: 60 seconds, cannot be dropped during cooldown",
  레인메이커:
    'Passive:\r\nOn healing, activates Healing Water granting healed allies ((INT X 0.3) X water affinity) HP regen for 3 seconds\r\nActive:\r\nOn use, activates Rainstorm around the user\r\nRestores (INT X 1) max HP to all nearby allies every 2 seconds for 6 seconds\r\nCooldown: 20 seconds',
  '코즈믹 스타':
    'Passive:\r\nEmpowers healed allies with 9% SKILL DMG and healing for 6 seconds.\r\nActive:\r\nThrows 3 waves of light to target area (400 radius) each dealing INT X 40 damage and heals INT X 1.5 HP to allies (10 second CD)',
  '서리 군주의 날개':
    'Passive:\r\nOn skill cast, summons Ice Spikes that target closest enemy boss\r\nDeals (INT X 25) magic damage per spike\r\n5 Ice Spikes can be summoned at once\r\n',
  '화염 군주의 날개':
    'Active:\r\nOn use, activates Flame Descent\r\nDeals (ATK DMG X 15 + MAIN STAT X 125) magic damage to enemies in targeted area\r\nStuns for 1.5 seconds\r\nMax dash distance of 1500\r\nCooldown: 30 seconds, cannot be dropped during cooldown',
  '브레이브 하트':
    'Passive:\r\nReduces MOV and ATK SPD by 25% of nearby enemies\r\nActive:\r\nOn use activates Bravery\r\nRestores 50% max HP of self and 30% max HP of nearby allies\r\nStuns nearby enemies for 1.5 seconds\r\nCooldown: 40 seconds, cannot be dropped during cooldown',
  '창공의 지배자':
    'Passive:\r\nOn skill cast, activates Power of Skies\r\nEvery 4th attack deals (MAIN STAT X 3) pure damage and increases all stats by 500 for 5 seconds\r\nCooldown: 15 seconds, cannot be dropped during cooldown\r\nActive:\r\nOn use, activates Star of Destruction\r\nDeals ((STR + AGI) X 250) magic damage to enemies at target location and reduces their armor by 300 for 10 seconds\r\nStuns for 2.5 seconds\r\nCooldown: 120 seconds, cannot be dropped during cooldown',
  '피의 군주의 날개':
    'Passive:\r\nUpon moving 400 distance, activates Bloody Bite on next attack\r\nOn each proc, deal (50% ATK DMG) pure damage\r\nHeals 8% max HP, and for 4 seconds increases ATK DMG by 1500, MOV SPD by 15, and HP Recovery Rate by 250 (can overlap up to 5 times)\r\n',
  '요정의 가호':
    'Passive:\r\nHealing received by nearby allies +15%\r\nActive:\r\nOn use, revives a fallen ally with full HP and MP\r\nCooldown: 300 seconds, cannot be dropped during cooldown',
  '대천사의 날개':
    'Passive:\r\n"Archangel\'s Judgement" On spell cast, 5% chance to reset the cooldown of all non-ultimate skills after 2 seconds of delay, gain 10% SKILL DMG, and 50% damage resistance for 10 seconds (120 second CD)\r\n',
  스톰:
    'Passive:\r\nOn spell cast, increases SKILL DMG and crit chance by 4% for 6 seconds. Stacks up to 3 times\r\n',
  '밤의 군주의 날개':
    "Passive:\r\nOn skill cast, empowers next attack\r\nNext attack deals (MAIN STAT X 2 + AGI X 1.5) pure damage\r\nCan crit based on user's critical chance\r\nEmpowered attack stacks Madness of Night\r\nFor 8 seconds increases AGI by 120 (stacks up to 10 times)\r\nOnce max stacks is reached, user can no longer gain more for duration but gains 10% damage output\r\n",
  '깊은 심연의 망토':
    "Passive:\r\nOn direct hit, activates Drowning Abyss\r\nDeals 15% of effect's damage over 5 seconds\r\nIncreases target's magic DMG TAKEN by 6 ~ 9% (increases based on amount of time target is debuffed, max at 15 seconds)\r\nIf target dies while debuffed it explodes and deals (MAIN STAT X 30) pure damage to nearby enemies\r\nActive:\r\nOn use, manually activates explosion on targets that have max reduction stacks",
  '불멸자의 날개':
    'Passive:\r\nWhile in combat, every 3 seconds increases MAIN STAT by 30 for a max of 1500\r\nOn death, revives user\r\nCooldown: 180 seconds, cannot be dropped during cooldown\r\n',
  '소울 디바우러':
    'Passive:\r\nEvery 5 seconds restores 10% max HP and max MP to user\r\nActive:\r\nOn use, activates Soul Swallow\r\nCleanses debuffs from user\r\nRestores 40% max HP\r\nCooldown: 40 seconds, cannot be dropped during cooldown',
};
