export default {
  炽焰头盔: '自身900范围内的友军单位，增加10%攻击速度与20%移动速度',
  修罗血面:
    '修罗血界：增加100%攻击速度与移动速度，增加4X主属性，攻击时吸血，回复最大生命值30%的血量，持续8秒，冷却时间90秒',
  魔龙战盔: '魔法免疫持续5秒\r\n\r\n',
  '真 魔龙战盔': '魔法免疫持续5秒\r\n',
  亡魂头盔:
    '亡魂怨曲：增加30%魔法抗性，增加350主属性，当血量低于40%时使用时，眩晕425范围内单位3秒BOSS为0.9秒，回复最大生命值40%的血量，额外增加100主属性，持续8秒，冷却90秒',
  奥布里皮帽:
    '奥布里叹息：当生命值低于25%时触发，回复最大生命值40%血量，仅在触发时作用一次，提升600智力，对400范围内敌人造成（50X智力）魔法伤害，眩晕1.5秒，BOSS为0.45秒，提升智力效果持续15秒，内置CD20秒，冷却时间内不能丢弃',
  圣痕战盔: '自身675范围友军单位，增加30%移动速度，提升175生命恢复速度。\r\n魔法免疫持续5秒',
  巫妖王之盔: '当受到物理攻击时， 10%几率冰冻攻击者1.5秒BOSS为0.45秒',
  巫妖王头巾: '当受到物理攻击时， 10%几率冰冻攻击者1.5秒BOSS为0.45秒',
  神圣头盔: '魔法免疫持续5秒',
  杀戮头盔:
    '杀戮叹息：增加25%攻击速度与移动速度，增加350主属性 致命一击倍率+0.2 ，当血量低于40%时使用时，对450范围内单位造成（75X最高属性值）魔法伤害，眩晕450范围内单位5秒BOSS为1.5秒，回复最大生命值70%的血量，额外增加150主属性，持续8秒，冷却90秒',
  圣佑头盔:
    '被攻击时1/8触发，回复2.5%X最大生命值血量 内置CD5秒。\r\n点击使用15秒内提升20000点最大生命值，7500魔法值，冷却时间180秒',
  恶魔领主的号角:
    '灵魂锁链：每秒回复自身最大生命值13.3%的血量，每秒对被链接单位造成（(8X最高属性值+最大生命值13.3%）魔法伤害 ，持续5秒，在链接时间内杀死单位，增加350主属性，增益效果持续300秒，重复触发不可叠加，刷新持续时间，冷却时间150秒。',
  深渊之眼: '召唤技能冷却中，智力减少为333，冷却时间为100秒',
  '真 奥布里皮帽':
    '隐形技能效果：持续20秒，冷却60秒\r\n奥布里叹息：当生命值低于25%时触发，回复最大生命值40%血量，仅在触发时作用一次，提升750智力，对400范围内敌人造成（75X智力）魔法伤害，眩晕1.5秒BOSS为0.45秒，提升智力效果持续15秒，内置CD20秒，冷却时间内不能丢弃',
  灾难头巾:
    '神秘技能：死亡后，对自身600范围内的敌方单位，造成（275X主属性）魔法伤害，内置冷却时间30秒。',
  窥视之眼:
    '死亡回春：对750范围内的所有敌人造成250X智力魔法伤害，并使其伤害抗性降低8％,持续4秒，冷却时间：120秒。',
  霜寒花冠:
    '霜寒赋予：技能伤害+10%，全属性+375，持续时间内使用技能，20%几率冰冻自身1000码内敌人1秒，持续12s，冷却CD100s',
  '魔渊 法力之源': '效果:提升750智力,增加5000最大魔法值,持续8秒,冷却60秒',
  '真 魔渊 法力之源': '效果:提升1000智力，增加5%技能伤害，持续8秒，冷却时间60秒。',
  圣天使之环: '魔法免疫持续5秒',
  异端审判:
    '审判：0.2秒充能一次，最多5层充能，每次普攻附带（0.75X主属性）纯粹伤害。\r\n魔法免疫持续5秒。',
  噩梦战盔:
    '死亡凝视：攻击25%几率1秒后提升后，暴击倍率提升0.3倍，敏捷增加 750，攻击伤害增加15%，持续时间6秒，内置CD15秒。',
  '信仰 圣佑之盔':
    '生命恢复\r\n1/4概率触发，回复5%X最大生命值血量,回复10%X最大魔法值，内置CD3秒。\r\n使用1000范围提友方单位增加40%魔法抗性。\r\n持续15秒，冷却时间150秒',
  '生命咏叹 守护头盔':
    '攻击时15%几率召唤闪电攻击敌方造成（15X全属性）魔法伤害 85%几率造成（3X全属性）魔法伤害，降低目标25%攻击速度与移动速度，持续1.5秒，内置CD2.5秒，',
  纯净花冠:
    '宁静：当使用角色本体技能（包括物品技能) 对某单位（包括自己治疗自己）形成治疗效果（满血也可以触发） 15%几率，赋予单位宁静，提升5%技能伤害，每1s回复（目标最大生命值x2%+自身智力x0.125）的生命值和1%的魔法值 ，持续5s ，无内置CD。',
  魔魇破灭盔:
    '破坏死光：发出一道直径325码的毁灭性光波，射程900码，对路径上的地方单位造成（100X主属性）魔法伤害 眩晕1秒BOSS为0.3秒，减少目标8%护甲（不可叠加），持续12秒，冷却120秒。',
  '无尽虚空 破界之眼':
    '百分之25几率召唤狂暴恶魔。基础攻击力9379 ，基础攻击间隔0.8，狂暴恶魔攻击时附带0.75倍攻击力的纯粹伤害，+0.75X智力的伤害；百分之37.5几率召唤虚无行者，基础攻击4103，基础攻击间隔0.7，自带25%致命一击几率，攻击附带0.5倍智力的伤害；百分之37.5几率召唤凶暴野兽，基础攻击4891，基础攻击间隔0.6，自带25%致命一击几率，攻击附带0.5倍智力的伤害。以上智力加成部分都是魔法伤害，所招召唤物0.25S判定一次，百分之40几率提高150攻击力和12点护甲恢复智力*1血量无视减治疗。每0.5S判定一次，若此时没触发攻击力提升，则对附近能256码范围敌人造成5倍智力的魔法伤害，冷却时间100秒。',
  无轩之湮魄头巾:
    '力量爆炸：恢复40%生命值，对自身800码范围内敌军造成1秒眩晕，友军英雄恢复（1X智力+15%最大生命值）的生命值，隐身并增加25%移动速度，持续3秒，冷却时间30秒',
  炙炎梵天之冠:
    '圣焱：消耗40%当前生命值，增加1.25%X消耗生命的全属性，主属性增加效果加倍，火焰伤害增加 5％，持续15秒，冷却时间30秒。',
  戾啸魔龙面具:
    '戾啸魔龙：15秒内，增加600主属性，0.2倍率，2000点每秒回血，持续时间内每次施法增加10%主动基础，上限100%，冷却时间：50秒。',
  '魔海诱惑 恶魔之角':
    '恶魔火焰：每移动300码充能10%， 当充能满时 下次攻击会造成20 X主属性纯粹伤害。冷却时间：10秒。',
  '荒古遗尘 众神之角':
    '闪电之触：每移动300码充能10% 当充能满时，下次攻击会造成40X主属性纯粹伤害。冷却时间：5秒。',
  送葬者之弩:
    '死亡嗜血：触发该效果时1/3的几率对317范围内的敌方单位造成（22.5X主属性）的魔法伤害;1/3的几率对375范围的敌方单位造成（12.5X主属性）的魔法伤害，降低66%的移动速度和攻击速度，持续3秒，并眩晕非BOSS单位0.75秒;1/3的几率，回复自身（3000）生命值和最大魔法值15%的魔法值',
  送葬者之刃:
    '死亡嗜血：触发该效果时1/3的几率对317范围内的敌方单位造成（22.5X主属性）的魔法伤害;1/3的几率对375范围的敌方单位造成（12.5X主属性）的魔法伤害，降低66%的移动速度和攻击速度，持续3秒，并眩晕非BOSS单位0.75秒;1/3的几率，回复自身（3000）生命值和最大魔法值15%的魔法值',
  腐蚀触角法杖: '击杀单位时恢复500生命值与魔力值',
  上古魔龙之杖: '对前方1000X250矩形范围内的敌人造成智力X40的魔法伤害,冷却时间60秒',
  南瓜权杖:
    '对目标造成（7500+30X智力）的魔法伤害，眩晕2秒（BOSS为0.6秒），回复（10000）的生命值，冷却时间75秒',
  上古魔龙之弓: '魔龙打击：7500+主属性X7.5 额外伤害',
  腐蚀寄虫壳剑:
    '普攻30%几率，对300码范围内敌方单位造成溅射伤害；普攻15%几率，对目标造成（600）点纯粹伤害，并回复600点生命值',
  '莱恩哈特 魔龙之剑': '魔龙打击：7500 +主属性 X 7.5额外伤害',
  柏丽娜龙炮: '巨龙吐息：7500+主属性X7.5的额外伤害',
  '真 柏丽娜龙炮': '巨龙吐息：15000+主属性X10额外伤害',
  '真 上古魔龙之杖': '对前方1000X350矩形范围内的敌人造成智力X100的魔法伤害，冷却时间60秒',
  大地权杖:
    '大地之怒：造成智力X45的伤害 降低自身800范围内的敌方单位125%的移动速度以及攻击速度 持续15秒 冷却时间90秒',
  '真 上古魔龙之弓': '魔龙打击：15000 + 主属性 X 10 额外伤害',
  '风暴之力 凛风长弓':
    '风神祝福：自身550范围内的友军单位，回复（最大生命值20%）的血量，回复（最大魔法值25%）的魔法值，增加50%的攻击速度与100%的移动速度，持续20秒，冷却时间50秒',
  '真 莱恩哈特 魔龙之剑': '爆破打击：15000 +主属性 X 10额外伤害',
  炽焱长剑: '魔焰爆破：普攻时10%的几率，造成（12000+3.5X力量）的魔法伤害，没有内置CD',
  雷霆之怒: '雷霆打击：普攻时10%的几率，造成（12000+3.5X敏捷）的魔法伤害，没有内置CD',
  莱图斯钢炮: '强化：下次攻击附带50*敏捷的魔法伤害，附带眩晕1s，内置CD8s',
  驭龙枪: '龙之舞：对前方375*1350范围内造成125X敏捷+目标生命值X4%的伤害，冷却60s',
  血腥祈祷: '血腥祈祷：对375范围内敌军造成25*敏捷伤害，友军回复2.5*智力生命，冷却12s',
  圣者遗物: '每次施法后4秒内375码范围内的友军单位增加6%的技能伤害，提升150生命回复速度',
  复仇者:
    '复仇：在6秒内吸收第一次超过最大生命值10%的伤害，并将该伤害按魔法伤害反馈给攻击者并在吸收后的15秒内，增加（10%+15%x(所受伤害/自身生命上限））的敏捷与25%的攻击速度，如果所受伤害超过自身生命上限，则按自身生命上限计算，最大增加1000点敏捷，冷却时间120秒',
  金顶佛光杵:
    '混沌光晕：生成一个能抵挡（最大生命值x50%）的防护盾，持续6秒，持续时间内生命恢复+2500，冷却时间30秒',
  '战神 神圣加农炮': '神圣炮弹;普攻时10%几率，对目标造成（7.5X敏捷）魔法伤害',
  '真 战神 神圣加农炮': '爆破打击：普攻时10%几率，对目标造成（7.5X敏捷）魔法伤害',
  无名之剑:
    '恩赐解脱：攻击时8%几率触发，对250范围内地方单位造成（17X主属性+5X攻击力）的魔法伤害， 眩晕0.25秒 ，每次触发失败会增加下一次触发几率0.2% ，每累计10次触发几率会出现攻击数+连击的字样,此攻击力为计算护甲之后的伤害',
  潜行者:
    '深渊爆破:普攻8%的几率对目标单位造成（15X敏捷）的魔法伤害,对目标250范围内的地方单位造成（10X敏捷）的魔法伤害,没有内置CD',
  '赤红 南瓜权杖':
    '对目标350范围内敌方单位造成（12500+50X智力）的魔法伤害，眩晕4秒（BOSS为1.2秒） 回复（15000）的生命值，冷却时间75秒',
  憎恨:
    '智力提升上限为600，持续8秒，叠加可以刷新持续时间，储存智力值≥300时可以释放，设R=0.5+（储存的智力值-300）/600，即0.5≤R≤1，对于（450Xr）范围内的单位造成（rx90x智力）的魔法伤害，眩晕（Rx4秒）（BOSS为Rx1.2秒） 释放完成后重置智力值，冷却75秒',
  '克雷提亚 圣光权杖':
    '圣光爆破：对自身750范围内敌方单位造成（75X智力）的魔法伤害，眩晕2.5秒（BOSS为0.75秒），冷却时间75秒',
  '真 克雷提亚 圣光权杖':
    '圣光爆破：对自身750范围内敌方单位造成（75X智力）的魔法伤害，眩晕2.5秒（BOSS为0.75秒），冷却时间75秒',
  雪纹:
    '碎冰飞溅：释放一个直径275的冰球，对于前方直线路径上的敌方单位造成（52.5X智力）的魔法伤害，飞行900码之后炸裂，冰冻炸裂点425范围内的地方单位5秒（BOSS为1.2秒），冷却时间75秒',
  宿主权杖:
    '寄生：1.对敌方单位释放，减少该单位10%的被治疗量，每0.5秒造成（5X智力）的魔法伤害 2.对友方单位释放，增加该单位40%的魔法抗性，每0.5秒恢复0.25X智力的生命值，对325范围内的敌方单位造成（50X智力）的魔法伤害，BOSS为0.15秒，持续5秒，冷却25秒',
  '霜寒 冰霜圣弓':
    '冰霜打击：普攻时13%的几率，对目标造成（12X敏捷）的魔法伤害降低20%的移动速度，持续3秒',
  冰雹圣器:
    '冰雹打击：普攻附带（随机0.75~1.25X敏捷）的魔法伤害 普攻是1/12的几率 对目标造成5次（随机4~6X敏捷）的魔法伤害，内置CD6秒',
  '阿拉卡特 不洁之弓': '黑暗打击:普攻时10%的几率，对目标造成（12X敏捷）的魔法伤害',
  '真 阿拉卡特 不洁之弓': '黑暗打击:普攻时10%的几率，对目标造成（12X敏捷）的魔法伤害',
  '死亡呼吸 剧毒之影':
    '死亡嗜血：释放技能后下次攻击附带每秒（0.5X敏捷）的魔法伤害，持续8秒，伤害可以叠加，最高10层，并且刷新持续时间。死亡嗜血叠加4层毒素以上（不包括4层）可以使用，造成（8.5X叠毒层数X敏捷的）魔法伤害，冷却时间100秒',
  浴血之刃:
    '吸血效果：触发该效果时，回复自身（2500+0.6X主属性）的血量 50%几率对317范围内的地方单位造成（27.5X主属性）的魔法伤害； 50%的几率对375范围的敌方单位造成（15X主属性）的魔法伤害，降低66%的移动速度和攻击速度，持续3秒，并眩晕非BOSS单位0.75秒。',
  死雾魔斧: '力量提升：提升12000攻击，1000力量 ，持续8秒，冷却25秒。',
  断魂血刃:
    '嗜血打击：对450范围内的地方单位造成伤害和眩晕，伤害：0.075X目标最大生命值+25X力量+50X智力，眩晕：1.5秒（BOSS为0.45秒），提升15000攻击，800力量，800智力， 4000魔法值；持续15秒，冷却75秒。',
  爆破之刃: '爆破：普攻10%几率触发，造成（16000+12X力量的）魔法伤害 没有内置CD',
  赤焰龙魂血刃:
    '高能打击：普攻时10%几率触发，造成（攻击力+6X力量）魔法伤害增加1250攻击力 可以叠加，最高8层，并且刷新持续时间，持续8秒，无内置CD',
  风暴殇神混天舞:
    '闪电打击：普攻时1/9几率造成（20000+10X敏捷）魔法伤害\r\n觉醒：释放技能1/9几率触发觉醒，增加50%攻击速度移动速度，增加25%模型大小，觉醒持续时间内，普攻1/3触发强力闪电打击\r\n造成（30000+15X敏捷）魔法伤害，持续6秒，无内置CD',
  死亡之刃:
    '吸血效果：触发该效果时回复自身（2500+0.6X主属性）的血量， 50%几率对317范围内的地方单位造成（27.5X主属性）的魔法伤害； 50%的几率对375范围的敌方单位造成（15X主属性）的魔法伤害，降低66%的移动速度和攻击速度，持续3秒，并眩晕非BOSS单位0.75秒；',
  '冬之泪 冰怨战矛':
    '冰霜打击：普攻时13%的几率造成（12X力量）魔法伤害并对目标施加20%的移动速度降低；持续3秒；无内置CD。',
  永恒守护之剑:
    '大地裂伤：使用时给予直线900距离内的敌人最大MP X 300％纯粹伤害，并向友盟提供友好的最大生命值X 20％盾牌，持续5秒。同时移除敌军护盾效果，冷却时间：30秒',
  腐蚀者:
    '毒性伤害：普攻15%几率，对前方相差30°角放射5道毒气，每道间隔0.125秒，每一道毒气造成(15X力量）魔法伤害，同一个单位最多收到2次伤害，减少175护甲，持续6秒，内置CD4.25秒',
  '生命咏叹 自然之力':
    '自然伤害：（7.5X全属性）的魔法伤害， 减少目标单位20%的移动速度，减速持续3秒',
  '卡拉菲米亚 神圣之剑': '爆破打击:普攻时10%几率，对目标造成（12X力量）魔法伤害',
  '真 卡拉菲米亚 神圣之剑': '爆破打击：普攻时10%几率，对目标造成（12X力量）魔法伤害',
  '埃克斯米亚 不洁之刃': '爆破打击：普攻时10%几率，对目标造成（12X敏捷）魔法伤害',
  '真 埃克斯米亚 不洁之刃': '邪恶打击：普攻时10%几率，对目标造成（12X敏捷）魔法伤害',
  炮灰的信条: '强化：下次攻击附带50*敏捷+绿字攻击力*1的魔法伤害，附带眩晕1s，内置CD8s',
  '爆裂花雨 碧水青龙炮':
    '爆水轰：向目标方向喷射出长达1000码的水柱，水柱中心275码范围内每秒造成25*智力魔法伤害（水柱会被单位抵挡，持续7s，冷却CD30s',
  '冥虹镜芒 破碎之命运': '破碎轰炸：对前方400x1350范围内造成175x敏捷+目标生命值x6%的伤害， 冷却75s',
  '真龙炙舞 毁天叹息':
    '毁灭叹息：最大施法距离1000，对400码范围内单位每0.25s造成0.25x75*最高属性+0.25x0.025x单位最大生命值，共8次，总计150x最高属性+0.05x最大生命 并附带5s眩晕，冷却CD45s',
  '火舞之怒 焰纹封魔炮':
    '炽热愤怒：20%几率触发，2.5秒内激活5次火焰攻击，每次最附近半径325内的敌人造成敏捷X20的伤害，每次造成伤害恢复5%生命值，冷却时间：10秒',
  追逐者:
    '追逐：每次攻击身边会出现一把锁定目标的追逐之剑，最多6把，6次攻击或4秒后结束，结束后，每把对锁定目标造成17.5x敏捷的魔法伤害，冷却CD 20s',
  魑魅神杖: '每次施法后6秒内375码范围内的友军单位提高7.5%的技能伤害，提升200生命回复速度',
  '深渊之手 最后的耳语':
    '审判伤害：攻击时1%几率触发 对半径450范围内地方单位，造成（42X（力量+敏捷）+7X攻击力）的魔法伤害，眩晕0.25秒，BOSS为0.075秒，每次触发失败会增加下一次触发几率0.125%，即8次攻击几率提高1%后触发几率重置每累计10次触发几率会出现攻击数+连击的字样',
  '地狱熔岩 幻舞者': '幻舞射击：攻击时15%对目标造成15*（力量+敏捷）的魔法伤害',
  '灾变 诸界毁灭者':
    '血腥祈祷：对范围内照成25*敏捷伤害，友军回复2.5*智力生命，你的治疗能给友军添加buff，buff提升治疗量和技能伤害5% 持续4s 冷却12s',
  '毁灭 末日回响':
    '毁灭末日强化：下次攻击附带50*敏捷+4*绿字攻击力的魔法伤害，每5s伤害增加50%最多100%，附带眩晕1s',
  '灾变 蛮荒之预言':
    '殷红洗礼：对前方400*1000范围发出数道血迹，每道对敌方造成20*敏捷伤害，对友军回复1.5*智力血量，每个单位最多受到3道，你的治疗能给友军添加buff，buff提升治疗量和技能伤害7.5% 持续6s，CD12s',
  精灵大地之刃:
    '自然打击：80%几率造成（7.5X全属性）魔法伤害， 20%几率造成（15X全属性）魔法伤害，减少目标单位20%的移动速度，减速持续3秒',
  幽魂潜行者: '噬魂打击：普攻时10%几率，造成（50X主属性）魔法伤害，无内置CD',
  '幽魂破尽 金顶佛光圣物':
    '混沌光晕：生成一个能抵挡（最大生命值x50%）的防护盾，持续6秒，持续时间内生命恢复+5000，冷却时间30秒',
  绝望的深渊:
    '制造瘟疫:每0.5秒对375范围敌方单位造成（智力X125）魔法伤害，降低20%攻击速度40%移动速度，减速持续1秒，重复触发刷新持续时间，冷却时间75秒',
  特比略遗落之辉闪:
    '电属性强化：普攻时10%几率造成（（10+4X辉闪数量）X主属性）魔法伤害\r\n辉闪：每次使用技能，会增加一个辉闪计数，为自身添加辉闪之力。下一次普攻30%的几率造成（2.5X（15000+2.5X主属性））的纯粹伤害，70%几率造成（15000+2.5X主属性）的纯粹伤害，并回复（0.03X该次伤害）的血量，辉闪之力存在10秒，重复触发刷新持续时间 计数最多6次\r\n辉闪结界：将每个遗落之辉闪割裂成两半，分别具象为辉闪球 每个辉闪球对目标造成（12.5X主属性）魔法伤害 眩晕0.125秒 冷却时间80秒 作用目标死亡后，主动消失',
  炼狱赤焰爆破之刃:
    '火焰打击：使用技能提升25%攻击速度与100%移动速度，增加500力量，持续7.5秒，持续时间内普攻20%增加2500攻击力，最高叠加5层，并对目标造成（（1+0.2X层数）X攻击力+10X力量）魔法伤害 ，持续时间结束移除增益效果， 内置CD12.5秒。',
  冬日霜心:
    '霜寒爆破：对目标225范围内地方单位造次（〜142％X（3.5X力量+2.75X敏捷））的通用伤害\r\n冰霜之力：范围直线900码施加魔法值X 450％的纯粹伤害，如果有魔法盾，则摧毁它，否则，给予1秒冰冻。给予等于30％X生命值P的友方冰霜护盾，冷却时间：30秒\r\n冰霜护盾：每次施法后，增加1%减伤，最多8层，叠加刷新持续时间，持续5秒',
  '熔岩血海 妖龙叹息':
    '破碎打击：普攻时12.5%几率触发，目标每秒受到（5X敏捷）魔法伤害，削弱20点护甲，第5秒停止叠加减甲，最终削减100点护甲，伤害以及减甲效果持续10秒，续时间内无法重复触发，无内置CD',
  高洁七星龙渊剑:
    '恩赐解脱：攻击时8%几率触发，对250范围内地方单位，造成（36X主属性+8X攻击力）的魔法伤害，眩晕0.25秒，每次触发失败会增加下一次触发几率0.2%，每累计10次触发几率会出现攻击数+连击的字样，此攻击力为计算护甲之后的伤害\r\n龙渊山崩：1.25内地裂持续扩散，完毕后炸裂技能释放点475范围内地方单位，在2.5秒内持续造成12次总和为（130X主属性）魔法伤害，每次伤害眩晕0.25秒，冷却时间75',
  '真 无名之剑':
    '恩赐解脱：攻击时8%几率触发，对250范围内地方单位，造成（23X主属性+6.5X攻击力）的魔法伤害， 眩晕0.25秒， 每次触发失败会增加下一次触发几率0.2%， 每累计10次触发几率会出现攻击数+连击的字样，此攻击力为计算护甲之后的伤害',
  '荣耀 鲜血残戟':
    '荣耀战歌：增加125力量与2.5%技能伤害，可以叠加，刷新持续时间最高4层，持续5秒，持续时间内，普攻60%几率造成（叠加层数X力量）魔法伤害，持续时间结束后移除所有增益并进入5秒CD',
  '噩耗 魑魅神杖': '每次施法后8秒内375码范围内的友军单位 提高10%的技能伤害，提升250生命回复速度 ',
  '追忆 呼啸长风': '风之打击：攻击附带攻击伤害X0.15纯粹伤害的1根箭矢，箭矢可以暴击，继承攻击特效',
  '冬之泪 冰霜怨弓': '效果:普攻15%几率造成（随机7.5~10X敏捷）魔法伤害',
  王道无极寒冰弓:
    '冰霜风暴:普攻附带（随机1.5~2X敏捷）魔法伤害,普攻8%几率释放冰霜风暴，对直线前方900码内地方单位造成（随机40~60X敏捷）魔法伤害,内置CD9秒',
  '不朽 潜行者':
    '深渊之力:对目标造成（97.5X敏捷）的魔法伤害 对目标300范围敌方单位造成（81.25X敏捷）魔法伤害,回复最大生命值15%生命。',
  '生命咏叹 守望之锤':
    '力量提升：增加425力量，每次普攻附加（1.5X力量）魔法伤害，持续6秒，内置cd10秒',
  血色憎恨:
    '仇恨之眼：每0.125秒召唤火球对目标造成（10X智力）魔法伤害，眩晕1秒BOSS为0.3秒，持续2秒，总计160倍智力伤害，眩晕3秒，BOSS为2.3秒 冷却时间75秒',
  统治权杖:
    '自身范围每多一个自己的召唤物，提升100智力，最多提升1200。\r\n统治释放：召唤一个火焰弓箭手，15重射，攻击间隔0.5，生命回复速度4000，每次攻击附带(3X智力）魔法伤害，持续时间60秒 ，冷却时间60秒',
  '信仰 亚特兰蒂斯的毁灭圣杖':
    '混沌爆破：对自身750范围内敌方单位造成（125X智力）的魔法伤害，眩晕2.5秒（BOSS为0.75秒），冷却时间75秒',
  '亡灵挽歌 虚灵权杖':
    '暗黑领域：每0.625秒对400范围的敌方单位造成（12.5X智力）魔法伤害，共计8次，每次削弱敌军魔抗1.5%，最多6%，冷却75秒',
  地狱挽歌:
    '死亡之源：使用技能后，增加10000攻击力，增加375智力，提升500%移动速度，持续4秒，内置CD12秒\r\n绝望亡曲：对前方大范围扇形区域敌方单位造成（75X智力+15X攻击力）魔法伤害,魔法抗性减少8%，眩晕2.5秒，冷却80秒',
  '冬之泪 沧澜雪印':
    '释放技能后，下一次普通附带（7.5X智力）魔法伤害\r\n若单位被霜冻减速，则造成(15X智力）魔法伤害\r\n无冬之夜：\r\n冻结700范围内的敌人3s,造成每0.2s主属性*2.5的魔法伤害,冷却时间70秒',
  '神降 亚特兰蒂斯的破灭圣弓': '混沌打击:普攻时15%的几率，对目标造成（15X（敏捷+力量））的魔法伤害',
  拉克鲁斯之剑:
    '潮汐强化：释放技能后下次攻击附带每秒（1.3X敏捷）魔法伤害，持续9秒，伤害可以叠加，刷新持续时间，叠加第10次时，直接造成（130X敏捷）魔法伤害，并眩晕1秒BOSS为0.3秒\r\n幻想打击：在6秒内吸收第一次超过最大生命值10%的伤害，（如果所受伤害伤害超过最大生命值，则按最大生命值计算）并将该伤害按魔法伤害反馈给攻击者，并在吸收后的15秒内，增加（15%+15%x(所受伤害/自身生命上限））的敏捷，最大增加1250点敏捷 提升致命一击概率10%，冷却时间120秒',
  赤血魔刃:
    '血怒：每14次普攻触发对450范围敌方单位造成（40X主属性）魔法伤害，回复自身（3000+0.6X主属性）生命值\r\n觉醒：使用技能时20%几率触发 增加自身30%攻击速度移动速度，增加750敏捷，觉醒持续7.5秒，加强血怒效果，对450范围内的地方单位造成（60X主属性）的魔法伤害； 并眩晕1秒；BOSS为0.3秒 内置CD30秒，回复450范围内友方单位（2250+0.45X主属性）的血量，回复自身（4500+0.9X主属性）血量，冷却时间15秒',
  '深渊之手 绝望的煙灭':
    '审判：攻击时1%几率触发，对半径450范围内地方单位造成（42X（力量+敏捷）+7X攻击力）的魔法伤害，眩晕0.25秒BOSS为0.075秒\r\n每次触发失败会增加下一次触发几率0.125%，即8次攻击几率提高1%后，触发几率重置，每累计10次触发几率会出现攻击数+连击的字样',
  '冬之泪 冰极天雪剑': '冰魂打击：造成（1.8X力量+1.5X敏捷）纯粹伤害',
  百里流光圣影之刃:
    '电属性强化：普攻时8%几率造成（（10+4X圣影印记数量）X主属性）魔法伤害\r\n圣影印记：每次使用技能，会增加一个圣影印记计数，为自身添加圣影之力，下一次普攻30%的几率造成（2.5X（15000+2.5X主属性））的纯粹伤害，70%几率造成（15000+2.5X主属性）的纯粹伤害并回复（0.03X该次伤害）的血量，圣影之力存在10秒，重复触发刷新持续时间，计数最多6次。\r\n光之轨迹：将每个圣影印记闪割裂成两半，分别具象为圣影之刃，每把圣影之刃对目标造成（12.5X主属性）魔法伤害，眩晕0.125秒，冷却时间80秒，当作用对象死亡，这个效果消失\r\n',
  愤怒:
    '怒火打击：普攻15%几率对前方相差30°角放射5道火焰，每道间隔0.125秒，每一道毒气造成(20X力量）魔法伤害，同一个单位最多收到2次伤害，减少200护甲，持续6秒，内置CD4.25秒\r\n愤怒燃烧：1.开启时，致命一击几率增加15% 2.开启前10秒每秒提升75力量，1%技能伤害，在第十秒后停止增加 3.开启时损失生命值，为生命移除，无视任何抗性减伤，最低保留1点生命值，不致死，生命移除：第一秒为1200，之后每秒增加400,5秒后固定为4800，冷却时间60秒',
  '斩神 亚特兰蒂斯的毁灭圣剑': '混沌打击：普攻时15%几率，对目标造成（15X（力量+敏捷））魔法伤害',
  '亡灵挽歌 王者之剑':
    '仇恨打击：普攻时12%几率，对目标造成（35X（主属性）魔法伤害，无内置CD\r\n灵魂切割：造成（150X主属性）魔法伤害，降低50%目标移动速度，提高自身7.5%技能伤害，持续10秒，冷却150秒',
  '秩序之源 永恒碧蓝怒火之剑': '混沌打击：普攻时12%几率，对目标造成（30X（力量+敏捷））魔法伤害',
  '秩序之源 无间地狱魔杖':
    '无间爆破：对自身900范围内敌方单位造成（300X智力）的魔法伤害，眩晕3.25秒（BOSS为1/3时间），冷却时间60秒',
  '秩序之源 梦魇毁灭魔弓': '混沌魔影:普攻时12%的几率，对目标造成（30X（敏捷+力量））的魔法伤害',
  '绝魂 世界击碎者': '幻舞射击：攻击时12%对目标造成30*（力量+敏捷）的魔法伤害',
  '亵渎之影 末日裁决':
    '末日裁决：攻击时2%几率触发，对半径450范围内地方单位 造成（65X（力量+敏捷）+10X攻击力）的魔法伤害，眩晕0.5秒，BOSS为0.15秒，每次触发失败会增加下一次触发几率0.125%，即8次攻击几率提高1%后触发几率重置，每累计10次触发几率会出现攻击数+连击的字样',
  '末日 火舞之怒 焰纹封魔炮':
    '毁灭末日强化：下次攻击附带50*敏捷+4*攻击力的魔法伤害，每5s增加1充能，每层充能增加伤害50%，最多100%，附带眩晕1s',
  附魔追逐者:
    '附魔追逐：对目标方向释放一道直径为400，射程为1350的阴影追逐，对路径上单位造成200x敏捷+7.5%x最大生命的魔法伤害',
  龙蟠凤翥诉哀殇剑:
    '强化效果：普攻时12%几率，对目标造成（37.5X主属性）魔法伤害，无内置CD，450范围每多两位友军英雄，增加自身（1750X每对友军数量）攻击力，增加自身（1X每对友军数量）技能伤害',
  火炎之心:
    '火焰打击：使用技能提升100%攻击速度与100%移动速度，增加500力量 ，持续9秒， 持续时间内普攻20%增加1500攻击力.100主属性，最高叠加5层，对目标造成（（1.5+0.3*层数）X攻击力+15X力量）魔法伤害，持续时间结束移除增益效，内置CD15秒',
  恩德拉的苏醒: '强化效果：每隔12秒你的攻击使一条线上的敌人造成125X主属性的魔法伤害',
  '巨龙之怒 缚灵之手':
    '巨龙之力：施法1.5秒后，召唤火龙，召唤物无敌，免疫debuff和秒杀,人免疫秒杀，90%减伤\r\n火龙技能1：向前喷射火炎持续三秒，每秒造成主属性x75范围伤害。Cd4秒 。\r\n火龙技能2：周围半径450友军添加抵挡为30000的防护盾,生命恢复+7500，持续2s。Cd6秒。\r\n持续时间15秒，冷却时间90秒',
  '梦魇缚灵 尘封之眼':
    '熔岩凝视：普攻时15%几率触发，目标每秒受到（10X敏捷）魔法伤害，在前5秒内持续每秒削弱目标20点护甲和0.3%魔抗，触发的效果可持续10秒，持续时间内无法重复触发，无内置CD',
  '地狱之光 毁灭灾星':
    '毁灭打击：每次施法增加1250攻击力，75力量和智力，1%技伤，持续5秒，最多叠加10次，重复叠加刷新持续时间。\r\n毁灭灾星：造成7.5%最大生命值+80x智力+40x力量魔法伤害，1.5秒眩晕。维持被动最大层数15秒，施法距离：750，半径：450，冷却时间：60s。',
  '雪絮 寒影圣辉':
    '攻击强化：附加智力x20魔法伤害并减速目标万境踪灭：持续影响400范围内的敌人4秒，并造成1秒的冻结，使敌军更脆弱可受到更多伤害，持续时间造成智力X100魔法伤害。持续时间内受影响的单位被攻击时，造成施法者的智力X3的纯粹伤害，内置CD0.1秒。冷却90秒',
  '吟龙霜寒 冰雪叹息':
    '治愈之水：造成目标在3秒内获得生命恢复0.15x智力的提高冰雪叹息：释放长1000码、宽275码的水柱，持续6秒。范围内地方单位受到每秒智力X15的魔法伤害。范围内友方单位受到每秒智力X1的生命恢复。冷却时间20秒。',
  '唤潮 贪婪之手':
    '潮汐范围打击：攻击时有20％的几率攻击目标周围的敌人，并恢复2500生命值\r\n贪婪汲取：使用时将300到800码附近的敌人牵引到你身边造成（4000%x攻击伤害）的伤害并昏迷2秒，冷却时间60秒\r\n',
  '远古迷梦 祝福长弓':
    '风之打击：攻击50%概率附带攻击伤害X0.15攻击强度纯粹伤害的1根箭矢，同时50%概率触发第2根。箭矢可以暴击，继承攻击特效',
  '阿特里西亚 梦幻之剑':
    '攻击强化\r\n主属性X7.5的纯粹伤害\r\n最大生命值x4%的生命恢复\r\n添加BUFF（最多6个）\r\n虚幻梦境\r\n消耗所有BUFF堆积对附近敌人造成（50X主属性XBUFF数量）的魔法伤害并恐惧敌人2秒\r\n提供（0.5XBUFF数量）秒的免疫状态\r\n冷却时间：90秒',
  '邪目 绯红憎恨':
    '绯红凝视：2秒内攻击目标，每秒对目标及附近敌人造成智力X 125的魔法伤害。\r\n根据目标失去的生命值最高额外造成100%的伤害提升。',
  '辉煌 瀚宇之星':
    '友军强化：6秒内技能伤害和生命恢复提高9％。神圣洗礼：\r\n对目标区域半径400内的敌人造成智力X 40伤害，\r\n共3次\r\n冷却时间：10秒',
  瘟疫法杖:
    '瘟疫领域：目标及其附近单位感染瘟疫持续8秒\r\n如果目标是敌军，生命恢复降低10％，每秒受到智力X5点伤害\r\n如果目标是友军，则魔法防御提高40％，每秒恢复智力X1生命\r\n持续结束时目标爆炸，眩晕附近敌人并造成智力X40伤害\r\n冷却时间：20秒',
  波纹鞋:
    '击杀单位8%几率经验获取率增加12%、魔法回复速度增加15，持续30秒，重复触发刷新持续时间，无内置CD',
  象皮披风: '提升40生命恢复速度，增加20魔法恢复速度',
  深海之翼:
    '击杀单位8%几率 经验获取率增加12%、魔法回复速度增加15，持续30秒，重复触发刷新持续时间，无内置CD。',
  火焰披风: '灼伤效果：每秒对自身200码范围内单位造成2400魔法伤害',
  蝙蝠之翼:
    '吸血打击：每移动400码下一次攻击附加0.5倍攻击力的纯粹伤害，且回复8%最大生命值 ，储存上限2次，内置充能冷却时间0.125秒。',
  伯爵的披风: '暗属性效果：下一次普攻造成2.5X主属性纯粹伤害，回复最大生命值2.5%生命值。',
  腐败水晶之翼: '提升生命恢复速度150，魔法恢复速度60。\r\n',
  '嗜血 蝙蝠之翼':
    '饥渴嗜血：下一次攻击附加0.7倍攻击力的纯粹伤害，且回复8%最大生命值，储存上限2次，攻击触发被动回血堆叠层数，每层获得200生命恢复，最多累计5层，持续2.5秒，内置充能冷却时间0.125秒。',
  飞星流彩碎翼:
    '苍穹之力：使用技能后获得苍穹之力加成，提升275主属性普攻附带1X主属性的纯粹伤害，苍穹之力持续4秒 ，内置CD16秒。\r\n群星流彩：引动群星坠向目标区域施法距离1200，对350码范围内敌方单位造成15X主属性魔法伤害，眩晕2秒，群星坠地1.5秒之后对1000码范围地方单位造成115X主属性魔法伤害，削减250护甲持续10秒，冷却时间150秒。',
  暗黑不朽魂翼:
    '吸收灵魂：每5秒恢复生命值和魔法值值13.5％。\r\n释放灵魂：550范围内的友方单位回复（40%X最大生命值）血量 ，根据智力属性对敌军造成魔法伤害， 冷却时间30秒。',
  '星辰闪耀 圣堂之翼':
    '提升生命回复速度225，魔法恢复速度100。\r\n1/20几率刷新技能(除了终极技能)触发后2秒刷新，内置CD150秒。',
  怒焱魂翼:
    '魂怒：增加60敏捷，可叠加上限600，持续7秒。释放技能后下一次普攻87.5%几率造成（敏捷+2.5X最高属性值）纯粹伤害 ，回复最大生命值7.5%血量；12.5%几率造成（敏捷X2+5X最高属性值）纯粹伤害，回复3%生命值。无内置CD。',
  堕落的火焰魂翼:
    '魔焰缠身：削弱自身生命恢复速度175，对目标造成指向性技能伤害时每0.5秒将触发该次伤害，2.5%以纯粹伤害的形式灼伤目标，持续3秒共6次，可以叠加，多次触发。',
  '狂暴 堕落统治魂翼':
    '统治魂翼：削弱自身生命恢复速度250，对目标造成指向性技能伤害时，减少该单位4%魔法抗性，每0.5秒将触发该次伤害3.3%以纯粹伤害的形式灼伤目标，持续3秒共6次，可以叠加多次触发。',
  冰极天雪魂翼: '减少600范围地方单位15%攻击速度和移动速度',
  幻想霜寒魂翼:
    '减少750范围内敌方单位20%移动速度攻击速度。\r\n幻想哀嚎：眩晕600范围地方单位1秒，回复自身33%最大生命值血量，敌方的攻击力降低20%，持续8秒，冷却时间40秒。',
  耀目星芒魂翼:
    '生命恢复速度提高275.\r\n主动使用:自己、自己的召唤单位与友军召唤单位，增加6000最大生命值，5%技能伤害，友军英雄增加3000最大生命值，持续45秒，冷却60秒。',
  亡者灵魂:
    '复活死者:死亡后对于600范围敌方单位造成（275X主属性）魔法伤害。2秒后复活,30秒内无法重复触发，内置CD182秒',
  魔音护魂之翼:
    '疯狂杀戮：释放技能后下一次普攻，82.5%几率造成（1.5X 敏捷+2.5X 最高属性值）纯粹伤害，回复最大生命值3%的血量；17.5%几率造成（3X 敏捷+5X 最高属性值）纯粹伤害，回复最大生命值7.5%的血量并增加90敏捷，可叠加上限900(10层，)持续8秒，被动达到10层时增加9%技能伤害，无内置CD。',
  信仰斗篷:
    '永恒信仰：普攻时12.5%几率触发，回复自身最大生命值40%血量，增加50%攻击速度和移动速度，每秒增加100点主属性，第11秒后移除，最多增加1000点主属性，内置CD30秒。',
  地狱熔岩火凰羽翼:
    '熔火：飞向目标区域对周围敌军给予重创，造成攻击力x5+主属性x75的魔法伤害并眩晕0.5秒，最大移动距离900，移动速度3000，攻击半径300，施法延迟0.5秒，冷却时间45秒。',
  '祈明 神谕血翼':
    '血腥之咬：附加攻击力x75%纯粹伤害，最大生命值x8%的生命恢复。\r\n2.5秒内攻击力提升1500，移动速度提升15，生命恢复速度提高250（最多可叠加5层）',
  '遂宇玄芒 灵仙魂翼': '复活:\r\n生命值/魔法值复活后恢复到100％状态.\r\n冷却时间：180秒.',
  '净空 至上祝福羽翼':
    '大天使的祝福：\r\n2秒内重置终极技能以外的所有技能的冷却时间；\r\n技能伤害提高10%，所受伤害减免50%，持续10秒；\r\n触发几率：5%；\r\n冷却时间：120秒。',
  无坚不摧战翅: '重复触发将刷新持续时间',
  龙虾鳞甲:
    '反弹效果：\r\n若攻击力（英雄）大于300则造成1200纯粹伤害，若小于300则造成攻击力*4纯粹伤害',
  腐蚀龙虾鳞甲: '伤害反弹：90%反弹0.5*力量纯粹伤害，10%反弹5*力量纯粹伤害',
  守护岩甲:
    '石盾：增加5%的主属性，获得一个3X主属性的护盾，持续2秒，提高4000的生命值恢复， 4000的魔法恢复速度，冷却时间40秒。',
  血精石甲:
    '血石之盾：增加 7.5%的主属性，获得一个8000+15%最大生命值的护盾，持续2.5s。提高4000+7.5%最大生命值的生命值恢复，提高4000+7.5%最大魔法值的魔法恢复速度，CD40S，',
  法皇之衣: '魔法免疫持续时间5秒',
  佑腐鳞甲:
    '伤害反弹：每次收到物理攻击时 1/6几率反弹（5X力量）纯粹伤害，5/6几率反弹（0.6X力量）纯粹伤害 并添加状态，设攻击单位攻击力为x，当x大于2倍最大生命+20%充能，并显示+20%，若小于，则 +10*（x/最大生命值）% 并每到10%显示+10%，到达100%充能时对自身525范围内单位造成17.5*最大生命的魔法伤害 ，内置CD5S。',
  寒冰雪衣:
    '每次受到物理攻击时10%几率，获得霜寒护甲，增加400护甲，持续15秒，不可叠加，重复触发刷新持续时间，无内置CD。',
  远古自然圣甲: '生命值低于30%每秒生命恢复速度增加2500，持续10秒，内置CD55秒，CD中不可丢弃。',
  '生命咏叹 守护圣甲':
    '生命值低于30%每秒生命恢复速度增加3500，持续10秒，内置CD35秒， CD中不可丢弃。',
  '真 血精石甲':
    '血石之盾：增加7.5%的主属性，获得一个8000+15%最大生命值的护盾，持续2.5s，提高4000+7.5%最大生命值的生命值恢复，提高4000+7.5%最大魔法值的魔法恢复速度，CD40S。',
  童话长袍: '精灵龙攻击boss获得智力X1的额外伤害',
  '生命咏叹 梦境童话': '精灵龙攻击boss 获得智力X1.5的额外伤害',
  神圣盔甲:
    '绝对守护：每当受到物理攻击时10%概率，增加自身1000护甲值，持续4秒，持续时间结束进入CD，内置CD12秒',
  '德里克斯 堕落魔甲': '被攻击时10%几率削弱攻击者125护甲，持续5秒，无内置CD',
  魔渊焱甲:
    '魔焰飞溅：当生命值低于35%触发，增加5%力量，持续10秒，不可叠加，回复自身最大生命值14%血量，对周围400范围内地方单位造成（25X力量）魔法伤害，降低75%攻击速度移动速度，持续1.5秒，内置CD8秒。',
  圣佑龙魂战甲: '龙之魂：受到攻击10%概率触发，吸收这次伤害，内置CD4秒。',
  嗜血之铠:
    '嗜血斗气：每过6秒对自身275范围内地方单位造成（7.5 X攻击伤害）魔法伤害， 增加20000攻击伤害，持续1.5秒。',
  冰魂雪衣: '远古冰魂：吸收（0.75X最大魔法值+6X智力）伤害 ，持续8秒，冷却时间75秒。',
  寒冬之拥:
    '冰霜幽灵:吸收（0.75x最大魔法值+5x智力）伤害,并释放极寒冰爆;\r\n每0.25秒向半径0~750码周边随机释放冰片，对爆炸点350码范围内地方单位造成（10x智力）魔法伤害,并冰冻非BOSS单位1秒,减速boss.持续8秒,冷却时间45秒.\r\n',
  死灵法袍:
    '魔力屏障：自身获得魔法免疫，自身225范围内友方单位增加40%魔法抗性 持续6秒，冷却时间120秒。',
  创世圣铠:
    '创世印记：每秒回复自身（3500+15%最大生命值）血量，持续4秒，持续期身边600码内自身与友方单位魔法抗性提高到100%，冷却时间90秒。',
  戴安娜的神圣法衣:
    '戴安娜护佑：范围750，释放时自身无法移动，为自身添加一个（15000+5X智力）的护盾，每0.6秒释放神圣极光，回复1000范围内友方单位（1.5X智力）生命值， 对1000范围内地方单位造成（25X智力）魔法伤害，第七次引爆护佑之力，对1000范围内敌方单位造成50X智力魔法伤害，冷却90秒。',
  圣焱战神之甲: '提升自身700范围内除自身之外友军单位5%的全属性',
  安魂甲胄:
    '提升700范围内友军单位5%全属性。\r\n每8秒随机获得 1.技能伤害10%提升 2.伤害减免16%提升 3.每秒回复（0.2X主属性）血量。',
  '克罗洛斯 血羽之甲':
    '对600范围内敌方单位造成（30X所存生命上限）魔法伤害，眩晕2.5秒BOSS为0.75秒，增加12%敏捷，持续12秒，冷却150秒。',
  亡者魂衣:
    '当生命值低于15%触发，回复最大生命值25%的血量，增加90%减伤，提升100%移动速度， 持续3秒， 内置CD60秒。',
  本尼迪特嗜血之铠:
    '当造成伤害的时候，将1%伤害量转换为自身生命上限，最多增加2x敏捷的生命上限，不再造成伤害之后8秒移除，效果结束后额外增加的生命上限的50%给予生命值恢复。\r\n强制敌人禁锢：对750范围内敌方单位造成（25X所存生命上限）纯粹伤害，眩晕5秒BOSS为1.5秒，在持续12秒时间内伤害获得所存生命上限x30以及技能伤害5%的提高，冷却120秒。\r\n',
  霜寒碎片守护圣甲:
    '霜寒守护：当生命值低于40%触发 ，增加12.5%力量，伤害减免增加12%，持续12秒，不可叠加。 回复自身最大生命值17.5%血量，对周围400范围内地方单位造成（60X力量）魔法伤害，降低75%攻击速度移动速度，持续2秒，内置CD8秒。',
  '亡灵挽歌 灾祸法袍':
    '死亡契约：消耗自身最大生命值40%，不足40%生命值减为1，提升850智力，持续11秒，冷却时间120秒。',
  女巫美狄亚法衣:
    '控制女巫：使用技能有100%的几率得到1个女巫，50%的几率到2个女巫，内置冷却时间0.5秒，每个女巫的存在，提升智力100和技能伤害1%，最多4个女巫。\r\n增加智力500和6%技能伤害。释放技能时持续生成女巫。释放技能使每个女巫向1000码范围内攻击。每个女巫对300码范围内敌人造成25*智力魔法伤害，内置CD1s 持续6s 冷却时间90秒。',
  湮灭幽魂甲胄:
    '幽魂守护：受到的攻击会使生命值低于15%时触发，减免受到攻击伤害的90%，提升100移动速度，回复最大生命值35%的血量，之后每秒回复6%的血量，持续3s，内置CD60秒。',
  地渊沉星荆棘之甲:
    '荆棘之刺：被动1，被攻击时对周围造成本身100%最大生命值的纯粹伤害，内置CD3秒。主动1，每次受到自身最大生命值62.5%的伤害就充能50%，累计100%（最大生命值125%）时可以主动释放，造成范围40x最大生命值（4000%最大生命值）魔法伤害，眩晕2.5秒。内置CD5秒，主动2 消耗最大生命值的20%，对周围造成最大生命值100%的纯粹伤害，冷却时间3秒。',
  '冥谕 铸血甲胄':
    '铸血：5秒内吸收（10,000 +最大生命值×20％）伤害。 护盾结束时，对周围敌人造成125倍主属性魔法伤害，持续时间内护盾被消耗能重复补充，冷却时间20秒。',
  '辟晦 淬光之铠':
    '淬光电击：每秒对附近敌人造成（力量+敏捷）x20的持续魔法伤害，每秒恢复最大生命值的2.5%，持续3秒，冷却时间6秒。\r\n',
  '虚空 破风之铠': '风怒：每次攻击时额外攻击一次（最多3次）。\r\n显着的提高移动速度。\r\n',
  '先驱 风暴战铠': '风怒：每次攻击时额外攻击一次（最多3次）。显着的提高移动速度。',
  德鲁伊长袍:
    '自然精灵：每个自然精灵每秒恢复最大生命值0.75%，最多可召唤4个。\r\n主送释放：若目标是敌军，造成智力x40魔法伤害；若目标是友军，造成智力x2.生命值恢复，无法对自身使用；可触发指向技能效果。',
  '怨灵祈祷 绝望甲胄':
    '怨灵祷告：每6秒对附近的敌人造成20X全属性的魔法伤害。 在6秒内将其伤害抗性降低4％，并使你的下一次攻击获得6％最大生命值的自我治疗。',
  深海宝石:
    '潮汐冲击：对英雄面向角度释放潮汐冲击，友军生命恢复3000，并增加移动速度50%，持续10s，敌军则造成4000+25*主属性的魔法伤害。',
  肉袋: '体能恢复：恢复2000生命值，提升攻击&移动速度15%，持续10s，冷却CD20s。',
  伯爵的鲜血之戒:
    '点击使用回复自身450范围的友方单位 (4000+施法者最大生命值25%）的血量 ，冷却时间60秒。',
  炽焰之癸:
    '愤怒燃烧：释放技能时1/8几率触发，对350范围内单位造成（40X主属性）魔法伤害，眩晕1秒，BOSS0.3秒，无内置CD。',
  死亡之戒:
    '使用者周围的敌军的生命恢复速度减少40% ，降低自身生命回复速度和被治疗量的40% ，周期性吸收生命值。',
  腐败的水晶碎片: '生命回复速度提升100，魔法回复速度提升40',
  魔法之心: '魔法恢复速度提升50',
  守护圣戒: '生命恢复速度提升80',
  '魔法之心 卓越': '魔法恢复速度提升75',
  共振指环: '共振：主动使用重置最后使用的技能的冷却时间，不能刷新终极技能，冷却时间120秒。',
  腐蚀暗黑号角:
    '触手：自身800范围造成7000魔法伤害，降低30%移动速度，持续1.5秒，1.5秒之后对自身400范围内地方单位造成（37.5X主属性）魔法伤害，每伤害一个单位回复自身（最大生命值12.5%）的血量，冷却时间150秒。',
  '魔法之心 霜寒': '魔法恢复速度提升100',
  冬日的玫瑰: '普攻时10%几率提升250智力，持续6秒，无内置CD。\r\n',
  极冰之牙:
    '每次普攻附带（0.1X该次普攻伤害+400）纯粹伤害。\r\n普攻时8%几率减少目标175护甲，持续5秒，无内置CD。',
  '真 守护圣戒': '生命恢复速度提升140',
  贤者之戒:
    '贤者之力：重置最后是使用的技能的冷却时间 不能刷新终极技能，魔法恢复速度提升1000，持续8秒，冷却时间120秒。',
  圣光之戒: '800范围内友军单位提升护甲200',
  生命石: '内置CD181秒',
  骷髅印章:
    '最多提升最大生命值15％和7500之间的较低值的生命值上限，持续6秒，重复触发刷新持续时间，无内置CD。',
  未完成的狂暴药剂:
    '改变角色外形:模型缩小50%,增加60%魔法抗性,增加250全属性,每秒回复1%生命值,持续12秒,冷却时间120秒,结束后模型恢复原貌。',
  灵魂酒箱:
    '生命值恢复速度提升+200。主动吸收：使用时将对敌人魔法伤害量的2.5%转化为自身治疗效果，持续6秒，冷却时间15秒。',
  弱水精华: '回复最大魔法值20%的魔量 ，冷却时间45秒。',
  风暴之戒:
    '风暴领域：每0.25秒对自身325范围内的地方单位造成（12.5X主属性）的魔法伤害，眩晕1秒，BOSS为0.3秒，持续2秒，冷却时间120秒。',
  噩梦指环:
    '噩梦打击：普攻时5%概率触发，增加15000攻击力，增加900全属性，增加1000点生命恢复速度，持续6秒，内置CD9秒。',
  沉眠龙徽暗影之指:
    '潜能：血量不为100%可开启，开启后每秒提升生命恢复速度300，5%魔法抗性，最高叠加到第5层 ，总计提升1500点生命恢复速度，25%魔法抗性 血量回复到100%移除效果，重复开启不可叠加，冷却时间120秒。',
  '荣光 圣芒之戒':
    '神圣之光：675范围内友军单位提升护甲200，675范围内友军单位提升最大生命值3000，每次使用技能储存1层神圣能量最多5层，持续时间8秒，使用释放神圣之光，周围半径600友军恢复（力量+敏捷+智力）x0.2x充能数的生命值，冷却10秒。',
  '禁忌 魔幻之戒':
    '禁忌法术：消耗最大魔法值50%，主属性提升（消耗的魔法值/90）（最多600），攻击速度提升30%，持续8秒。冷却时间30秒。',
  死神之戒:
    '为包括自身在内400范围友方单位增加回光返照效果 将所受伤害全部转化为治疗量，持续3秒，冷却150秒。',
  深渊玫瑰:
    '区域庇护：消耗自身最大生命值20%血量，不足20%时归于1，为自身范围400内的友军创造一个强度为（施法者最大生命值20%+5X智力）的护盾，持续8秒，冷却时间60秒。',
  圣之魂器: '普攻时13%几率，减少目标225护甲，持续5秒，无内置CD。',
  掠夺之戒:
    '掠夺之力：可重置最后使用的技能的冷却时间，不能刷新终极技能，魔法恢复速度提升1200 ，持续10秒，冷却时间100秒。',
  '德瑞诺斯 深渊领主的戒指': '800范围内友军护甲提升300',
  '诸神黄昏 混沌之心': '绝对守护：受到攻击时10%几率吸收该次伤害， 内置CD6秒。',
  上古魔龙之心:
    '召唤上古魔龙：对600范围内单位造成（30X智力）魔法伤害，眩晕一秒，BOSS0.3秒，上古魔龙每次攻击附带智力X 5的魔法伤害，冷却150秒。',
  '诸神黄昏 深渊领主的龙笛':
    '750范围内友军单位，移动速度提升20%，攻击速度提升20% ，每秒回复200生命值，提升6666攻击力。',
  '誓约之戒 勇气':
    '屏障：消耗自身最大生命值10%血量，不足10%时归于1，为自身范围400内的友军创造一个强度为（施法者最大生命值6%+1.5X主属性）的屏障，持续6秒，冷却时间60秒。',
  '亡灵挽歌 月穷天坠':
    '三种BUFF：1.技能伤害10%提升2.伤害减免16%提升。3.每秒回复（0.2X主属性）血量。主动激活冷却时间90秒.',
  圣魔指环:
    '暗之审判：遁入无尽黑暗，吸收所有伤害并累计，持续3秒后爆破，将（累计伤害总和的1.666倍）以魔法伤害反馈给自身600范围内敌方单位，冷却时间75秒。',
  爆破之戒:
    '爆破打击：普攻时7.5%触发，增加20000攻击力，增加1000主属性，增加1000点生命恢复速度，并附带4次（攻击力*1）的额外物理伤害（无视护甲），持续7.5秒，内置CD15秒。',
  '深沉悲伤 撕裂光芒':
    '每次攻击将造成伤害的0.5%存储提高生命值与魔法值上限， 提升生命上限为力量*1.5，提升魔法上限为智力*1.5，持续5秒。\r\n黑骑契约：对500码范围内造成持续5秒的伤害，每秒造成12X存储生命+20X存储魔法的魔法伤害，结束时造成60X存储生命+100X存储魔法的魔法伤害，并沉默1.5秒/1秒眩晕。 使用时清空存储生命魔法，冷却时间120秒。',
  '巨龙之怒 流年沙漏': '刷新D/Q/W/E/R/T技能，CD30秒',
  '湮灭之光 时间指环':
    '生命处于1以下时回复40%最大生命值，冷却300秒(若未触发而直接死亡，不会进入冷却)。\r\n时空扭曲：刷新最后一个使用的技能，10秒内免疫击退/眩晕/沉默，魔法恢复速度提升1500，冷却：90秒。\r\n',
  '浮生 弑光之钟':
    '神圣之光：800范围内友军单位提升护甲300， 800范围内友军单位提升最大生命值5000，每次使用技能储存1层神圣能量最多5层，持续时间8秒，使用释放神圣之光，周围半径600友军恢复（力量+敏捷+智力）x0.3x充能数的生命值，冷却10秒。',
  '苍穹俱宁 卸尘枷锁':
    '苍穹俱宁：800码范围内敌人锁定5秒，使其造成伤害减少50%，目标被拖到你的300范围内，并且每移动100距离就会受到25X主属性的魔法魔法伤害。如果目标距离超过1500范围或免疫击退，效果则会解除。冷却时间30秒。',
  '血祭 碧空之歌':
    '攻击强化：使目标敌人的护甲值减少225点（A型），持续3秒。下1次攻击造成3次额外攻击，造成200％的伤害。仅限近战。',
  '黑暗契约 死灵法书':
    '禁忌法术：消耗最大魔法值 50%。主属性提升（消耗的魔法值/75）（最多1200），攻击速度提升50%，持续10秒，冷却时间30秒。',
  '卓尔 圣焱之戒':
    '附魔：目标伤害提高7.5％，主要属性提高300\r\n圣焱：主动使用获得恢复最大生命值的40％\r\n冷却时间：30秒',
  '神气流转 寒岚之戒':
    '寒岚打击：魔法抗性降低6%\r\n禁锢麻痹：对敌人造成目标最大生命值2.5%的纯粹伤害，并且冰冻2秒。冷却时间30秒。',
  '消散 阳炎澄心':
    '阳炎爆炸:\r\n在一秒钟之后爆炸并死亡，对附近的敌人造成主属性X250的魔法伤害，晕眩3秒\r\n每5秒提高伤害50％（最多5次）\r\n冷却时间：180秒',
  殇灵光羽号角:
    '友军强化：750范围内友军单位，移动速度提升25%，攻击速度提升25%，生命恢复提升400，提升智力*1攻击伤害\r\n光羽打击：每秒使目标恢复10%生命值并移除目标DEBUFF，持续时间内目标生命值不会低于1， 持续时间3秒 ，冷却时间20秒。',
  统治者指环: '绝对守护：受到攻击时10%几率吸收该次伤害，内置CD6秒。',
  '眷恋 返照圣戒':
    '苏醒：\r\n立即恢复最大生命值/魔法值的50％；\r\n主属性+1000，持续10秒；\r\n增加的属性每秒减少100点；\r\n冷却时间：45秒。\r\n复活：\r\n冷却时间：240秒。',
  '星界微光 浩瀚玫瑰':
    '星界守护：\r\n向目标区域内的友军添加护盾持续5秒，护盾值为（智力X5 +最大生命值X20％）\r\n如果护盾阻挡一次技能，它会在结束后强化目标30秒，伤害提高6％/伤害减免提高12％\r\n冷却时间：45秒',
};
